AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>AUDADC</name>
      <version>1.0</version>
      <description>Audio Analog Digital Converter Control</description>
      <!-- <groupName>GROUP_AUDADC</groupName> -->
      <baseAddress>0x40210000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000294</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AUDADC0</name>
        <description>AUDADC0_IRQ</description>
        <value>42</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>The Audio ADC Configuration Register contains the software control for selecting the clock frequency used for the SAR conversions, the trigger polarity, the trigger select, the reference voltage select, the low power mode, the operating mode (single scan per trigger vs. repeating mode) and AUDADC enable.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x031F301D</resetMask>

          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Select the source and frequency for the AUDADC clock.This field should be left as is because HFRC_48MHz is the only clock selection and it is selected by default. All values enumerated below as 'RSVD' are undefined. The AUDADC controller automatically shuts off the clock in its low power modes. When setting ADCEN to '0', CLKSEL should remain set to 0x0 or 0x1 for proper power down sequencing.</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off mode. The HFRC, HFRC2, or high frequency XTAL clock must be selected for the AUDADC to function. The AUDADC controller automatically shuts off the clock in its low power modes. When setting ADCEN to '0', the CLKSEL should remain set to one of the two clock selects for proper power down sequencing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC_48MHz</name>
                  <description>HFRC Clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTALHS_24MHz</name>
                  <description>High frequency XTAL (nominally 24.567 MHz, but can vary depending on which XTAL is selected)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC2_48MHz</name>
                  <description>HFRC2 Clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPTTRIGSEL</name>
              <description>This bit selects which periodic trigger to use with RPTEN = 1.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR</name>
                  <description>Trigger from on-chip timer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Trigger from AUDADC-internal timer.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGPOL</name>
              <description>This bit selects the AUDADC trigger polarity for external off chip triggers.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RISING_EDGE</name>
                  <description>Trigger on rising edge.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING_EDGE</name>
                  <description>Trigger on falling edge.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGSEL</name>
              <description>Select the AUDADC trigger source.</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXT0</name>
                  <description>Off chip External Trigger0 (ADC_ET0)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT1</name>
                  <description>Off chip External Trigger1 (ADC_ET1)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT2</name>
                  <description>Off chip External Trigger2 (ADC_ET2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXT3</name>
                  <description>Off chip External Trigger3 (ADC_ET3)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCOMP</name>
                  <description>Voltage Comparator Output</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWT</name>
                  <description>Software Trigger</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAMPMODE</name>
              <description>Audio ADC sampling mode.  Changes to this control bit are applied when the audio ADC is not performing conversions.  This is the only control bit which is properly synchronized to AUDADC operation.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LP</name>
                  <description>Max of 2 low-gain PGA channels configured on slots 0 and 2.  In this mode, slots 1 and 3, if enabled, will still consume time but not perform conversions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MED</name>
                  <description>Max of 2 low-gain and 2 high-gain PGA channels.  In this mode, conversions will be performed on all enabled slots 0 through 3.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DFIFORDEN</name>
              <description>Destructive FIFO Read Enable. Setting this will enable FIFO pop upon reading the FIFOPR register.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Destructive Reads are prevented. Reads to the FIFOPR register will not POP an entry off the FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Reads to the FIFOPR registger will automatically pop an entry off the FIFO.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKMODE</name>
              <description>Clock mode register</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPCKMODE</name>
                  <description>Disable the clock between scans for LPMODE0. Set LPCKMODE to 0x1 while configuring the AUDADC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LLCKMODE</name>
                  <description>Low Latency Clock Mode. When set, HFRC and the adc_clk will remain on while in functioning in LPMODE0.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LPMODE</name>
              <description>Select power mode to enter between active scans.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE0</name>
                  <description>Low Power Mode 0. Leaves the AUDADC fully powered between scans with minimum latency between a trigger event and sample data collection.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE1</name>
                  <description>Low Power Mode 1. Powers down all circuity and clocks associated with the AUDADC until the next trigger event. Between scans, the reference buffer requires up to 50us of delay from a scan trigger event before the conversion will commence while operating in this mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPTEN</name>
              <description>This bit enables Repeating Scan Mode.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_SCAN</name>
                  <description>In Single Scan Mode, the AUDADC will complete a single scan upon each trigger event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REPEATING_SCAN</name>
                  <description>In Repeating Scan Mode, the AUDADC will complete its first scan upon the initial trigger event and all subsequent scans will occur at regular intervals defined by the configuration programmed for the CTTMRA3 timer or the AUDADC-internal timer (see the RPTTRIGSEL field) until the timer is disabled or the AUDADC is disabled. When disabling the AUDADC (setting ADCEN to '0'), the RPTEN bit should be cleared.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCEN</name>
              <description>This bit enables the AUDADC module. While the AUDADC is enabled, the ADCCFG and SLOT Configuration regsiter settings must remain stable and unchanged. All configuration register settings, slot configuration settings and window comparison settings should be written prior to setting the ADCEN bit to '1'.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable the AUDADC module.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable the AUDADC module.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>This register indicates the basic power status for the AUDADC. For detailed power status, see the power control power status register. AUDADC power mode 0 indicates the AUDADC is in its full power state and is ready to process scans. AUDADC Power mode 1 indicates the AUDADC enabled and in a low power state.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>PWDSTAT</name>
              <description>Indicates the power-status of the AUDADC.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Powered on.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>AUDADC Low Power Mode 1.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SWT</name>
          <description>This register enables initiating an AUDADC scan through software.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SWT</name>
              <description>Writing 0x37 to this register generates a software trigger.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GEN_SW_TRIGGER</name>
                  <description>Writing this value generates a software trigger.</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_SW_TRIGGER</name>
                  <description>Default value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SL0CFG</name>
          <description>Slot 0 Configuration</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x07FF0F03</resetMask>

          <fields>
            <field>
              <name>ADSEL0</name>
              <description>Select the number of measurements to average in the accumulate divide module for this slot.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG_1_MSRMT</name>
                  <description>Average in 1 measurement in the accumulate divide module for this slot.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_2_MSRMTS</name>
                  <description>Average in 2 measurements in the accumulate divide module for this slot.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_4_MSRMTS</name>
                  <description>Average in 4 measurements in the accumulate divide module for this slot.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_8_MSRMT</name>
                  <description>Average in 8 measurements in the accumulate divide module for this slot.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_16_MSRMTS</name>
                  <description>Average in 16 measurements in the accumulate divide module for this slot.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_32_MSRMTS</name>
                  <description>Average in 32 measurements in the accumulate divide module for this slot.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_64_MSRMTS</name>
                  <description>Average in 64 measurements in the accumulate divide module for this slot.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG_128_MSRMTS</name>
                  <description>Average in 128 measurements in the accumulate divide module for this slot.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRKCYC0</name>
              <description>Set additional input signal sampling/tracking time to the specified number of AUDADC clock cycles. (Note that a value of 0 in this register specifies the minimum required 5 cycles. A maximum of 64 specifies 69 cycles.)</description>
              <bitRange>[23:18]</bitRange>
              <access>read-write</access>

