AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>PRMODE7</name>
              <description>Set the Precision Mode For Slot 7.</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>P12B0</name>
                  <description>12-bit precision mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12B1</name>
                  <description>12-bit precision mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10B</name>
                  <description>10-bit precision mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P8B</name>
                  <description>8-bit precision mode</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHSEL7</name>
              <description>Select one of the 14 channel inputs for this slot.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE0</name>
                  <description>PGA channel A0 output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE1</name>
                  <description>PGA channel A1 output</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE2</name>
                  <description>PGA channel B0 output</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE3</name>
                  <description>PGA channel B1 output</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WCEN7</name>
              <description>This bit enables the window compare function for slot 7.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WCEN</name>
                  <description>Enable the window compare for slot 7.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WCDIS</name>
                  <description>Disable the window compare for slot 7.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SLEN7</name>
              <description>This bit enables slot 7 for AUDADC conversions.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLEN</name>
                  <description>Enable slot 7 for AUDADC conversions.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLDIS</name>
                  <description>Disable slot 7 for AUDADC conversions.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WULIM</name>
          <description>Window Comparator Upper Limits</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>ULIM</name>
              <description>Sets the upper limit for the window comparator.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WLLIM</name>
          <description>Window Comparator Lower Limits</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>LLIM</name>
              <description>Sets the lower limit for the window comparator.</description>
              <bitRange>[19:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCWLIM</name>
          <description>Scale Window Comparator Limits</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SCWLIMEN</name>
              <description>Scale the window limits compare values per precision mode. When set to 0x0 (default), the values in the 20-bit limits registers will compare directly with the FIFO values regardless of the precision mode the slot is configured to. When set to 0x1, the compare values will be divided by the difference in precision bits while performing the window limit comparisons.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

