AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LFRCCTRL</name>
          <description>LFRC control</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>LFRCPWD</name>
              <description>Power down LFRC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LFRCOUT</name>
              <description>Disable LFRC output</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DISPCLKCTRL</name>
          <description>Provides ability to select the PLL reference clock, and derivative of the display clock</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000BB</resetMask>

          <fields>
            <field>
              <name>DCCLKEN</name>
              <description>Enable for the PLL clock through clkgen</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DISPCLKSEL</name>
              <description>Selection for PLL reference clock.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Static value of 0 selected for DPHY clock input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC48</name>
                  <description>48MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC96</name>
                  <description>96MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPHYPLL</name>
                  <description>DPHY PLL</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLLCLKEN</name>
              <description>Enable for the PLL clock through clkgen</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PLLCLKSEL</name>
              <description>Selection for PLL reference clock.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Static value of 0 selected for DPHY clock input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC12</name>
                  <description>12MHz sourced from the HFRC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC6</name>
                  <description>6MHz sourced from the HFRC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXT_16</name>
                  <description>High Frequency XTAL input (16MHz)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKGENSPARES</name>
          <description>CLKGEN Spare Regs</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CLKGENSPARES</name>
              <description>Placeholer spare registes that can be used as needed for future use</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HFRCIDLECOUNTERS</name>
          <description>Provides SW controlled # idle cycles before powering down HFRC, HFRC2., core clock enable(s)</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x04050405</resetValue>
          <resetMask>0xBF3F3F3F</resetMask>

          <fields>
            <field>
              <name>UPDATEENABLE</name>
              <description>usage : Clear UPDATEENABLE or 1'b0; Update other bits fields of this register. Set this register to 1'b1 for HW to update.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRC2CLKREQDELAY</name>
              <description>Enable for the PLL clock through clkgen</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HFRC2PWRDOWNDELAY</name>
              <description>Idle counter for HFRC2 POWER DOWN DELAY</description>
              <bitRange>[21:16]</bitRange>
              <access>read-write</access>

