AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>NCR0END</name>
          <description>CM4 Cache Noncachable Region 0 End</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>End address for non-cacheable region 0</description>
              <bitRange>[28:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR1START</name>
          <description>CM4 Cache Noncachable Region 1 Start</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Start address for non-cacheable region 1</description>
              <bitRange>[28:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NCR1END</name>
          <description>CM4 Cache Noncachable Region 1 End</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFF0</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>End address for non-cacheable region 1</description>
              <bitRange>[28:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DAXICFG</name>
          <description>DAXI Config</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000B0300</resetValue>
          <resetMask>0x031F0F3F</resetMask>

          <fields>
            <field>
              <name>MRUGROUPLEVEL</name>
              <description>Sets the MRU group population limit.</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAX</name>
                  <description>Maximum level for current number of buffers enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONELESSTHANMAX</name>
                  <description>One less than maximum level or zero for current number of buffers enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOLESSTHANMAX</name>
                  <description>Two less than maximum level or zero for current number of buffers enabled.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREELESSTHANMAX</name>
                  <description>Three less than maximum level or zero for current number of buffers enabled.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGINGCOUNTER</name>
              <description>Specifies the relative time that DAXI buffers may remain unused before being flushed. Counter is based on CPU clock cycles and buffers will generally be flushed in 1-2 AGINGCOUNTER timesteps.</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>One step per age</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Two steps per age</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Four steps per age</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>EIGHT steps per age</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>Sixteen steps per age</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYTWO</name>
                  <description>Thirty-two steps per age</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTYFOUR</name>
                  <description>64 steps per age</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEHUNDREDTWENTYEIGHT</name>
                  <description>One hundred twenty-eight steps per age</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOHUNDEREDFIFTYSIX</name>
                  <description>Two hundred fifty-six steps per age</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVEHUNDREDTWELVE</name>
                  <description>Five hundred twelve steps per age</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ONEK</name>
                  <description>One thousand twenty-four steps per age</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWOK</name>
                  <description>Two thousand forty-eight steps per age</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURK</name>
                  <description>Four thousand ninety-six steps per age</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHTK</name>
                  <description>Eight thousand one hundred ninety-two steps per age</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEENK</name>
                  <description>Sixteen thousand three hundred eighty-four steps per age</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYTWOK</name>
                  <description>Thirty-two thousand seven hundred sixty-eight steps per age</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTYFOURK</name>
                  <description>Sixty-fix thousand five hundred thirty-six steps per age</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFFERENABLE</name>
              <description>Enables DAXI buffers</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ONE</name>
                  <description>One buffer mode enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Two buffers enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Three buffers enabled.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOUR</name>
                  <description>Four buffers enabled.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIVE</name>
                  <description>Five buffers enabled.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIX</name>
                  <description>Six buffers enabled.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEVEN</name>
                  <description>Seven buffers enabled.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EIGHT</name>
                  <description>Eight buffers enabled.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTEEN</name>
                  <description>Eight buffers enabled.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FOURTEEN</name>
                  <description>Eight buffers enabled.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFTEEN</name>
                  <description>Eight buffers enabled.</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIXTEEN</name>
                  <description>Eight buffers enabled.</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TWENTYNINE</name>
                  <description>Twenty-nine buffers enabled.</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTY</name>
                  <description>Thirty buffers enabled.</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYONE</name>
                  <description>Thirty-one buffers enabled.</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THIRTYTWO</name>
                  <description>Thirty-two buffers enabled.</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAXISTATECLKGATEEN</name>
              <description>Enables clock gating of DAXI state.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gating of DAXI state.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gating of DAXI state.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAXIDATACLKGATEEN</name>
              <description>Enables clock gating of DAXI line buffer data.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gating of DAXI line buffer data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gating of DAXI line buffer data.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAXIBECLKGATEEN</name>
              <description>Enables clock gating of DAXI line buffer byte enables.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable clock gating of DAXI line buffer byte enables.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable clock gating of DAXI line buffer byte enables.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAXIPASSTHROUGH</name>
              <description>Passes requests through DAXI logic, disables caching lines in the DAXI line buffers.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable pass through mode, caching lines in DAXI enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable pass through mode, caching lines in DAXI disabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AGINGSENABLE</name>
              <description>Enables flushing out shared lines using the aging mechanism.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Flushing out shared entries using aging mechanism disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Flushing out shared entries using aging mechanism enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLUSHLEVEL</name>
              <description>Level of free buffers to flush out dirty buffers.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TWO</name>
                  <description>Flush out dirty buffers if 3 or more ane enabled and less than two are free or if 2 are enabled and none are free.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THREE</name>
                  <description>Flush out dirty buffers if 3 or more are enabled less than three are free or if 2 are enabled and less then two are free.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DAXICTRL</name>
          <description>DAXI Control</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>DAXIRAXIBUSY</name>
              <description>DAXI status indicating the DAXI RAXI interface is busy.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

