AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>REGA</name>
              <description>Operand A virtual address 0-15.</description>
              <bitRange>[23:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REGB</name>
              <description>Operand B virtual address 0-15.</description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REGR</name>
              <description>Result register virtual address 0-15.</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TAG</name>
              <description>Holds the operations tag or the operand C virtual address.</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>NNPT0T1ADDR</name>
          <description>This register maps N_NP_T0_T1 to a virtual address.</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000FF820</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>T1VIRTUALADDR</name>
              <description>Virtual address of temporary register number 1</description>
              <bitRange>[19:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>T0VIRTUALADDR</name>
              <description>Virtual address of temporary register number 0</description>
              <bitRange>[14:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NPVIRTUALADDR</name>
              <description>Virtual address of register NP.</description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>NVIRTUALADDR</name>
              <description>Virtual address of register N.</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PKASTATUS</name>
          <description>This register holds the PKA pipe status.</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00001000</resetValue>
          <resetMask>0x001FFFFF</resetMask>

          <fields>
            <field>
              <name>OPCODE</name>
              <description>Opcode of the last operation</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MODINVOFZERO</name>
              <description>Indicates the Modular inverse of zero.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DIVBYZERO</name>
              <description>Indication if the division is done by zero.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALUMODOVRFLW</name>
              <description>Modular overflow flag.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALUOUTZERO</name>
              <description>Indicates if the result of ALU OUT is zero.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALUSUBISZERO</name>
              <description>Indicates the last subtraction operations sign .</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALUCARRYMOD</name>
              <description>holds the carry of the last Modular operation.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALUCARRY</name>
              <description>Holds the carry of the last ALU operation.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALUSIGNOUT</name>
              <description>Indicates the last operations sign (MSB).</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALULSB4BITS</name>
              <description>The least significant 4-bits of the operand updated in shift operation.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ALUMSB4BITS</name>
              <description>The most significant 4-bits of the operand updated in shift operation.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PKASWRESET</name>
          <description>Writing to this register triggers a software reset of the PKA.</description>
          <addressOffset>0x0000008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>PKASWRESET</name>
              <description>The reset mechanism takes about four PKA clock cycles until the reset line is deasserted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

