AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>NUMOFROUNDS</name>
              <description>The core of ChaCha is a hash function which based on rotation operations. The hash function consist in application of 20 rounds (default value). In additional, ChaCha have two variants (they work exactly as the original algorithm): ChaCha20_8 and ChaCha20_12 (using 8 and 12 rounds).</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>20_ROUNDS</name>
                  <description>20 rounds</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12_ROUNDS</name>
                  <description>12 rounds</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_ROUNDS</name>
                  <description>8 rounds</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>N_A</name>
                  <description>Not applicable</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYLEN</name>
              <description>For All Core:</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>256_BIT</name>
                  <description>256 bit.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128_BIT</name>
                  <description>128 bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALCKEYFORPOLY1305</name>
              <description>Only if ChaCha core:</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INITFROMHOST</name>
              <description>Start init for new Message:</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHAORSALSA</name>
              <description>Core:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHACHA</name>
                  <description>ChaCha mode,</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SALSA</name>
                  <description>Salsa mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAVERSION</name>
          <description>CHACHA Version</description>
          <addressOffset>0x00000384</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAVERSION</name>
              <description>CHACHA version.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY0</name>
          <description>bits 255:224 of CHACHA Key</description>
          <addressOffset>0x00000388</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY0</name>
              <description>bits 255:224 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY1</name>
          <description>bits 223:192 of CHACHA Key</description>
          <addressOffset>0x0000038C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY1</name>
              <description>bits 223:192 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAKEY2</name>
          <description>bits 191:160 of CHACHA Key</description>
          <addressOffset>0x00000390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAKEY2</name>
              <description>bits191:160 of CHACHA Key</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

