AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHABLOCKCNTMSB</name>
          <description>The two first words (n) in the last row of the cipher matrix are the block counter. At the end of each block (512b), the block_cnt for the next block is written by HW to the block_cnt_lsb and block_cnt_msb registers. Need reset block counter , if start new message.</description>
          <addressOffset>0x000003BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHABLOCKCNTMSB</name>
              <description>bits 31:0 of CHACHA_BLOCK_CNT_MSB register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHASWRESET</name>
          <description>Resets CHACHA_SALSA engine.</description>
          <addressOffset>0x000003C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CHACHSWRESET</name>
              <description>Writing to this address resets the only FSM of CHACHA engine. The reset takes 4 CORE_CLK cycles.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAFORPOLYKEY0</name>
          <description>bits 255:224 of CHACHA_FOR_POLY_KEY</description>
          <addressOffset>0x000003C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAFORPOLYKEY0</name>
              <description>bits 255:224 of CHACHA_FOR_POLY_KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAFORPOLYKEY1</name>
          <description>bits 223:192 of CHACHA_FOR_POLY_KEY</description>
          <addressOffset>0x000003C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAFORPOLYKEY1</name>
              <description>bits 223:192 of CHACHA_FOR_POLY_KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAFORPOLYKEY2</name>
          <description>bits191:160 of CHACHA_FOR_POLY_KEY</description>
          <addressOffset>0x000003CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAFORPOLYKEY2</name>
              <description>bits191:160 of CHACHA_FOR_POLY_KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAFORPOLYKEY3</name>
          <description>bits159:128 of CHACHA_FOR_POLY_KEY</description>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAFORPOLYKEY3</name>
              <description>bits 159:128 of CHACHA_FOR_POLY_KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAFORPOLYKEY4</name>
          <description>bits 127:96 of CHACHA_FOR_POLY_KEY</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAFORPOLYKEY4</name>
              <description>bits 127:96 of CHACHA_FOR_POLY_KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAFORPOLYKEY5</name>
          <description>bits 95:64 of CHACHA_FOR_POLY_KEY</description>
          <addressOffset>0x000003D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAFORPOLYKEY5</name>
              <description>bits 95:64 of CHACHA_FOR_POLY_KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHACHAFORPOLYKEY6</name>
          <description>bits 63:32 of CHACHA_FOR_POLY_KEY</description>
          <addressOffset>0x000003DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHACHAFORPOLYKEY6</name>
              <description>bits 63:32 of CHACHA_FOR_POLY_KEY</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

