AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>AESIV03</name>
          <description>bits 127:96 of AES_IV0 128b register.For the description of AES_IV0, see the AES_IV_0_0 register description</description>
          <addressOffset>0x0000044C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV03</name>
              <description>bits 127:96 of AES_IV0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESIV10</name>
          <description>bits 31:0 of AES_IV1 128b register.AES IV1 is used as the AES IV (Initialization Value) register as the second tunnel stage IV register in tunneling operations.The IV register should be loaded according to the AES mode:in AES CBC_CBC-MAC - the AES IV register should be loaded with the IV (initialization vector).in XTS-AES - the AES IV register should be loaded with the T value (unless the HW T calculation mode is active, in which the T value is calculated by the HW.</description>
          <addressOffset>0x00000450</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV10</name>
              <description>bits 31:0 of AES_IV1 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESIV11</name>
          <description>bits 63:32 of AES_IV1 128b register.For the description of AES_IV1, see the AES_IV_1_0 register description</description>
          <addressOffset>0x00000454</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV11</name>
              <description>bits 63:32 of AES_IV1 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESIV12</name>
          <description>bits 95:64 of AES_IV1 128b register.For the description of AES_IV1, see the AES_IV_1_0 register description</description>
          <addressOffset>0x00000458</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV12</name>
              <description>bits 95:64 of AES_IV1 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESIV13</name>
          <description>bits 127:96 of AES_IV1 128b register.For the description of AES_IV1, see the AES_IV_1_0 register description</description>
          <addressOffset>0x0000045C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESIV13</name>
              <description>bits 127:96 of AES_IV1 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCTR00</name>
          <description>bits 31:0 of AES_CTR0 128b register.AES CTR0 is used as the AES CTR (counter) register in non-tunneling operations, and as the first tunnel stage CTR register in tunneling operations.The CTR register should be loaded according to the AES mode:in AES CTR_GCTR - the AES CTR register should be loaded with the counter value.in XTS-AES - the AES CTR register should be loaded with the i value (in order to calculate the T value from it, if HW T calculation is supported).</description>
          <addressOffset>0x00000460</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESCTR00</name>
              <description>bits 31:0 of AES_CTR0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCTR01</name>
          <description>bits 63:32 of AES_CTR0 128b register.For the description of AES_CTR0, see the AES_CTR_0_0 register description.</description>
          <addressOffset>0x00000464</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESCTR01</name>
              <description>bits 63:32 of AES_CTR0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCTR02</name>
          <description>bits 95:64 of AES_CTR0 128b register.For the description of AES_CTR0, see the AES_CTR_0_0 register description.</description>
          <addressOffset>0x00000468</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AESCTR02</name>
              <description>bits 95:64 of AES_CTR0 register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

