AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>SECONDREGSSETEXIST</name>
              <description>the SECOND_REGS_SET_EXIST flag</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>aestunnelexists</name>
              <description>the aes_tunnel_exists flag</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESSUPPORTPREVIV</name>
              <description>the AES_SUPPORT_PREV_IV flag</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USE5SBOXES</name>
              <description>the USE_5_SBOXES flag</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USESBOXTABLE</name>
              <description>the USE_SBOX_TABLE flag</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ONLYENCRYPT</name>
              <description>the ONLY_ENCRYPT flag</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTREXIST</name>
              <description>the CTR_EXIST flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPACNTRMSREXIST</name>
              <description>the DPA_CNTRMSR_EXIST flag</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AESLARGERKEK</name>
              <description>the AES_LARGE_RKEK flag</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SUPPORT256192KEY</name>
              <description>the SUPPORT_256_192_KEY flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCTRNOINCREMENT</name>
          <description>This register enables the AES CTR no increment mode (in which the counter mode is not incremented between 2 blocks)</description>
          <addressOffset>0x000004D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESCTRNOINCREMENT</name>
              <description>This field enables the AES CTR 'no increment' mode (in which the counter mode is not incremented between 2 blocks)</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESDFAISON</name>
          <description>This register disable_enable the AES dfa. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x000004F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESDFAISON</name>
              <description>writing to this register turns the DFA counter-measures on. this register exists only if DFA countermeasures are supported</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESDFAERRSTATUS</name>
          <description>dfa error status register.</description>
          <addressOffset>0x000004F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESDFAERRSTATUS</name>
              <description>after a DFA violation this register is set and the AES block is disabled) until the next reset. this register only exists if DFA countermeasures is are supported</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCMACSIZE0KICK</name>
          <description>writing to this address triggers the AES engine to perform a CMAC operation with size 0. The CMAC result can be read from the AES_IV0 register.</description>
          <addressOffset>0x00000524</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AESCMACSIZE0KICK</name>
              <description>writing to this address triggers the AES engine to perform a CMAC operation with size 0. The CMAC result can be read from the AES_IV0 register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HASHH0</name>
          <description>H0 data. can only be written in the following HASH_CONTROL modes: MD5 SHA1 SHA224 SHA256 SHA384 SHA512</description>
          <addressOffset>0x00000640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HASHH0</name>
              <description>1) Write initial Hash value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

