AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HASHENDIANESS</name>
          <description>This register holds the HASH_ENDIANESS configuration.</description>
          <addressOffset>0x000007E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ENDIAN</name>
              <description>The default value is little-endian. The data and generation of padding can be swapped to be big-endian.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AESCLKENABLE</name>
          <description>This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000810</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the AES clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_E</name>
                  <description>the AES clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_D</name>
                  <description>the AES clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHCLKENABLE</name>
          <description>The HASH clock enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000818</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the hash clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HASH_E</name>
                  <description>the HASH clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH_D</name>
                  <description>the HASH clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PKACLKENABLE</name>
          <description>The PKA clock enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x0000081C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the PKA clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKA_E</name>
                  <description>the PKA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKA_D</name>
                  <description>the PKA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACLKENABLE</name>
          <description>DMA_CLK enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000820</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the DMA clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_E</name>
                  <description>the DMA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_D</name>
                  <description>the DMA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATUS</name>
          <description>The CryptoCell clocks status register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000824</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000018D</resetMask>

          <fields>
            <field>
              <name>DMACLKSTATUS</name>
              <description>Status of DMA clock enable.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_E</name>
                  <description>the DMA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_D</name>
                  <description>the DMA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHACHACLKSTATUS</name>
              <description>Status of CHACHA clock enable.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHACHA_E</name>
                  <description>the CHACHA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHACHA_D</name>
                  <description>the CHACHA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKACLKSTATUS</name>
              <description>Status of PKA clock enable.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKA_E</name>
                  <description>the PKA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKA_D</name>
                  <description>the PKA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASHCLKSTATUS</name>
              <description>Status of HASH clock clock enable.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HASH_E</name>
                  <description>the HASH clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH_D</name>
                  <description>the HASH clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESCLKSTATUS</name>
              <description>Status of AES clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_E</name>
                  <description>the AES clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK_D</name>
                  <description>the AES clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHACHACLKENABLE</name>
          <description>CHACHA _SALSA clock enable register. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000858</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>Enable the CHACHA SALSA clock enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHACHA_E</name>
                  <description>the CHACHA SALSA clock is enabled.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHACHA_D</name>
                  <description>the CHACHA SALSA clock is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTOCTL</name>
          <description>Defines the cryptographic flow.</description>
          <addressOffset>0x00000900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>MODE</name>
              <description>Determines the active cryptographic engine:</description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>bypass</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES</name>
                  <description>aes</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_TO_HASH</name>
                  <description>aes to hash</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_AND_HASH</name>
                  <description>aes and hash</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES</name>
                  <description>des</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES_TO_HASH</name>
                  <description>des to hash</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES_AND_HASH</name>
                  <description>des and hash</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HASH</name>
                  <description>hash</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_MAC_AND_BYPASS</name>
                  <description>aes mac and bypass</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES_TO_HASH_AND_DOUT</name>
                  <description>aes to hash and _dout</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved1</name>
                  <description>reserved1</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reserved2</name>
                  <description>reserved2</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CRYPTOBUSY</name>
          <description>This register is set when the cryptographic core is busy.</description>
          <addressOffset>0x00000910</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CRYPTOBUSY</name>
              <description>Crypto busy status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>HASHBUSY</name>
          <description>This register is set when the Hash engine is busy.</description>
          <addressOffset>0x0000091C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HASHBUSY</name>
              <description>Hash busy status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Ready</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>Busy</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CONTEXTID</name>
          <description>A general RD_WR register. For Firmware use.</description>
          <addressOffset>0x00000930</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CONTEXTID</name>
              <description>Context ID</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

