AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>GHASHINIT</name>
          <description>Writing to this address sets the GHASH engine to be ready to a new GHASH operation.</description>
          <addressOffset>0x00000984</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>GHASHINIT</name>
              <description>Writing to this address sets the GHASH engine to be ready to a new GHASH operation.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTRGFIRR</name>
          <description>The Interrupt Request register. Each bit of this register holds the interrupt status of a single interrupt source.</description>
          <addressOffset>0x00000A00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FF0</resetMask>

          <fields>
            <field>
              <name>SYMDMACOMPLETED</name>
              <description>The GPR interrupt status.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGINT</name>
              <description>The RNG interrupt status.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKAEXPINT</name>
              <description>The PKA end of operation interrupt status.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AHBERRINT</name>
              <description>The AXI error interrupt status.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DOUTTOMEMINT</name>
              <description>The DOUT to memory DMA done interrupt status. This interrupt is asserted when all data was delivered to memory buffer from DOUT.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMTODININT</name>
              <description>The memory to DIN DMA done interrupt status. This interrupt is asserted when all data was delivered to DIN buffer from memory.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DOUTTOSRAMINT</name>
              <description>The DOUT to SRAM DMA done interrupt status. This interrupt is asserted when all data was delivered to SRAM buffer from DOUT.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAMTODININT</name>
              <description>The SRAM to DIN DMA done interrupt status. This interrupt is asserted when all data was delivered to DIN buffer from SRAM.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTRGFIMR</name>
          <description>The Interrupt Mask register. Each bit of this register holds the mask of a single interrupt source.</description>
          <addressOffset>0x00000A04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000FF0</resetValue>
          <resetMask>0x00000FF0</resetMask>

          <fields>
            <field>
              <name>SYMDMACOMPLETEDMASK</name>
              <description>The GPR interrupt mask.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RNGINTMASK</name>
              <description>The RNG interrupt mask.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKAEXPMASK</name>
              <description>The PKA end of operation interrupt mask.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AXIERRMASK</name>
              <description>The AXI error interrupt mask.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DOUTTOMEMMASK</name>
              <description>The DOUT to memory DMA done interrupt mask.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMTODINMASK</name>
              <description>The memory to DIN DMA done interrupt mask.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DOUTTOSRAMMASK</name>
              <description>The DOUT to SRAM DMA done interrupt mask.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SRAMTODINMASK</name>
              <description>The SRAM to DIN DMA done interrupt mask.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTRGFICR</name>
          <description>Interrupt Clear Register.</description>
          <addressOffset>0x00000A08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000FF0</resetMask>

          <fields>
            <field>
              <name>SYMDMACOMPLETEDCLEAR</name>
              <description>The GPR interrupt clear.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

