AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>HOSTPOWERDOWN</name>
          <description>This register start the power-down sequence. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000A80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTPOWERDOWN</name>
              <description>Power down enable register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTREMOVEGHASHENGINE</name>
          <description>These inputs are to be statically tied to 0 or 1 by the customers. When such an input is set, the matching engines inputs are tied to zero and its outputs are disconnected, so that the engine will be entirely removed by Synthesis</description>
          <addressOffset>0x00000A84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTREMOVEGHASHENGINE</name>
              <description>Read the Remove_chacha_engine input</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTREMOVECHACHAENGINE</name>
          <description>These inputs are to be statically tied to 0 or 1 by the customers. When such an input is set, the matching engines inputs are tied to zero and its outputs are disconnected, so that the engine will be entirely removed by Synthesis</description>
          <addressOffset>0x00000A88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>HOSTREMOVECHACHAENGINE</name>
              <description>Read the Remove_ghash_engine input</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AHBMSINGLES</name>
          <description>This register forces the ahb transactions to be always singles.</description>
          <addressOffset>0x00000B00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AHBSINGLES</name>
              <description>Force ahb singles</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AHBMHPROT</name>
          <description>This register holds the ahb prot value</description>
          <addressOffset>0x00000B04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>AHBPROT</name>
              <description>The ahb prot value</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AHBMHMASTLOCK</name>
          <description>This register holds ahb hmastlock value</description>
          <addressOffset>0x00000B08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AHBHMASTLOCK</name>
              <description>The hmastlock value.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AHBMHNONSEC</name>
          <description>This register holds ahb hnonsec value</description>
          <addressOffset>0x00000B0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>AHBREADHNONSEC</name>
              <description>The hnonsec value for read transaction.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AHBWRITEHNONSEC</name>
              <description>The hnonsec value for write transaction.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DINBUFFER</name>
          <description>This address can be used by the CPU to write data directly to the DIN buffer to be sent to engines.</description>
          <addressOffset>0x00000C00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00008770</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DINBUFFERDATA</name>
              <description>This register is mapped into 8 addresses in order to enable a CPU burst.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DINMEMDMABUSY</name>
          <description>Indicates whether memory (AXI) source DMA (DIN) is busy.</description>
          <addressOffset>0x00000C20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DINMEMDMABUSY</name>
              <description>DIN memory DMA busy</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>busy</name>
                  <description>DMA busy</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>not</name>
                  <description>DMA not busy</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRCLLIWORD0</name>
          <description>This register is used in direct LLI mode - holds the location of the data source in the memory (AXI).</description>
          <addressOffset>0x00000C28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRCLLIWORD0</name>
              <description>Source address within memory.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

