AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SRCLLIWORD1</name>
          <description>This register is used in direct LLI mode - holds the number of bytes to be read from the memory (AXI). Writing to this register triggers the DMA. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000C2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAST</name>
              <description>0x1 - Indicates the last LLI entry</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIRST</name>
              <description>0x1 - Indicates the first LLI entry</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BYTESNUM</name>
              <description>Total number of bytes to read using DMA in this entry</description>
              <bitRange>[29:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMSRCADDR</name>
          <description>Location of data (start address) to be read from SRAM. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000C30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMSOURCE</name>
              <description>SRAM source base address of data</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DINSRAMBYTESLEN</name>
          <description>This register holds the size of the data (in bytes) to be read from the SRAM. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000C34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>BYTESLEN</name>
              <description>Size of data to read from SRAM (bytes). This is the trigger to the SRAM SRC DMA.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DINSRAMDMABUSY</name>
          <description>This register holds the status of the SRAM DMA DIN.</description>
          <addressOffset>0x00000C38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BUSY</name>
              <description>DIN SRAM DMA busy:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>busy</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_BUSY</name>
                  <description>not busy</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DINSRAMENDIANNESS</name>
          <description>This register defines the endianness of the DIN interface to SRAM.</description>
          <addressOffset>0x00000C3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SRAMDINENDIANNESS</name>
              <description>Defines the endianness of DIN interface to SRAM:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BE</name>
                  <description>big-endianness</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LE</name>
                  <description>little endianness</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DINCPUDATASIZE</name>
          <description>This register hold the number of bytes to be transmited using external DMA. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000C48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CPUDINSIZE</name>
              <description>When using external DMA, the size of transmited data in bytes should be written to this register.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FIFOINEMPTY</name>
          <description>DIN FIFO empty indication</description>
          <addressOffset>0x00000C50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>EMPTY</name>
              <description>0x1 - FIFO empty</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

