AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTSRAMDMABUSY</name>
          <description>This register holds the status of the SRAM DMA DOUT.</description>
          <addressOffset>0x00000D38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>BUSY</name>
              <description>DOUT SRAM DMA busy status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA_SRAM</name>
                  <description>all data was written to SRAM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_BUSY</name>
                  <description>DOUT SRAM DMA busy.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DOUTSRAMENDIANNESS</name>
          <description>This register defines the endianness of the DOUT interface from SRAM.</description>
          <addressOffset>0x00000D3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DOUTSRAMENDIANNESS</name>
              <description>Defines the endianness of DOUT interface from SRAM:</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BE</name>
                  <description>big-endianness</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LE</name>
                  <description>little endianness</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>READALIGNLAST</name>
          <description>Indication that the next read from the CPU is the last one. This is needed only when the data size is NOT modulo 4 (e.g. HASH padding).</description>
          <addressOffset>0x00000D44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>LAST</name>
              <description>0x1 - Flush the read aligner content (used for reading the last data).</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DOUTFIFOEMPTY</name>
          <description>DOUT_FIFO_EMPTY Register.</description>
          <addressOffset>0x00000D50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>DOUTFIFOEMPTY</name>
              <description>DOUT FIFO empty status.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFO_NE</name>
                  <description>DOUT FIFO is not empty</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFO_EDOUT</name>
                  <description>FIFO is empty</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SRAMDATA</name>
          <description>READ WRITE DATA FROM SRAM. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00000F00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SRAMDATA</name>
              <description>32 bit write or read from SRAM: read - triggers the SRAM read DMA address automatically incremented write - triggers the SRAM write DMA address automatically incremented</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMADDR</name>
          <description>first address given to SRAM DMA for read_write transactions from SRAM</description>
          <addressOffset>0x00000F04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00007FFF</resetMask>

          <fields>
            <field>
              <name>SRAMADDR</name>
              <description>SRAM starting address</description>
              <bitRange>[14:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMDATAREADY</name>
          <description>The SRAM content is ready for read in SRAM_DATA.</description>
          <addressOffset>0x00000F08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>SRAMREADY</name>
              <description>SRAM content is ready for read in SRAM_DATA.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

