AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID4</name>
          <description>Peripheral ID 4 (PID4).</description>
          <addressOffset>0x00000FD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000004</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>DES2JEP106</name>
              <description>for ARM products.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID0</name>
          <description>Peripheral ID 0 (PID0).</description>
          <addressOffset>0x00000FE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000C0</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PART0</name>
              <description>Identification register part number, bits[7:0]</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID1</name>
          <description>Peripheral ID 1 (PID1).</description>
          <addressOffset>0x00000FE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000B0</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DES0JEP106</name>
              <description>for ARM products.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PART1</name>
              <description>Identification register part number, bits[11:8]</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID2</name>
          <description>Peripheral ID 2 (PID2).</description>
          <addressOffset>0x00000FE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000002B</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>REVISION</name>
              <description>starts at zero and increments for every new IP release.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>JEDEC</name>
              <description>constant 0x1. Indicates that a JEDEC assigned value is used.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DES1JEP106</name>
              <description>for ARM products.</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PERIPHERALID3</name>
          <description>Peripheral ID 3 (PID3).</description>
          <addressOffset>0x00000FEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>REVAND</name>
              <description>starts at zero for every Revision, and increments if metal fixes are applied between 2 IP releases.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMOD</name>
              <description>Customer Modified, normally zero, but if a partner applies any changes themselves, they must change this value.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID0</name>
          <description>Component ID0.</description>
          <addressOffset>0x00000FF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000D</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PRMBL0</name>
              <description>constant 0xD</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID1</name>
          <description>Component ID1.</description>
          <addressOffset>0x00000FF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000000F0</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CLASS</name>
              <description>component type 0 0xF for Cryptocell</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PRMBL1</name>
              <description>constant 0x0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>COMPONENTID2</name>
          <description>Component ID2.</description>
          <addressOffset>0x00000FF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000005</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>PRMBL2</name>
              <description>constant 0x5</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

