AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK0</name>
          <description>The DCU lock register.</description>
          <addressOffset>0x00001E20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK0</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [31:0] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK1</name>
          <description>The 'ICV_DCU_restriction_mask' parameter is read by FW during the secure debug verification to prevent OEM from setting specific DCUs that protect ICV secrets</description>
          <addressOffset>0x00001E24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK1</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [63:32] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK2</name>
          <description>The 'ICV_DCU_restriction_mask' parameter is read by FW during the secure debug verification to prevent OEM from setting specific DCUs that protect ICV secrets</description>
          <addressOffset>0x00001E28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK2</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [95:64] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOICVDCURESTRICTIONMASK3</name>
          <description>The 'ICV_DCU_restriction_mask' parameter is read by FW during the secure debug verification to prevent OEM from setting specific DCUs that protect ICV secrets</description>
          <addressOffset>0x00001E2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AOICVDCURESTRICTIONMASK3</name>
              <description>AO_ICV_DCU_RESTRICTION_MASK [127:96] parameter, that will be a customer modifiable.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AOCCSECDEBUGRESET</name>
          <description>The reset-upon-debug indication</description>
          <addressOffset>0x00001E30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>AOCCSECDEBUGRESET</name>
              <description>For resets Cerberus, and prevents loading the HW keys after that reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HOSTAOLOCKBITS</name>
          <description>These masks will define, per LCS, which DCU bits will be tied to zero, even if the Host tries to set them. Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001E34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x000001FF</resetMask>

          <fields>
            <field>
              <name>HOSTDFAENABLELOCK</name>
              <description>When this FW control is set, the DFA_ENABLE register cant be written until the next POR. The DFA_ENABLE_LOCK register is set-once (per POR).</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTFORCEDFAENABLE</name>
              <description>When this FW controlled register is set, the AES DFA countermeasures are enabled_disabled (regardless of the AES_DFA_IS_ON register value).</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESETUPONDEBUGDISABLE</name>
              <description>The RESET_UPON_DEBUG_DISABLE register is set-once (per POR).</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTICVRMALOCK</name>
              <description>The ICV_RMA_LOCK register is set-once (per POR).</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTKCELOCK</name>
              <description>When this FW controlled register is set, the Kce HW key is masked (to zero).</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HOSTKCPLOCK</name>
              <description>When this FW controlled register is set, the Kcp HW key is masked (to zero).</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

