AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>OTPADDRWIDTHDEF</name>
          <description>OTP_ADDR_WIDTH parameter, that will define the integrated OTP address width (address in words). The supported sizes are 6 (for 2 Kbits),7,8,9,11 (for 64 Kbits). The default value in the provided RTL will be 6.Note: This is a special register, affected by internal logic. Test result of this register is NA.</description>
          <addressOffset>0x00001F2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000000B</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>OTPADDRWIDTHDEF</name>
              <description>Holds the OTP_ADDR_WIDTH_DEF value.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>DC</name>
      <version>1.0</version>
      <description>Display Controller</description>
      <!-- <groupName>GROUP_DC</groupName> -->
      <baseAddress>0x400A0000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00001C04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DC</name>
        <description>DC_IRQ</description>
        <value>29</value>
      </interrupt>
      <registers>
        <register>
          <name>MODE</name>
          <description>General control register that activates the NEMAp|dc400  controller and various parameters, sets the timing signals'  polarity, activates the global look-up table for gamma correction and chooses the output display formats to meet LCD color specifications.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DC400ACT</name>
              <description>When set to 1, the dc400  controller is activated</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CUSOREN</name>
              <description>When set to 1, programmable cursor is enabled</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD4</name>
              <description>This field is reserved.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VSYNCPOL</name>
              <description>Defines VSYNC polarity</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VSYNC_NEG</name>
                  <description>VSYNC polarity is negative</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VSYNC_POS</name>
                  <description>VSYNC polarity is positive</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HSYNCPOL</name>
              <description>Defines HSYNC polarity</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HSYNC_NEG</name>
                  <description>HSYNC polarity is negative</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSYNC_POS</name>
                  <description>HSYNC polarity is positive</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEPOL</name>
              <description>Defines DE polarity</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DE_NEG</name>
                  <description>DE polarity is negative</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DE_POS</name>
                  <description>DE polarity is positive</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD3</name>
              <description>This field is reserved.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DITHEREN</name>
              <description>When set to 1, dithering is enabled</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VSYNCEN</name>
              <description>When set to 1, VSYNC for a single cycle per line is enabled</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PIXCLKPOL</name>
              <description>Defines Pixel Clock out polarity</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POL_NEG</name>
                  <description>Pixel Clock out polarity is negative</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POL_POS</name>
                  <description>Pixel Clock out polarity is positive</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD2</name>
              <description>This field is reserved.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

