AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>GAMARAMPEN</name>
              <description>When set to 1, gamma ramp is enabled</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BLANKFRC</name>
              <description>When set to 1, forces output to blank</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1</name>
              <description>This field is reserved.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRAMEUPDTEN</name>
              <description>When set to 1, single frame update is enabled</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0</name>
              <description>This field is reserved.</description>
              <bitRange>[16:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PLLCLKNDIV</name>
              <description>When set to 1, PLL_CLK is not divided</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LVDSPADSEN</name>
              <description>When set to 1, LVDS output pads are enabled</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COLFMT</name>
              <description>Output color format:</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YUV_EN</name>
                  <description>YUV/YCbCr format is enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB_EN</name>
                  <description>RGB format is enabled</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISPFMT</name>
              <description>Display data format</description>
              <bitRange>[8:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPI</name>
                  <description>DPI Interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE3</name>
                  <description>Byte-3 beat Interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYTE4</name>
                  <description>Byte-4 beat (RGBX) Interface</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SERIAL</name>
                  <description>Two phase serial 12-bit</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDS2</name>
                  <description>LVDS 24-bit unbalanced single pixel format 2</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LVDS1</name>
                  <description>LVDS 24-bit unbalanced single pixel format 1</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUYV</name>
                  <description>YUYV (16-bit mode)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BT656</name>
                  <description>BT.656</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JDI</name>
                  <description>JDI MIP</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBITYPEBEN</name>
              <description>When set to 1, DBI Type-B interface is enabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>YUYVEN</name>
              <description>When set to 1, the following output color formats are enabled : Byte-3 beat Interface enabled, Byte-4 beat (RGBX) Interface enabled, Two phase serial 12-bit enabled, YUYV (16-bit mode) enabled, BT.656 enabled, JDI MIP enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LVDSINTEN</name>
              <description>When set to 1, LVDS interface is enabled</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DBLHORSCANEN</name>
              <description>When set to 1, double horizontal scan is enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSTMODEN</name>
              <description>When set to 1, test mode is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Setup proper timing with divisor control bits and specify the number of lines to be prefetched before the start of frame.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000401</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SECCLKDIV</name>
              <description>Value of secondary clock divider</description>
              <bitRange>[31:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SDIV_0</name>
                  <description>No division</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_1</name>
                  <description>No division</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_2</name>
                  <description>Divided by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_3</name>
                  <description>Divided by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_4</name>
                  <description>Divided by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_5</name>
                  <description>Divided by 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_6</name>
                  <description>Divided by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_7</name>
                  <description>Divided by 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_8</name>
                  <description>Divided by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_9</name>
                  <description>Divided by 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_10</name>
                  <description>Divided by 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_11</name>
                  <description>Divided by 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_12</name>
                  <description>Divided by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_13</name>
                  <description>Divided by 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_14</name>
                  <description>Divided by 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SDIV_15</name>
                  <description>Divided by 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LVDS</name>
              <description>Clock phase shift value for LVDS operation</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>

