AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>PLL</name>
              <description>Select PLL Clock</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1</name>
              <description>This field is reserved.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LINENUM</name>
              <description>Number of lines to be prefetched before starting the frame through DMA. Maximum value is 32</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0</name>
              <description>This field is reserved.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DIVIDEVALUE</name>
              <description>Value of first clock divider</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FDIV_0</name>
                  <description>Divided by 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_2</name>
                  <description>Divided by 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_3</name>
                  <description>Divided by 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_4</name>
                  <description>Divided by 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_5</name>
                  <description>Divided by 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_6</name>
                  <description>Divided by 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_7</name>
                  <description>Divided by 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_8</name>
                  <description>Divided by 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_9</name>
                  <description>Divided by 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_10</name>
                  <description>Divided by 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_11</name>
                  <description>Divided by 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_12</name>
                  <description>Divided by 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_13</name>
                  <description>Divided by 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_14</name>
                  <description>Divided by 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_15</name>
                  <description>Divided by 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_16</name>
                  <description>Divided by 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_17</name>
                  <description>Divided by 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_18</name>
                  <description>Divided by 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_19</name>
                  <description>Divided by 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_20</name>
                  <description>Divided by 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_21</name>
                  <description>Divided by 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_22</name>
                  <description>Divided by 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_23</name>
                  <description>Divided by 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_24</name>
                  <description>Divided by 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_25</name>
                  <description>Divided by 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_26</name>
                  <description>Divided by 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_27</name>
                  <description>Divided by 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_28</name>
                  <description>Divided by 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_29</name>
                  <description>Divided by 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_30</name>
                  <description>Divided by 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FDIV_31</name>
                  <description>Divided by 31</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BGCOLOR</name>
          <description>Specifies the main background color.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REDCOLOR</name>
              <description>Color red is used as background color</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

