AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>CSXSET</name>
              <description>Sets the value of DBIB_CSX signal:</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSX1</name>
                  <description>is set to one if DBI_CFG[29] has the value of one</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSX0</name>
                  <description>is set to zero if DBI_CFG[29] has the value of zero</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBIBTEDIS</name>
              <description>When set to 1, the DBIB_TE signal is disabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD4</name>
              <description>This field is reserved.</description>
              <bitRange>[27:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESXLOW</name>
              <description>When set to 1, drives RESX signal low to reset DBI Type-B interface</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD3</name>
              <description>This field is reserved.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPI3</name>
              <description>When set to 1, SPI 3-wire interface is enabled</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPI4</name>
              <description>When set to 1, SPI 4-wire interface is enabled</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD2</name>
              <description>This field is reserved.</description>
              <bitRange>[21:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BINDCMDS</name>
              <description>When set to 1, binds the store commands with the RGB data and two-byte address is sent with each horizontal line</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INVHRZLINE</name>
              <description>When set to 1, inverts the bit-order of the horizontal line address (used along with DBI_CFG[17] register bit)</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1</name>
              <description>This field is reserved.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BACKPRESSUREEN</name>
              <description>When set to 1, back pressure support is enabled (not currently supported)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0</name>
              <description>This field is reserved.</description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TYPEBWIDTH</name>
              <description>Set DBI Type-B interface width (8, 9 or 16 bits) and the serial interface:</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT_16</name>
                  <description>16-bit interface</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_9</name>
                  <description>9-bit interface</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_8</name>
                  <description>8-bit interface</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INT_SERIAL</name>
                  <description>Serial interface</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAWDORDER</name>
              <description>Set the data order of the 8-bit data word:</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WD_ORDER_OPT0</name>
                  <description>option 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WD_ORDER_OPT1</name>
                  <description>option 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WD_ORDER_OPT2</name>
                  <description>option 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WD_ORDER_OPT3</name>
                  <description>option 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DBICOLORFMT</name>
              <description>Set the color format for DBI interface</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DBI_FMT_RGB111</name>
                  <description>RGB111 (3  bits/pixel)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBI_FMT_RGB332</name>
                  <description>RGB332 (8  bits/pixel)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBI_FMT_RGB444</name>
                  <description>RGB444 (12 bits/pixel)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBI_FMT_RGB565</name>
                  <description>RGB565 (16 bits/pixel)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBI_FMT_RGB666</name>
                  <description>RGB666 (18 bits/pixel)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DBI_FMT_RGB888</name>
                  <description>RGB888 (24 bits/pixel)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCGPIO</name>
          <description>General Purpose register: read/write GPIO external pins. This is accumulated as- {CGBYPASS_in,13'd0,ADVANCE_ANYWAY_in,5'd0,GPIO_in}</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CGBYPASS</name>
              <description>No idea what this is</description>
              <bitRange>[31:22]</bitRange>
              <access>read-write</access>

