AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LAYER3MODE</name>
          <description>Activate and set-up layer 3.</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER3EN</name>
              <description>When set to 1, layer n is enabled</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3FORCE</name>
              <description>When set to 1, force alpha with global alpha is enabled</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3BFILTER</name>
              <description>When set to 1, bilinear filtering is enabled</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3PREMULT</name>
              <description>When set to 1, premultiply image alpha is enabled</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3HLOCK</name>
              <description>When set to 1, HLOCK signal on AHB DMAs is asserted</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3GAMMA</name>
              <description>When set to 1, Gamma Look Up Table is enabled</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1</name>
              <description>This field is reserved.</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3ALPHA</name>
              <description>Alpha layer global value (0x00-0xFF range)</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3DBLEND</name>
              <description>Destination blending function</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER3_DBLACK_BLEND</name>
                  <description>blend black</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DWHITE_BLEND</name>
                  <description>blend white</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DALBHAS_BLEND</name>
                  <description>blend alpha source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DALPHAG_BLEND</name>
                  <description>blend alpha global</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DALPHASG_BLEND</name>
                  <description>blend alpha source and alpha global</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DINVERT_BLEND_SRC</name>
                  <description>blend inverted source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DINVERT_GLOBAL_BLEND</name>
                  <description>blend inverted global</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DINVERTSG_BLEND</name>
                  <description>blend inverted source and inverted global</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DALPHA_BLEND</name>
                  <description>blend alpha destination</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_DINVERT_BLEND_DST</name>
                  <description>blend inverted destination</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAYER3SBLEND</name>
              <description>Source blending function</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER3SBLACKBLEND</name>
                  <description>layer 3 black blend register. blend black</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3SWHITEBLEND</name>
                  <description>blend white</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3SALBHASBLEND</name>
                  <description>blend alpha source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3SALPHAGBLEND</name>
                  <description>blend alpha global</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3SALPHASGBLEND</name>
                  <description>blend alpha source and alpha global</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_SINVERT_BLEND_SRC</name>
                  <description>blend inverted source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3SINVERTGLOBALBLEND</name>
                  <description>blend inverted global</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3SINVERTSGBLEND</name>
                  <description>blend inverted source and inverted global</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3SALPHABLEND</name>
                  <description>blend alpha destination</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_SINVERT_BLEND_DST</name>
                  <description>blend inverted destination</description>
                  <value>13</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD0</name>
              <description>This field is reserved.</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>

