AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>LAYER3STRIDE</name>
          <description>Specify the stride and the AXI bus burst of layer 3.</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001FFFFF</resetMask>

          <fields>
            <field>
              <name>RSVD</name>
              <description>This field is reserved.</description>
              <bitRange>[31:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3AXIFIFOTHLD</name>
              <description>Specify the AXI fifo threshold burst start in layer 3</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER3_BURST_HALF_SZ</name>
                  <description>half fifo (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BURST_2</name>
                  <description>2 burst-size</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BURST_4</name>
                  <description>4 burst-size</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BURST_8</name>
                  <description>8 burst-size</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAYER3AXIBURSTBITS</name>
              <description>Specify the AXI bits per burst in layer 3</description>
              <bitRange>[18:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAYER3_BEATS_DEF</name>
                  <description>16-beats (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BEATS_2</name>
                  <description>2-beats</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BEATS_4</name>
                  <description>4-beats</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BEATS_8</name>
                  <description>8-beats</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BEATS_16</name>
                  <description>16-beats (CHECK mistake?)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BEATS_32</name>
                  <description>32-beats (AXI4 only)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BEATS_64</name>
                  <description>64-beats (AXI4 only)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAYER3_BEATS_128</name>
                  <description>128-beats (AXI4 only)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAYER3STRIDEDIST</name>
              <description>Specify the stride, which is the distance from line to line in bytes for each layer 3 memory</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER3RESXY</name>
          <description>X and Y dimensions for the resolution of layer 3.</description>
          <addressOffset>0x000000A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER3PIXRESX</name>
              <description>Specify the layer n pixel resolution in the X dimension</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LAYER3PIXRESY</name>
              <description>Specify the layer n pixel resolution in the Y dimension</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER3SCALEX</name>
          <description>Scale X factor of layer 3.</description>
          <addressOffset>0x000000A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER3XFACTOR</name>
              <description>Specify the scale X factor of layer n (4.14 fixed point number)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LAYER3SCALEY</name>
          <description>Scale Y factor of layer 3.</description>
          <addressOffset>0x000000AC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LAYER3YFACTOR</name>
              <description>Specify the scale Y factor of layer n (4.14 fixed point number)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

