AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>CLMDRGBA5551</name>
              <description>Indicates that the RGBA5551 16-bit color format is enabled</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDRGBA8888</name>
              <description>Indicates that the RGBA8888 32-bit color format is enabled</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDRGB332</name>
              <description>Indicates that the RGB332 8-bit color format is enabled</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDRGB565</name>
              <description>Indicates that the RGB565 16-bit color format is enabled</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDARGB8888</name>
              <description>Indicates that the ARGB8888 32-bit color format is enabled</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDL8</name>
              <description>Indicates that the L8 color format is enabled</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDL1</name>
              <description>Indicates that the L1 color format is enabled</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDL4</name>
              <description>Indicates that the L4 color format is enabled</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDYUYV</name>
              <description>Indicates that the YUYV color format is enabled</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDRGB888</name>
              <description>Indicates that the RGB888 24-bit color format is enabled</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDYUY2</name>
              <description>Indicates that the YUY2 color format is enabled</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDABGR8888</name>
              <description>Indicates that the ABGR8888 32-bit color format is enabled</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDBGRA8888</name>
              <description>Indicates that the BGRA8888 32-bit color format is enabled</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDVYUV420</name>
              <description>Indicates that the V_YUV420 color format is enabled</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDTLYUV420</name>
              <description>Indicates that the TLYUV420 color format is enabled</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLMDTSC4TSC6</name>
              <description>Indicates that the TSc4/TSc6 propietary color format is enabled</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CRC</name>
          <description>if cyclic redundancy errors occur, they are written in the CRC register.</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CRCREG</name>
              <description>CRC value if CRC error exists</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GLLUT</name>
          <description>R[0]G[0]B[0] thru R[255]G[255]B[255] Global palette, gamma correction memory region where x starts at 0 thru 255.Access to all 256 registers is best accomplished by passing an index via a macro. e.g. pseudocode  #define DC_L0LUT(n) (*((volatile uint32_t*)(&amp;L0LUT + (4*n))))</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>GLLUT0GAMRAMPR</name>
              <description>Gamma ramp red bits</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GLLUT0GAMRAMPG</name>
              <description>Gamma ramp green bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GLLUT0GAMRAMPB</name>
              <description>Gamma ramp blue bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

