AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CURSORDATA</name>
          <description>Color values for the pixel cursor that are used with the Cursor LUT where x starts at 0 thru 127.Access to all 16 registers is best accomplished by passing an index via a macro. e.g. pseudocode  #define DC_CURSORDATA(n) (*((volatile uint32_t*)(&amp;CURSORDATA + (4*n))))</description>
          <addressOffset>0x00000800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFF0FF</resetMask>

          <fields>
            <field>
              <name>CURDATA3112</name>
              <description>Pixel 'xy' color look up bits</description>
              <bitRange>[31:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CURDATA70</name>
              <description>Pixel 'xy' color look up bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CURSORLUT</name>
          <description>R[0]G[0]B[0] thru R[15]G[15]B[15] Cursor Look-up Table where x starts at 0 thru 15.Access to all 16 registers is best accomplished by passing an index via a macro. e.g. pseudocode  #define DC_CURSORLUT(n) (*((volatile uint32_t*)(&amp;CURSORLUT + (4*n))))</description>
          <addressOffset>0x00000A00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>CURLUT0R</name>
              <description>Cursor LUT red bits</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CURLUT0G</name>
              <description>Cursor LUT green bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CURLUT0B</name>
              <description>Cursor LUT blue bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>L0LUT</name>
          <description>A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255]. Layer 0 palette,gamma correction memory region where x starts at 0 thru 255.</description>
          <addressOffset>0x00001000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>L0LUT0GAMRAMPA</name>
              <description>Gamma ramp alpha bits</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L0LUT0GAMRAMPR</name>
              <description>Gamma ramp red bits</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L0LUT0GAMRAMPG</name>
              <description>Gamma ramp green bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L0LUT0GAMRAMPB</name>
              <description>Gamma ramp blue bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>L1LUT</name>
          <description>A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255] Layer 1 palette,gamma correction memory region where x starts at 0 thru 255.Access to all 256 registers is best accomplished by passing an index via a macro. e.g. pseudocode  #define DC_L1LUT(n) (*((volatile uint32_t*)(&amp;L1LUT + (4*n))))</description>
          <addressOffset>0x00001400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>L1LUT0GAMRAMPA</name>
              <description>Gamma ramp alpha bits</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L1LUT0GAMRAMPR</name>
              <description>Gamma ramp red bits</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L1LUT0GAMRAMPG</name>
              <description>Gamma ramp green bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L1LUT0GAMRAMPB</name>
              <description>Gamma ramp blue bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>L2LUT0</name>
          <description>A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255] Layer 2 palette,gamma correction memory region where x starts at 0 thru 255.Access to all 256 registers is best accomplished by passing an index via a macro. e.g. pseudocode  #define DC_L2LUT(n) (*((volatile uint32_t*)(&amp;L2LUT + (4*n))))</description>
          <addressOffset>0x00001800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>L2LUT0GAMRAMPA</name>
              <description>Gamma ramp alpha bits</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

