AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>L2LUT0GAMRAMPR</name>
              <description>Gamma ramp red bits</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L2LUT0GAMRAMPG</name>
              <description>Gamma ramp green bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L2LUT0GAMRAMPB</name>
              <description>Gamma ramp blue bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>L3LUT</name>
          <description>A[0]R[0]G[0]B[0] thru A[255]R[255]G[255]B[255] Layer 3 palette,gamma correction memory region where x starts at 0 thru 255.Access to all 256 registers is best accomplished by passing an index via a macro. e.g. pseudocode  #define DC_L3LUT(n) (*((volatile uint32_t*)(&amp;L3LUT + (4*n))))</description>
          <addressOffset>0x00001C00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>L3LUT0GAMRAMPA</name>
              <description>Gamma ramp alpha bits</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L3LUT0GAMRAMPR</name>
              <description>Gamma ramp red bits</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L3LUT0GAMRAMPG</name>
              <description>Gamma ramp green bits</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>L3LUT0GAMRAMPB</name>
              <description>Gamma ramp blue bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>DSI</name>
      <version>1.0</version>
      <description>Digital Serial Interface Unit</description>
      <!-- <groupName>GROUP_DSI</groupName> -->
      <baseAddress>0x400A8000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x000000A4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DSI</name>
        <description>DSI_IRQ</description>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>DEVICEREADY</name>
          <description>Devide Ready register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>DISPLAYBUSPOSSESSEN</name>
              <description>Inform DSI receiver has to be given the bus possession for receiving the tearing effect trigger message; Reset by the processor to stop the bus possession of the DSI receiver; Note: Tearing effect is supported only in Type1; Display Architecture (command mode only) as suggested by Display Command Set Specification; Note1: Even if the processor does not clear the display_bus_possession bit after receiving the interrupt for tearing effect, DSI-tx controller starts the activities on the DSI link once the TE trigger message is received</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ULPS</name>
              <description>ULPS field of the DEVICEREADY register.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW_POWER</name>
                  <description>This pattern is set by the processor to inform that entire DSI host is to be put on ultra low power [POWER SAVING] mode 01 - This pattern is set by the processor to inform</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXIT</name>
                  <description>This pattern is set by the processor to inform that entire DSI host is to be pu on ultr low power EXIT mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>This</name>
                  <description>pattern is set by the processor to make the DSI host come out of the wakeup time and resume the normal operation if the DSI Host already remains in the ULPS exit state. S/W needs to ensure that there is a minimum of 1ms time available before clearing the UPLS exit State. 1(a). In DPI Only Mode: No DPI traffic should be sent after the above patterns like 10 or 01 is set in this register. Device_ready bit in Device Ready register should not be disturbed or should remain set while the device is subjected to ULPS states. 1(b). In Dual Display Mode: DPI Interface has to be disabled and also no DBI traffic should be sent after the above patterns like 10 or 01 is set in this register. Device_ready bit in Device Ready register should not be disturbed or should remain set while the device is subjected to ULPS states.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>READY</name>
              <description>Ready for programming after all count registers and timeout.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGRAMMED</name>
                  <description>Set to 1 after dphy_parameter register, all the count registers, and timeout and interrupt enable registers are being programmed.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>Set by the processor to inform that device is ready for transmission. This register should be set to 1 after dphy_parameter register, all the count registers, and timeout and interrupt enable registers are being programmed. Note: Reprogramming the registers by resetting the device_ready bit results in re-enumeration of the DSI controller from the power up sequence.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTRSTAT</name>
          <description>The interrupt status register.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DPIPRGERR</name>
              <description>(RW1C) Set to 1 indicates that the error in DPI parameters programming</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

