AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DPILINETO</name>
              <description>(RW1C) DPI line time out. Set to 1 indicates that the line time out during the DPI transfer</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCNT</name>
              <description>(RW1C) Rx Contention; Set to 1 if contention detected in the display</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INITDONE</name>
              <description>(RW1C) Set 1 indicates that the DSI initialization is done. DSI        Tx is ready to accept the DPI or DBI or Generic transfer</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SPECIALPACK</name>
              <description>(RW1C) Special packet command sent; Set to confirm the transmission of the DPI event specific commands set in the dpi control and dpi data</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXDSIPROT</name>
              <description>(RW1C) Rx DSI protocol violation; Set if acknowledge short packet shows DSI protocol violation error</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXINVALID</name>
              <description>(RW1C) Rx Invalid; Set if acknowledge short packet shows an invalid transmission count</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACKWNOERR</name>
              <description>(RW1C) T  ACK_with No_error; Set if acknowledge trigger message is received with out any error.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TURNARNDACK</name>
              <description>(RW1C) Turn around acknowledge. Set if a turn around acknowledgement sequence is timeout not received from the display device</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LPRXTIMEOUT</name>
              <description>(RW1C) Set if a low power reception count expires this interrupt is generated</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSTXTIMEOUT</name>
              <description>(RW1C) Set if a high speed transmission prevails for more than the expected count value this interrupt is raised</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOEMPTY</name>
              <description>(RW1C) Set to 1 if all FIFOs are empty</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOWC</name>
              <description>(RW1C) Low contention; Set to 1 if a LP low fault is registered by at the D-PHY contention detector. If this interrupt is set device should be re-enumerated</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HIGHC</name>
              <description>(RW1C) High contention;Set to 1 if a LP high fault is registered by at the D-PHY contention detector. If this interrupt is set device should be re-enumerated</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TxDSII</name>
              <description>(RW1C) TxDSI VC ID invalid; Set to 1 if the received virtual channel ID is invalid</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TxDSIN</name>
              <description>(RW1C) TxDSI data type not recognised; Set to 1 if the received data type is not recognised</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCHECKSUM</name>
              <description>(RW1C) Txchecksum error; Set to 1 if the computed CRC differs from the received CRC value during the reception of packets by Arasan_DSI host</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXECCM</name>
              <description>(RW1C) Set to 1 if there is no ECC correction for the packet or there are more than 2 bit errors in the packet received by Arasan_DSI_host.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXECCS</name>
              <description>(RW1C) Set to 1 if ECC syndrome was computed and is corrected for one bit error during the reception of packets by the Arasan_DSI_host.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXFALSECNTRL</name>
              <description>(RW1C) TxFalse Control Error; Set to 1 if a control error is observed on the lanes by the Arasan_DSI_host</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RxDSIDI</name>
              <description>(RW1C) RxDSI VC ID invalid; Set to 1 if the virtual channel ID is invalid by the display device is reported in the Acknowledge packet by the display device</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

