AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>RXINV</name>
              <description>Rx Invalid transmission count error; Set to enable acknowledge invalid transmission counterror</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACKWITHNOERR</name>
              <description>ACK with No_error; Set to enable acknowledge trigger message reception with out any error</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TURNARNDACK</name>
              <description>Set to enable turn around acknowledgement sequence timeout</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LPRXTIMEOUT</name>
              <description>Set to enable low power reception count timeouts</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSTXTIMEOUT</name>
              <description>Set to enable a high speed transmission timeout</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFOEMPTY</name>
              <description>Set to enable a FIFO empty interrupt</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOWC</name>
              <description>Low contention; Set to enable a LP low fault interrupt</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HIGHC</name>
              <description>High contention; Set to enable a LP high fault interrupt</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TxDSIV</name>
              <description>TxDSI VC ID invalid; Set to enable the interrupt if the received packets virtual channel ID is invalid</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TxDSID</name>
              <description>TxDSI data type not recognised; Set to enable the interrupt if the received packets data type is not recognised</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCHCKSUM</name>
              <description>Txchecksum error; Set to enable the interrupt if the computed CRC differs from the received CRC value for the received packets</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TxECCM</name>
              <description>TxECC multibit; Set to enable the interrupt if there is no ECC correction for the packet or there are more than 2 bit errors in the packet received by Arasan DSI host</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TxECCS</name>
              <description>TxECC single bit; Set to enable the interrupt if ECC syndrome was computed and is corrected for one bit error during the reception of packets by the Arasan DSI Host</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TxFalseCntrl</name>
              <description>TxFalse Control; Set to enable the interrupt for the control error observed on the lanes by the Arasan_DSI_host</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RxDSIV</name>
              <description>RxDSI VC ID invalid virtual channel; Set to enable the interrupt for invalid ID in the acknowledgment packet reports</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RxDSIData</name>
              <description>RxDSI data type not recognised; Set to enable the interrupt for the un recognised data type in the acknowledgment packet reports</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXCHECKSUM</name>
              <description>Rxchecksum error; Set to enable the interrupt for the computed CRC differs from the received CRC value in the acknowledgment packet reports</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXECCM</name>
              <description>RxECC multibit error; Set to enable the interrupt for no ECC correction for the packet or there are more than 2 bit errors reported in the acknowledgment packet</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXECCS</name>
              <description>RxECC single bit error; Set to enable the interrupt for ECC syndrome computation and one bit error correction for the acknowledgment packet</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFALSE</name>
              <description>RxFalse Control error; set to enable the interrupt for control error in the acknowledgment packet reports.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

