AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>HSTRAIL</name>
              <description>This field provides the timing requirement in byte clocks for the high speed trail time; this corresponds to the THS-TRAIL parameter specified in the DPHY specification</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSZERO</name>
              <description>This field provides the timing requirement in byte clocks for the high speed drive zero time. This corresponds to the THS-ZERO parameter specified in the DPHY specification</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSPREP</name>
              <description>This field provides the timing requirement in byte clocks for the high speed preparation time. This corresponds to the THS-PREP parameter specified in the DPHY specificaton</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKLANETIMPARM</name>
          <description>This field provides the timing requirement in byte clocks</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0B061A04</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HSEXIT</name>
              <description>This field provides the timing requirement in byte clocks for the high speed exit time; This corresponds to the THS-EXIT parameter specified in the DPHY specification.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSTRAIL</name>
              <description>This field provides the timing requirement in byte clocks for the high speed trail time; This corresponds to the TCLK-TRAIL parameter specified in the DPHY  specification</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSZERO</name>
              <description>This field provides the timing requirement in byte clocks for the high speed drive zero time; this  corresponds to the TCLK-ZERO parameter specified in the DPHY  specification</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HSPREP</name>
              <description>This field provides the timing requirement in byte corresponds to the TCLK-PREP parameter specified in the DPHY specificatio</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RSTENBDFE</name>
          <description>This field provides the reset (enable) to the DFE</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>ENABLE</name>
              <description>This field provides the reset (enable) to the DFE.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AFETRIM0</name>
          <description>Afe Trim reg0</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1A000615</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AFETRIM0</name>
              <description>Afe Trim reg0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AFETRIM1</name>
          <description>Afe Trim reg1</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x15640152</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AFETRIM1</name>
              <description>Afe Trim reg1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AFETRIM2</name>
          <description>Afe Trim reg2</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AFETRIM2</name>
              <description>Afe Trim reg2.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AFETRIM3</name>
          <description>Afe Trim reg3</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000040F8</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>AFETRIM3</name>
              <description>Afe Trim reg3.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ERRORAUTORCOV</name>
          <description>Errir ayti recivert register</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>LPRXTIMEOUTCLR</name>
              <description>If this bit is set to 1, lp_rx_timeout_clr error recovery action is taken immediately by DSI TX</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

