AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>HSRXTIMEOUTCLR</name>
              <description>If this bit is set to 1, Hs_rx_timeout_clr error recovery action is taken immediately by DSI TX</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LOCONTCLR</name>
              <description>If this bit is set to 1, lo_cont_clr error recovery action is taken immediately by DSI TX</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HICONTCLR</name>
              <description>If this bit is set to 1, Hi_cont_clr error recover action is taken immediately by DSI TX</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>INVLDDTCLR</name>
              <description>If this bit is set to 1, Invld_dt_clr error recovery action is taken immediately by DSI TX</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ECCMULERRCLR</name>
              <description>if this bit is set to 1, Ecc_mul_err_clr error recovery action is taken immediately by DSI TX</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MIPIDIRDPIDIFF</name>
          <description>Mipi direction DPI difference</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF8001</resetMask>

          <fields>
            <field>
              <name>DPIDIFF</name>
              <description>This field provides the difference in one line time between DPI and DSI</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPIHIGH</name>
              <description>This field provides information to check DPI line time is greater or DSI line time is greater</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LESSTHAN</name>
                  <description>one line time in DPI is less than to DSI line time</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GREATER</name>
                  <description>one line time in DPI is greater than or equal to DSI line time</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MIPIDIR</name>
              <description>This field provides the direction of MIPI bus;</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONTROL</name>
                  <description>DSI Host has the control over MIPI bus</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RECEIVE</name>
                  <description>DSI Host is in Receive mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DATALANEPOLSWAP</name>
          <description>Data lane polarity swap register</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>DATALNPOLSWAP</name>
              <description>Data lane Polarity sw</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LANE0</name>
                  <description>lane 0 polarity swap</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LANE1</name>
                  <description>lane 1 polarity swap</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LANE2</name>
                  <description>lane 2 polarity swap</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LANE3</name>
                  <description>lane 3 polarity swap</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALLLANES</name>
                  <description>data lanes polarity swap</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>DSP</name>
      <version>1.0</version>
      <description>DSP Control Interface</description>
      <!-- <groupName>GROUP_DSP</groupName> -->
      <baseAddress>0x40100000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x0000026C</size>
        <usage>registers</usage>
      </addressBlock>

