AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
      <registers>
        <register>
          <name>MUTEX0</name>
          <description>MUTEX 0</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX0</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTEX1</name>
          <description>MUTEX 1</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX1</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTEX2</name>
          <description>MUTEX 2</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX2</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTEX3</name>
          <description>MUTEX 3</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX3</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTEX4</name>
          <description>MUTEX 4</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX4</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTEX5</name>
          <description>MUTEX 5</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX5</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTEX6</name>
          <description>MUTEX 6</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX6</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MUTEX7</name>
          <description>MUTEX 7</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>MUTEX7</name>
              <description>Mutex Value (000=resource free, 001=CPU owns mutex, 010=DSP0 owns mutex, 100=DSP1 owns mutex)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Mutex is free</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU</name>
                  <description>CPU Owns Mutex</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP0</name>
                  <description>DSP0 Owns Mutex</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP1</name>
                  <description>DSP1 Owns Mutex</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR</name>
                  <description>Clear Mutex (conditional)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>Set Mutex (conditional)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUMBINTSET</name>
          <description>CPU Mailbox Interrupt Set</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CPUMBINTSET</name>
              <description>CPU Mailbox interrupt Set. The corresponding data bit will set the interrupt.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

