AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP0DRESET</name>
              <description>DSP0 DReset. This is the reset used for debug functionality like OCD/TRAX etc.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0BRESET</name>
              <description>DSP0 BReset. This is the reset used for Xtensa core. S/w must clear this reset to use Dsp.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0STATVECSEL</name>
              <description>DSP 0 StatVectorSel</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0RESETVEC</name>
          <description>DSP 0 Reset Vector</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0RESETVEC</name>
              <description>DSP 0 Reset Vector Address.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0IRQMASK</name>
          <description>DSP 0 IRQ Mask</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0IRQMASK</name>
              <description>DSP 0 IRQ Mask</description>
              <bitRange>[22:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0WAKEMASK</name>
          <description>DSP 0 IRQ Wake Mask</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0WAKEMASK</name>
              <description>DSP 0 IRQ Wake Mask</description>
              <bitRange>[22:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0RAWIRQSTAT31to0</name>
          <description>DSP 0 Raw IRQ31-0 Status</description>
          <addressOffset>0x00000110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0RAWIRQSTAT31to0</name>
              <description>DSP 0 Raw IRQ31-0 Status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0RAWIRQSTAT63to32</name>
          <description>DSP 0 Raw IRQ63-32 Status</description>
          <addressOffset>0x00000114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0RAWIRQSTAT63to32</name>
              <description>DSP 0 Raw IRQ63-32 Status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0RAWIRQSTAT95to64</name>
          <description>DSP 0 Raw IRQ95-64 Status</description>
          <addressOffset>0x00000118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0RAWIRQSTAT95to64</name>
              <description>DSP 0 Raw IRQ95-64 Status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0L2LVLINT</name>
          <description>DSP 0 L2 Level Interrupt Mux</description>
          <addressOffset>0x00000120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP0L2LVLINT</name>
              <description>DSP 0 L2 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0L3LVLINT</name>
          <description>DSP 0 L3 Level Interrupt Mux</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP0L3LVLINT</name>
              <description>DSP 0 L3 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0L4LVLINT</name>
          <description>DSP 0 L4 Level Interrupt Mux</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP0L4LVLINT</name>
              <description>DSP 0 L4 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

