AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP0TMRORMASKB</name>
              <description>DSP0 Timer Interrupt OR Mask B</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTORMASK95TO64B</name>
          <description>DSP0 Interrupt OR Mask B for IRQ95-64</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0MBINTORMASKB</name>
              <description>DSP0 Mailbox Interrupt OR Mask B</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTENIRQ31TO0</name>
          <description>DSP0 INT Enable for IRQ31-0</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0INTENIRQ31TO0</name>
              <description>DSP0 INT Enable for IRQ31-0</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTENIRQ63TO32</name>
          <description>DSP0 INT Enable for IRQ63-32</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0INTENIRQ63TO32</name>
              <description>DSP0 INT Enable for IRQ63-32</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0INTENIRQ95TO64</name>
          <description>DSP0 INT Enable for IRQ95-64</description>
          <addressOffset>0x00000168</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0INTENIRQ95TO64</name>
              <description>DSP0 INT Enable for IRQ95-64</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1CONTROL</name>
          <description>DSP 1 control settings</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <resetMask>0x7FFFFF3F</resetMask>

          <fields>
            <field>
              <name>DSP1IDMAXTRIGSRC</name>
              <description>DSP 1 IDMA Cross Trigger Source. All enabled sources are ANDed to generate a trigger enable. \n Bit30-12:IRQ18-0 Bit11: IDMATRIGPULSE, Bit10: DSP Timer1, Bit9: DSP Timer0, Bit8: alternate DSP iDMA trigger out</description>
              <bitRange>[30:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1IDMATRIG</name>
              <description>DSP 1 IDMA Trigger Control</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTRIG</name>
                  <description>Trigger is disabled until a cross trigger pulse is asserted. This will allow another source (determined by the XTRIGSRC register) to allow the DMA descriptor chain to proceed.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSTEP</name>
                  <description>Trigger is disabled until a trigger pulse (PULSE in IDMATRIG register) is asserted. This will allow a single step in the DMA descriptor chain to be enabled until next completion.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON</name>
                  <description>Trigger is always enabled. With this set, any trigger out will immediately generate a trigger in</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Trigger is disabled. This will pause the iDMA indefinitely until enabled.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP1RUNSTALL</name>
              <description>DSP 1 RunStall. When asserted, DSP 1 will stall until bit is cleared.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1DRESET</name>
              <description>DSP1 DReset. This is the reset used for debug functionality like OCD/TRAX etc.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1BRESET</name>
              <description>DSP1 BReset. This is the reset used for Xtensa core. S/w must clear this reset to use Dsp.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

