AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP1STATVECSEL</name>
              <description>DSP 1 StatVectorSel</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1RESETVEC</name>
          <description>DSP 1 Reset Vector</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1RESETVEC</name>
              <description>DSP 1 Reset Vector Address.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1IRQMASK</name>
          <description>DSP 1 IRQ Mask</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1IRQMASK</name>
              <description>DSP 1 IRQ Mask</description>
              <bitRange>[22:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1WAKEMASK</name>
          <description>DSP 1 IRQ Wake Mask</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1WAKEMASK</name>
              <description>DSP 1 IRQ Wake Mask</description>
              <bitRange>[22:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1RAWIRQSTAT31to0</name>
          <description>DSP 1 Raw IRQ31-0 Status</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1RAWIRQSTAT31to0</name>
              <description>DSP 1 Raw IRQ31-0 Status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1RAWIRQSTAT63to32</name>
          <description>DSP 1 Raw IRQ63-32 Status</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1RAWIRQSTAT63to32</name>
              <description>DSP 1 Raw IRQ63-32 Status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1RAWIRQSTAT95to64</name>
          <description>DSP 1 Raw IRQ95-64 Status</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1RAWIRQSTAT95to64</name>
              <description>DSP 1 Raw IRQ95-64 Status</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1L2LVLINT</name>
          <description>DSP 1 L2 Level Interrupt Mux</description>
          <addressOffset>0x00000220</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP1L2LVLINT</name>
              <description>DSP 1 L2 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1L3LVLINT</name>
          <description>DSP 1 L3 Level Interrupt Mux</description>
          <addressOffset>0x00000224</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP1L3LVLINT</name>
              <description>DSP 1 L3 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1L4LVLINT</name>
          <description>DSP 1 L4 Level Interrupt Mux</description>
          <addressOffset>0x00000228</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP1L4LVLINT</name>
              <description>DSP 1 L4 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1L5LVLINT</name>
          <description>DSP 1 L5 Level Interrupt Mux</description>
          <addressOffset>0x0000022C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007FFFF</resetMask>

          <fields>
            <field>
              <name>DSP1L5LVLINT</name>
              <description>DSP 1 L5 Level Interrupt Mux</description>
              <bitRange>[18:0]</bitRange>
              <access>read-write</access>

