AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1IDMATRIGCTL</name>
          <description>DSP 1 IDMA Trigger Control and Status</description>
          <addressOffset>0x00000230</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000011</resetMask>

          <fields>
            <field>
              <name>DSP1IDMATRIGPULSE</name>
              <description>DSP 1 iDMA Trigger Pulse - When written a '1', this will cause a single step enable (valid only when IDMATRIG is set to SSTEP)</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1IDMATRIGSTAT</name>
              <description>DSP 1 iDMA Trigger Status</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1INTORMASK31TO0A</name>
          <description>DSP1 Interrupt OR Mask A for IRQ31-0</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1INTMCUIOORMASKA</name>
              <description>DSP1 MCU IO Interrupt OR Mask A</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1INTORMASK63TO32A</name>
          <description>DSP1 Interrupt OR Mask A for IRQ63-32</description>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F0FF3FF</resetMask>

          <fields>
            <field>
              <name>DSP1GPIOORMASKA</name>
              <description>DSP1 GPIO Interrupt OR Mask A</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1PDMORMASKA</name>
              <description>DSP1 PDM Interrupt OR Mask A</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1I2SORMASKA</name>
              <description>DSP1 I2S Interrupt OR Mask A</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1TMRORMASKA</name>
              <description>DSP1 Timer Interrupt OR Mask A</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1INTORMASK95TO64A</name>
          <description>DSP1 Interrupt OR Mask A for IRQ95-64</description>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1MBINTORMASKA</name>
              <description>DSP1 Mailbox Interrupt OR Mask A</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1INTORMASK31to0B</name>
          <description>DSP1 Interrupt OR Mask B for IRQ31-0</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1INTMCUIOORMASKB</name>
              <description>DSP1 MCU IO Interrupt OR Mask B</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1INTORMASK63TO32B</name>
          <description>DSP1 Interrupt OR Mask A for IRQ63-32</description>
          <addressOffset>0x00000254</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F0FF3FF</resetMask>

          <fields>
            <field>
              <name>DSP1GPIOORMASKB</name>
              <description>DSP1 GPIO Interrupt OR Mask B</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1PDMORMASKB</name>
              <description>DSP1 PDM Interrupt OR Mask B</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1I2SORMASKB</name>
              <description>DSP1 I2S Interrupt OR Mask B</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1TMRORMASKB</name>
              <description>DSP1 Timer Interrupt OR Mask B</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1INTORMASK95TO64B</name>
          <description>DSP1 Interrupt OR Mask B for IRQ95-64</description>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1MBINTORMASKB</name>
              <description>DSP1 Mailbox Interrupt OR Mask B</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

