AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ENS2</name>
          <description>GPIO Enable Set 2 (95-64)</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENS2</name>
              <description>GPIO95-64 Sets pin tri-state output enables. Writing a 1 to any bit sets the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENS3</name>
          <description>GPIO Enable Set 3 (127-96)</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENS3</name>
              <description>GPIO127-96 Sets pin tri-state output enables. Writing a 1 to any bit sets the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENC0</name>
          <description>GPIO Enable Clear 0 (31-0)</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENC0</name>
              <description>GPIO31-0 Clears pin tri-state output enables. Writing a 1 to any bit clears the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENC1</name>
          <description>GPIO Enable Clear 1 (63-32)</description>
          <addressOffset>0x00000064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENC1</name>
              <description>GPIO63-32 Clears pin tri-state output enables. Writing a 1 to any bit clears the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENC2</name>
          <description>GPIO Enable Clear 2 (95-64)</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENC2</name>
              <description>GPIO95-64 Clears pin tri-state output enables. Writing a 1 to any bit clears the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENC3</name>
          <description>GPIO Enable Clear 3 (127-96)</description>
          <addressOffset>0x0000006C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENC3</name>
              <description>GPIO127-96 Clears pin tri-state output enables. Writing a 1 to any bit clears the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>GPIO</name>
      <version>1.0</version>
      <description>General Purpose IO</description>
      <!-- <groupName>GROUP_GPIO</groupName> -->
      <baseAddress>0x40010000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000440</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO0_001F</name>
        <description>GPIO0_001F_IRQ</description>
        <value>56</value>
      </interrupt>      <interrupt>
        <name>GPIO0_203F</name>
        <description>GPIO0_203F_IRQ</description>
        <value>57</value>
      </interrupt>      <interrupt>
        <name>GPIO0_405F</name>
        <description>GPIO0_405F_IRQ</description>
        <value>58</value>
      </interrupt>      <interrupt>
        <name>GPIO0_607F</name>
        <description>GPIO0_607F_IRQ</description>
        <value>59</value>
      </interrupt>      <interrupt>
        <name>GPIO1_001F</name>
        <description>GPIO1_001F_IRQ</description>
        <value>60</value>
      </interrupt>      <interrupt>
        <name>GPIO1_203F</name>
        <description>GPIO1_203F_IRQ</description>
        <value>61</value>
      </interrupt>      <interrupt>
        <name>GPIO1_405F</name>
        <description>GPIO1_405F_IRQ</description>
        <value>62</value>
      </interrupt>      <interrupt>
        <name>GPIO1_607F</name>
        <description>GPIO1_607F_IRQ</description>
        <value>63</value>
      </interrupt>
      <registers>
        <register>
          <name>PINCFG0</name>
          <description>Controls the operation of GPIO pin 0.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0C7FFFFF</resetMask>

          <fields>
            <field>
              <name>FOEN0</name>
              <description>Force output enable active regardless of function selected. Otherwise the selected function will enable the output only when needed</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

