AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ENC1</name>
          <description>GPIO Enable Clear 1 (63-32)</description>
          <addressOffset>0x00000268</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENC1</name>
              <description>GPIO63-32 Clears pin tri-state output enables. Writing a 1 to any bit clears the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENC2</name>
          <description>GPIO Enable Clear 2 (95-64)</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENC2</name>
              <description>GPIO95-64 Clears pin tri-state output enables. Writing a 1 to any bit clears the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ENC3</name>
          <description>GPIO Enable Clear 3 (127-96)</description>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ENC3</name>
              <description>GPIO127-96 Clears pin tri-state output enables. Writing a 1 to any bit clears the corresponding bit in the EN register. Writing a value of 0 has no effect on the corresponding bit in the EN register. Status reads should be made to the EN Register.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM0IRQ</name>
          <description>IOM0 IRQ select for flow control.</description>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM0IRQ</name>
              <description>IOM0 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM1IRQ</name>
          <description>IOM1 IRQ select for flow control.</description>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM1IRQ</name>
              <description>IOM1 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM2IRQ</name>
          <description>IOM2 IRQ select for flow control.</description>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM2IRQ</name>
              <description>IOM2 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM3IRQ</name>
          <description>IOM3 IRQ select for flow control.</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM3IRQ</name>
              <description>IOM3 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM4IRQ</name>
          <description>IOM4 IRQ select for flow control.</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM4IRQ</name>
              <description>IOM4 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IOM5IRQ</name>
          <description>IOM5 IRQ select for flow control.</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000007F</resetMask>

          <fields>
            <field>
              <name>IOM5IRQ</name>
              <description>IOM5 IRQ pad select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

