AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>MCUN1GPIO22</name>
              <description>GPIO22 MCU N1-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO21</name>
              <description>GPIO21 MCU N1-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO20</name>
              <description>GPIO20 MCU N1-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO19</name>
              <description>GPIO19 MCU N1-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO18</name>
              <description>GPIO18 MCU N1-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO17</name>
              <description>GPIO17 MCU N1-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO16</name>
              <description>GPIO16 MCU N1-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO15</name>
              <description>GPIO15 MCU N1-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO14</name>
              <description>GPIO14 MCU N1-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO13</name>
              <description>GPIO13 MCU N1-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO12</name>
              <description>GPIO12 MCU N1-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO11</name>
              <description>GPIO11 MCU N1-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO10</name>
              <description>GPIO10 MCU N1-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO9</name>
              <description>GPIO9 MCU N1-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO8</name>
              <description>GPIO8 MCU N1-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO7</name>
              <description>GPIO7 MCU N1-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO6</name>
              <description>GPIO6 MCU N1-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO5</name>
              <description>GPIO5 MCU N1-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO4</name>
              <description>GPIO4 MCU N1-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO3</name>
              <description>GPIO3 MCU N1-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO2</name>
              <description>GPIO2 MCU N1-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO1</name>
              <description>GPIO1 MCU N1-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCUN1GPIO0</name>
              <description>GPIO0 MCU N1-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MCUN1INT0STAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000304</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>MCUN1GPIO31</name>
              <description>GPIO31 MCU N1-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

