AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP0N0GPIO110</name>
              <description>GPIO110 DSP0 N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO109</name>
              <description>GPIO109 DSP0 N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO108</name>
              <description>GPIO108 DSP0 N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO107</name>
              <description>GPIO107 DSP0 N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO106</name>
              <description>GPIO106 DSP0 N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO105</name>
              <description>GPIO105 DSP0 N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO104</name>
              <description>GPIO104 DSP0 N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO103</name>
              <description>GPIO103 DSP0 N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO102</name>
              <description>GPIO102 DSP0 N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO101</name>
              <description>GPIO101 DSP0 N0-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO100</name>
              <description>GPIO100 DSP0 N0-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO99</name>
              <description>GPIO99 DSP0 N0-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO98</name>
              <description>GPIO98 DSP0 N0-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO97</name>
              <description>GPIO97 DSP0 N0-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO96</name>
              <description>GPIO96 DSP0 N0-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0N0INT3CLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000378</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0N0GPIO127</name>
              <description>GPIO127 DSP0 N0-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO126</name>
              <description>GPIO126 DSP0 N0-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO125</name>
              <description>GPIO125 DSP0 N0-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO124</name>
              <description>GPIO124 DSP0 N0-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO123</name>
              <description>GPIO123 DSP0 N0-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO122</name>
              <description>GPIO122 DSP0 N0-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO121</name>
              <description>GPIO121 DSP0 N0-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO120</name>
              <description>GPIO120 DSP0 N0-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

