AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP0N0GPIO126</name>
              <description>GPIO126 DSP0 N0-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO125</name>
              <description>GPIO125 DSP0 N0-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO124</name>
              <description>GPIO124 DSP0 N0-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO123</name>
              <description>GPIO123 DSP0 N0-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO122</name>
              <description>GPIO122 DSP0 N0-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO121</name>
              <description>GPIO121 DSP0 N0-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO120</name>
              <description>GPIO120 DSP0 N0-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO119</name>
              <description>GPIO119 DSP0 N0-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO118</name>
              <description>GPIO118 DSP0 N0-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO117</name>
              <description>GPIO117 DSP0 N0-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO116</name>
              <description>GPIO116 DSP0 N0-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO115</name>
              <description>GPIO115 DSP0 N0-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO114</name>
              <description>GPIO114 DSP0 N0-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO113</name>
              <description>GPIO113 DSP0 N0-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO112</name>
              <description>GPIO112 DSP0 N0-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO111</name>
              <description>GPIO111 DSP0 N0-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO110</name>
              <description>GPIO110 DSP0 N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO109</name>
              <description>GPIO109 DSP0 N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO108</name>
              <description>GPIO108 DSP0 N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO107</name>
              <description>GPIO107 DSP0 N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO106</name>
              <description>GPIO106 DSP0 N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO105</name>
              <description>GPIO105 DSP0 N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO104</name>
              <description>GPIO104 DSP0 N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO103</name>
              <description>GPIO103 DSP0 N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N0GPIO102</name>
              <description>GPIO102 DSP0 N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

