AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP0N1GPIO5</name>
              <description>GPIO5 DSP0 N1-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO4</name>
              <description>GPIO4 DSP0 N1-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO3</name>
              <description>GPIO3 DSP0 N1-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO2</name>
              <description>GPIO2 DSP0 N1-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO1</name>
              <description>GPIO1 DSP0 N1-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO0</name>
              <description>GPIO0 DSP0 N1-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0N1INT0SET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000038C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP0N1GPIO31</name>
              <description>GPIO31 DSP0 N1-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO30</name>
              <description>GPIO30 DSP0 N1-priority interrupt.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO29</name>
              <description>GPIO29 DSP0 N1-priority interrupt.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO28</name>
              <description>GPIO28 DSP0 N1-priority interrupt.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO27</name>
              <description>GPIO27 DSP0 N1-priority interrupt.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO26</name>
              <description>GPIO26 DSP0 N1-priority interrupt.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO25</name>
              <description>GPIO25 DSP0 N1-priority interrupt.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO24</name>
              <description>GPIO24 DSP0 N1-priority interrupt.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO23</name>
              <description>GPIO23 DSP0 N1-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO22</name>
              <description>GPIO22 DSP0 N1-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO21</name>
              <description>GPIO21 DSP0 N1-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO20</name>
              <description>GPIO20 DSP0 N1-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO19</name>
              <description>GPIO19 DSP0 N1-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO18</name>
              <description>GPIO18 DSP0 N1-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO17</name>
              <description>GPIO17 DSP0 N1-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO16</name>
              <description>GPIO16 DSP0 N1-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0N1GPIO15</name>
              <description>GPIO15 DSP0 N1-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

