AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP1N0GPIO87</name>
              <description>GPIO87 DSP1 N0-priority interrupt.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO86</name>
              <description>GPIO86 DSP1 N0-priority interrupt.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO85</name>
              <description>GPIO85 DSP1 N0-priority interrupt.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO84</name>
              <description>GPIO84 DSP1 N0-priority interrupt.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO83</name>
              <description>GPIO83 DSP1 N0-priority interrupt.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO82</name>
              <description>GPIO82 DSP1 N0-priority interrupt.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO81</name>
              <description>GPIO81 DSP1 N0-priority interrupt.</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO80</name>
              <description>GPIO80 DSP1 N0-priority interrupt.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO79</name>
              <description>GPIO79 DSP1 N0-priority interrupt.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO78</name>
              <description>GPIO78 DSP1 N0-priority interrupt.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO77</name>
              <description>GPIO77 DSP1 N0-priority interrupt.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO76</name>
              <description>GPIO76 DSP1 N0-priority interrupt.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO75</name>
              <description>GPIO75 DSP1 N0-priority interrupt.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO74</name>
              <description>GPIO74 DSP1 N0-priority interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO73</name>
              <description>GPIO73 DSP1 N0-priority interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO72</name>
              <description>GPIO72 DSP1 N0-priority interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO71</name>
              <description>GPIO71 DSP1 N0-priority interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO70</name>
              <description>GPIO70 DSP1 N0-priority interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO69</name>
              <description>GPIO69 DSP1 N0-priority interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO68</name>
              <description>GPIO68 DSP1 N0-priority interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO67</name>
              <description>GPIO67 DSP1 N0-priority interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO66</name>
              <description>GPIO66 DSP1 N0-priority interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO65</name>
              <description>GPIO65 DSP1 N0-priority interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1N0GPIO64</name>
              <description>GPIO64 DSP1 N0-priority interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1N0INT2CLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x000003E8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DSP1N0GPIO95</name>
              <description>GPIO95 DSP1 N0-priority interrupt.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

