AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>TEX3RES</name>
          <description>Image 3 resolution.</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RESY</name>
              <description>resolution Y size</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESX</name>
              <description>resolution X size</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CGCMD</name>
          <description>Clock gating enable</description>
          <addressOffset>0x00000090</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>START</name>
              <description>start clock</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STOP</name>
              <description>stop clock</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CGCTRL</name>
          <description>CGCTRL register description needed here.</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DISCLKMOD</name>
              <description>disable clock gating for all modules (MISTAKE ?)</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD1</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[29:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DISCLKCORE</name>
              <description>disable clock gating for core 0</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RSVD0</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[22:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DISCLKFRAME</name>
              <description>disable clock gating for framebuffer 0 (MISTAKE ?)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DISCLKCFG</name>
              <description>disable clock gating for configuration file</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DISCLKPROC</name>
              <description>disable clock gating for command list processor</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DIRTYTRIGMIN</name>
          <description>Resets dirty region to resolution size when written.</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DRTYREG</name>
              <description>Resets dirty region to resolution size when written.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DIRTYTRIGMAX</name>
          <description>Resets dirty region to resolution size when written.</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>DRTYREG</name>
              <description>Resets dirty region to resolution size when written.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>On read, returns GPU status (CHECK address!!).</description>
          <addressOffset>0x000000B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF0FFFFF</resetMask>

          <fields>
            <field>
              <name>SYSBSY</name>
              <description>system busy</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMBSY</name>
              <description>memory system busy</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLBSY</name>
              <description>command list bus busy</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

