AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>RXUPPERLIMIT</name>
          <description>The number of samples required to be in the RX FIFO before asserting the RX_FFi interrupt bit</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SIZE</name>
              <description>When the I2S sample count stored within the receive FIFO reaches this value or is larger, the interrupt RX_FFi bit is asserted.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXDATA</name>
          <description>Write only register to hold the i2S sample to transmit via the write FIFO</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TXSAMPLE</name>
              <description>32b I2S sample to send out of the I2S module via the external pins.   All sample have the MSB in bit 31 regardless of number of bits per sample and data justification</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXCHANID</name>
          <description>Channel ID used for the next audio sample to be written to the data transmission register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>TXCHANID</name>
              <description>Channel ID value 0-255.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOSTATUS</name>
          <description>Holds the number of samples currently in the transmit FIFO, and the full condition flag</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>

          <fields>
            <field>
              <name>TXFIFOFULL</name>
              <description>Transmit FIFO full bit.  a 1 indicates the transmit FIFO is full.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXFIFOCNT</name>
              <description>The count of the number of samples currently in the transmit FIFO.</description>
              <bitRange>[27:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFOSIZE</name>
          <description>Holds the size of the transmit FIFO in samples</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SIZE</name>
              <description>Size of the transmit FIFO in units of I2S samples.  Read only value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXLOWERLIMIT</name>
          <description>Minimum number of samples have been reached in the transmit FIFO.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>SIZE</name>
              <description>When the number of sample in the TX FIFO goes below this value, the interrupt TX_FFi bit is asserted.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>I2SDATACFG</name>
          <description>Specifies the data format of I2S sub frames</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x01AC01A4</resetValue>
          <resetMask>0xFFFF7FEF</resetMask>

          <fields>
            <field>
              <name>PH</name>
              <description>Read Phase Bit. 0: Single Phase frame; 1: Dual-Phase frame.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRLEN2</name>
              <description>Number of channels in phase 2;  0: 1 Channel in phase 2, .. 0x7: 8 channels in phase 2</description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1CHLS</name>
                  <description>One channel in phase 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2CHLS</name>
                  <description>Two channels in phase 2.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3CHLS</name>
                  <description>Three channels in phase 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4CHLS</name>
                  <description>Four channels in phase 2.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5CHLS</name>
                  <description>Five channels in phase 2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6CHLS</name>
                  <description>Six channels in phase 2.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7CHLS</name>
                  <description>Seven channels in phase 2.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8CHLS</name>
                  <description>Eight channels in phase 2.</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDLEN2</name>
              <description>Receive channel length in bits for phase 2. 0: 8b, 2: 16b, 4: 24b, 5: 32b, 1,3,6,7: Reserved</description>
              <bitRange>[23:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8b</name>
                  <description>Receive channel length is 8 bits for phase 2.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16b</name>
                  <description>Receive channel length is 16 bits for phase 2.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24b</name>
                  <description>Receive channel length is 24 bits for phase 2.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32b</name>
                  <description>Receive channel length is 32 bits for phase 2.</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATADLY</name>
              <description>Receive data delay bit count. Valid values are 0-2, 3 is reserved.</description>
              <bitRange>[20:19]</bitRange>
              <access>read-write</access>

