AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>RXDMAM</name>
              <description>Receive FIFO interrupt mask. Will assert interrupt when = 1 and cimdmareq_rx is asserted</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXEM</name>
              <description>Transmit FIFO interrupt mask.  Will assert interrupt when = 1 and TXEI is asserted</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFM</name>
              <description>Receive FIFO interrupt mask.  Will assert interrupt when = 1 and RXFI is asserted</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXFFM</name>
              <description>Transmit FIFO interrupt mask.  Will assert interrupt when = 1 and TXFFI is asserted</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXFFM</name>
              <description>Receive FIFO interrupt mask.  Will assert interrupt when = 1 and RXFFI is asserted</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IPCOREID</name>
          <description>Returns the core ID of the IPB core, and used to write the I2S validity mask.</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xDA1A0000</resetValue>
          <resetMask>0xFFFF0000</resetMask>

          <fields>
            <field>
              <name>COREFAM</name>
              <description>Core Family.  Also bit 31 is used to set the I2S validity bit when a write is done.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>COREID</name>
              <description>Core ID of the IPB core</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AMQCFG</name>
          <description>Control the enablement of the ASRC module and the source of the MCLK used in the IPB core.</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>ASRCEN</name>
              <description>ASRC sub module enable. 0: Enabled.  1: Disabled/Bypassed</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCLKSRC</name>
              <description>MCLK source.  1: Output of nco_clk divider.  0: MCLK from ambiq clock configuration directly</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Provides clock selection and control for I2S clocks</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000160</resetValue>
          <resetMask>0x001311F1</resetMask>

          <fields>
            <field>
              <name>DIV3</name>
              <description>0: no change to the clock selected by FSEL  1: frequency divide-by-3 of the clock selected by FSEL</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REFFSEL</name>
              <description>FUTURE USE  Select the input clock frequency for the ref_clk.  0: HFRC_48MHz  1: HFRC_48MHz_GATED  2: XT_24MHz   3: HFRC2_48MHz</description>
              <bitRange>[17:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REFCLKEN</name>
              <description>FUTURE USE  Enable for the reference clock</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSEL</name>
              <description>Select the input clock frequency for the MCLK.Whenever changing the clock source here, the MISC_HFRC2FRC bit in the CLKGEN module must first be set. The sequence for changing the clock source regardless of clock selection is to first force HFRC2 on by setting the CLKGEN_MISC_HFRC2FRC bit, select the clock source in this field, clear the CLKGEN_MISC_HFRC2FRC bit only if HFRC2 is NOT selected, and then engage the peripheral.If HFRC2 is the clock source, then shutting the module down cleanly requires switching to HFRC, for example, and then disabling the HFRC2 by clearing the CLKGEN_MISC_HFRC2FRC bit. 0: HFRC2_48MHz  1: HFRC2_24MHz  2: HFRC2_12MHz  3: HFRC2_6MHz  4: HFRC2_3MHz  5: HFRC2_1_5MHz  6: HFRC2_750KHz  7: HFRC2_375KHz  8: HFRC_24MHz  9: HFRC_12MHz  10: HFRC_6MHz  11: HFRC_3MHz  12: HFRC_1_5MHz  13: HFRC_750KHz  14: HFRC_375KHz  15: XTHS_EXTREF_CLK  16: XTHS_16MHz  17: XTHS_8MHz  18: XTHS_4MHz  19: XTHS_2MHz  20: XTHS_1MHz  21: XTHS_500KHz  22: HFRC_48MHz</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MCLKEN</name>
              <description>Enable for the master audio clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

