AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>CMDSEL</name>
              <description>Command Specific selection information. Not used in Master I2C. Used as CEn select for Master SPI transactions</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TSIZE</name>
              <description>Defines the transaction size in bytes. The offset transfer is not included in this size.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CONT</name>
              <description>Contine to hold the bus after the current transaction if set to a 1 with a new command issued.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OFFSETCNT</name>
              <description>Number of offset bytes to use for the command - 0, 1, 2, 3, 4, 5  are valid selections. The second (byte 1),third (byte 2), and forth (byte 3)  are read from the OFFSETHI register, and the low order byte is pulled from this register in the OFFSETLO field.
Offset bytes are transmitted highest byte first.  EG if offsetcnt == 4, OFFSETHI[23:16] will be transmitted first, then OFFSETHI[15:8], then OFFSETHI[7:0] then OFFSETLO.
If offsetcnt == 5, OFFSETHI[31:24] will be transmitted, then OFFSETHI[23:0], then OFFSETLO.
If offsetcnt == 4, OFFSETHI[23:16] will be transmitted, then OFFSETHI[15:0], then OFFSETLO.
If offsetcnt == 3, OFFSETHI[15:8] will be transmitted, then OFFSETHI[7:0], then OFFSETLO.
If offsetcnt == 2, OFFSETHI[7:0] will be transmitted, then OFFSETLO.
If offsetcnt == 1, only OFFSETLO will be transmitted.
Offset bytes are always transmitted MSB first, regardless of the value of the LSB control bit within the module configuration.</description>
              <bitRange>[6:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CMD</name>
              <description>Command for submodule.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read command using count of offset bytes specified in the OFFSETCNT field</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMW</name>
                  <description>SPI only. Test mode to do constant write operations. Useful for debug and power measurements. Will continually send data in OFFSET field</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR</name>
                  <description>SPI Only. Test mode to do constant read operations. Useful for debug and power measurements. Will continually read data from external input</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DCXCTRL</name>
          <description>Enables transmission of DCX signal with SPI transactions and selects which CE signals will be used to transmit the DCX signal.</description>
          <addressOffset>0x00000124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DCXEN</name>
              <description>Global enable of the DCX function. Setting to 1 will enable the generation of the DCX signal, which will assert when sending the offset bytes of the SPI transaction.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCXSEL</name>
              <description>Selects the CE channel used to convey the DCX function. The select is bitwise encoded, with bit 0 = 1 enabling CE0 for DCX transmission, bit 1 = 1 enableing CE1 for DCX transmission, etc. If the CE used for the SPI transaction is set, it will be ignored and used as the transaction CE instead. Multiple CE channels can be selected at once. To enable the DCX signal to be transmitted out of the chip, the corresponding pin mux function must be enabled in the GPIO logic as well.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETHI</name>
          <description>High order bytes of offset for IO transaction</description>
          <addressOffset>0x00000128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>OFFSETHI</name>
              <description>Holds the high order bytes of the byte addressing/offset field to use with IO commands. The number of offset bytes to use is specified in the command register</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CMDSTAT</name>
          <description>Provides staus on the execution of the command currently in progress. The fields in this register will reflect the real time status of the internal state machines and data transfers within the IOM.
These are read only fields and writes to the registers are ignored.</description>
          <addressOffset>0x0000012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>CTSIZE</name>
              <description>The current number of bytes still to be transferred with this command. This field will count down to zero.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

