AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>XCMPRF</name>
              <description>Transfer complete interrupt, read from FIFO space.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOINTW</name>
              <description>IO Write interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>GENAD</name>
              <description>I2C General Address interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FRDERR</name>
              <description>FIFO Read Error interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FUNDFL</name>
              <description>FIFO Underflow interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FOVFL</name>
              <description>FIFO Overflow interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FSIZE</name>
              <description>FIFO Size interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REGACCINTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>REGACC</name>
              <description>Register access interrupts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>MCUCTRL</name>
      <version>1.0</version>
      <description>MCU Miscellaneous Control Logic</description>
      <!-- <groupName>GROUP_MCUCTRL</groupName> -->
      <baseAddress>0x40020000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000458</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>BROWNOUT</name>
        <description>BROWNOUT_IRQ</description>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CHIPPN</name>
          <description>Chip Information</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x08320088</resetValue>
          <resetMask>0xFFFFFFFE</resetMask>

          <fields>
            <field>
              <name>PN</name>
              <description>Apollo family device type.</description>
              <bitRange>[31:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>APOLLO4L</name>
                  <description>Apollo4L part number is 0x09xxxxxx.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO4</name>
                  <description>Apollo4 part number is 0x08xxxxxx.</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO3P</name>
                  <description>Apollo3P part number is 0x07xxxxxx.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO3</name>
                  <description>Apollo3 part number is 0x06xxxxxx.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO2</name>
                  <description>Apollo2 part number is 0x03xxxxxx.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>APOLLO</name>
                  <description>Apollo part number is 0x01xxxxxx.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MRAMSIZE</name>
              <description>MRAM size.</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0P5MB</name>
                  <description>MRAM size is 0.5MB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P0MB</name>
                  <description>MRAM size is 1.0MB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P5MB</name>
                  <description>MRAM size is 1.5MB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P0MB</name>
                  <description>MRAM size is 2.0MB</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMSIZE</name>
              <description>SRAM size.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>384_512</name>
                  <description>SRAM size is 384KB+512KB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>384_1024</name>
                  <description>SRAM size is 384KB+1MB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>384_1024_384_96</name>
                  <description>SRAM size is 384KB+1MB+384KB+96KB</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVMAJ</name>
              <description>Major revision.</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>A</name>
                  <description>Major Rev A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Major Rev B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C</name>
                  <description>Major Rev C</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVMIN</name>
              <description>Minor revision.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Minor Rev 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Minor Rev 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PKG</name>
              <description>Package type.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIP</name>
                  <description>SIP package.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIP2</name>
                  <description>SIP2 package.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGA</name>
                  <description>BGA package.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSP</name>
                  <description>CSP package.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINS</name>
              <description>Number of pins for this package.</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>25</name>
                  <description>25 pins</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>49</name>
                  <description>49 pins</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 pins</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>81</name>
                  <description>81 pins</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMP</name>
              <description>Temperature.</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COM</name>
                  <description>Commercial temperature</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MIL</name>
                  <description>Military temperature</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Automotive temperature</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IND</name>
                  <description>Industrial temperature</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID0</name>
          <description>Unique Chip ID 0</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHIPID0</name>
              <description>Unique chip ID 0.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

