AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CHIPID1</name>
          <description>Unique Chip ID 1</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CHIPID1</name>
              <description>Unique chip ID 1.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CHIPREV</name>
          <description>Chip Revision</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000011</resetValue>
          <resetMask>0x000FFFFF</resetMask>

          <fields>
            <field>
              <name>SIPART</name>
              <description>Silicon Part ID</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>REVMAJ</name>
              <description>Major Revision ID.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C</name>
                  <description>Apollo4 revision C</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>Apollo4 revision B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>Apollo4 revision A</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REVMIN</name>
              <description>Minor Revision ID.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REV2</name>
                  <description>Apollo4 minor rev 2.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV1</name>
                  <description>Apollo4 minor rev 1.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REV0</name>
                  <description>Apollo4 minor rev 0. Minor revision value, succeeding minor revisions will increment from this value.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VENDORID</name>
          <description>Unique Vendor ID</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VENDORID</name>
              <description>Unique Vendor ID</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMBIQ</name>
                  <description>Ambiq Vendor ID 'AMBQ'</description>
                  <value>1095582289</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Default Vendor ID</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SKU</name>
          <description>Unique Chip SKU</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>SKUSECURESPOT</name>
              <description>Secure boot feature</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUUSB</name>
              <description>USB available</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUGFX</name>
              <description>GFX available</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUMIPIDSI</name>
              <description>MIPI DSI available</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUTURBOSPOT</name>
              <description>High performance mode for MCU and DSPs.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUDSP</name>
              <description>DSP availability SKU setting. 384K available by default. Memory SU disabled</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SKUMRAMSIZE</name>
              <description>MRAM size SKU. All of 2MB Available by default. Memory SU disabled</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

