AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>SKUSRAMSIZE</name>
              <description>SRAM SKU dictates the available memory for MCU. All of the MCU TCM (384KB) and System SRAM (2MB) available by default. Memory SU disabled</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEBUGGER</name>
          <description>Debugger Control</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LOCKOUT</name>
              <description>Lockout of debugger (SWD).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ACRG</name>
          <description>Active Current Reference Generator Control</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>ACRGTRIM</name>
              <description>ACRG Trim value</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACRGIBIASSEL</name>
              <description>Set the ACRG ibias. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect. The inversion of this register is driven to analog.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGSEL</name>
                  <description>Selects the bandgap</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCRGSEL</name>
                  <description>Selects the CCRG</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACRGPWD</name>
              <description>Power down the ACRG.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACRG_PWR_DN</name>
                  <description>Powers down the ACRG trim.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACRG_PWR_UP</name>
                  <description>Power up the ACRG trim.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACRGSWE</name>
              <description>Software enablement for ACRG register. A value of 1 will allow writes to the register</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VREFGEN2</name>
          <description>Voltage Reference Generator 2 Control</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x07C41F10</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>

          <fields>
            <field>
              <name>TVRG2SELVREF</name>
              <description>TVRG2 SEL VREF</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGSELVREF</name>
              <description>TVRG SEL VREF</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRG2VREFTRIM</name>
              <description>Calibrated voltage reference 580m trim</description>
              <bitRange>[27:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRG2CURRENTTRIM</name>
              <description>Calibrated voltage reference current trim.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRG2PWD</name>
              <description>Power Down, Calibrated Voltage Reference Generator.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWR_DN</name>
                  <description>Powers down the CVRG.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_UP</name>
                  <description>Power up the CVRG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TVRG2TEMPCOTRIM</name>
              <description>Calibrated Voltage Reference Generator tc trim (bottom transistor)</description>
              <bitRange>[18:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGVREFTRIM</name>
              <description>Calibrated voltage reference 580m trim</description>
              <bitRange>[13:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TVRGCURRENTTRIM</name>
              <description>Calibrated voltage reference current trim.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

