AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>CORELDOACTIVEEARLY</name>
              <description>CORE LDO EARLY ACTIVE control. Override for PWRCTRL going to analog when CORELDOOVER = 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOPDNB</name>
              <description>CORE LDO PDNB control. Override for PWRCTRL going to analog when CORELDOOVER = 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOOVER</name>
              <description>Override control for CORE LDO signals</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LDOREG1</name>
          <description>CORELDO trims Reg</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0006D3A3</resetValue>
          <resetMask>0x003FFFFF</resetMask>

          <fields>
            <field>
              <name>CORELDOIBIASSEL</name>
              <description>Core LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOIBIASTRIM</name>
              <description>CORE LDO IBIAS Trim</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOLPTRIM</name>
              <description>CORE LDO Low Power Trim</description>
              <bitRange>[19:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOTEMPCOTRIM</name>
              <description>CORE LDO TEMPCO trim</description>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORELDOACTIVETRIM</name>
              <description>CORE LDO active trim</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LDOREG2</name>
          <description>MEMLDO and MEMLPLDO Trims</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x207FCF3A</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>

          <fields>
            <field>
              <name>TRIMANALDO</name>
              <description>Analog LDO Trim.</description>
              <bitRange>[29:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOIBIASSEL</name>
              <description>Mem LDO IBIAS sel. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOIBIASTRIM</name>
              <description>Mem LPLDO IBIAS trim</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLPLDOTRIM</name>
              <description>MEM LPLDO TRIM</description>
              <bitRange>[23:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOLPALTTRIM</name>
              <description>MEM LDO TRIM LP ALT SET</description>
              <bitRange>[17:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOLPTRIM</name>
              <description>MEM LDO LP trim</description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MEMLDOACTIVETRIM</name>
              <description>MEM LDO active trim</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>HFRC2</name>
          <description>HFRC2 Control</description>
          <addressOffset>0x000000C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003FF800</resetMask>

          <fields>
            <field>
              <name>HF2TUNE</name>
              <description>Default HFRC2 frequency tune value</description>
              <bitRange>[21:11]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LFRC</name>
          <description>LFRC Control</description>
          <addressOffset>0x000000E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000120</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>LFRCSIMOCLKDIV</name>
              <description>SIMOBUCK LP mode clock divider</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide by 32</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LFRCITAILTRIM</name>
              <description>LFRC ITAIL trim</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>

