AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>RESETLFRC</name>
              <description>LFRC Reset.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable LFRC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset LFRC.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWDLFRC</name>
              <description>Power Down LFRC.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUP</name>
                  <description>Power up LFRC.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRDN</name>
                  <description>Power down LFRC.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIMTUNELFRC</name>
              <description>LFRC Frequency Tune trim bits</description>
              <bitRange>[5:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>LFRCSWE</name>
              <description>LFRC Software Override Enable.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_DIS</name>
                  <description>LFRC Software Override Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_EN</name>
                  <description>LFRC Software Override Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BODCTRL</name>
          <description>BOD control</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BODHVREFSEL</name>
              <description>BODH External Reference Select. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODLVREFSEL</name>
              <description>BODL External Reference Select. Note: the SWE mux select in PWRSEQ2SWE must be set for this to take effect.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODCLVPWD</name>
              <description>BODC_LV Power Down.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODSPWD</name>
              <description>BODS Power Down.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODFPWD</name>
              <description>BODF Power Down.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODCPWD</name>
              <description>BODC Power Down.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODHPWD</name>
              <description>BODH Power Down.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODLPWD</name>
              <description>BODL Power Down.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCPWRDLY</name>
          <description>ADC Power Up Delay Control</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000018A9</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>ADCPWR1</name>
              <description>Delay time for ADC Reference Buffer settling time in 64x ADC clock increments. Delay = 64*ADCPWR1*ADC_CLK</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ADCPWR0</name>
              <description>Additional delay time for ADC Reference Buffer settling time in 64x ADC clock increments. Delay = 64*ADCPWR0*ADC_CLK.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>ADCPWRCTRL</name>
          <description>ADC Power Control</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x0001FBFF</resetMask>

          <fields>
            <field>
              <name>ADCKEEPOUTEN</name>
              <description>ADC reference keeper out en</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

