AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>PWRSWVDDMDSP1OVERRIDE</name>
              <description>override enable for pwrsw_vddmdsp1_dynsel</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMDSP1STATSEL</name>
              <description>VDDMDSP1 power switch static select</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDF</name>
                  <description>Select VDDF rail</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDMDSP1DYNSEL</name>
              <description>override value for pwrsw_vddmdsp1_dynsel</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMDSP0OVERRIDE</name>
              <description>override enable for pwrsw_vddmdsp0_dynsel</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMDSP0STATSEL</name>
              <description>VDDMDSP0 power switch static select</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDF</name>
                  <description>Select VDDF rail</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDMDSP0DYNSEL</name>
              <description>override value for pwrsw_vddmdsp0_dynsel</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMCPUOVERRIDE</name>
              <description>override enable for pwrsw_vddmcpu_dynsel</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDMCPUSTATSEL</name>
              <description>VDDMCPU power switch static select</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDF</name>
                  <description>Select VDDF rail</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDMCPUDYNSEL</name>
              <description>override value for pwrsw_vddmcpu_dynsel</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDDSP1OVERRIDE</name>
              <description>override enable for pwrsw_vdddsp1_dynsel and pgn</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDDSP1PGN</name>
              <description>override value for pwrsw_vdddsp1_pgn</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDDSP1DYNSEL</name>
              <description>override value for pwrsw_vdddsp1_dynsel</description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDDSP0OVERRIDE</name>
              <description>override enable for pwrsw_vdddsp0_dynsel and pgn</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDDSP0PGN</name>
              <description>override value for pwrsw_vdddsp0_pgn</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDDSP0DYNSEL</name>
              <description>override value for pwrsw_vdddsp0_dynsel</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCAOROVERRIDE</name>
              <description>override enable for pwrsw_vddcaor_dynsel</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCAORDYNSEL</name>
              <description>override value for pwrsw_vddcaor_dynsel</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDCPUOVERRIDE</name>
              <description>override enable for pwrsw_vddcpu_dynsel and pgn</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

