AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>PWRSWVDDRLSTATSEL</name>
              <description>VDDRL power switch static select</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRLPGN</name>
              <description>override value for pwrsw_vddrl_pgn</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRLDYNSEL</name>
              <description>override value for pwrsw_vddrl_dynsel</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRDSP1OVERRIDE</name>
              <description>override enable for pwrsw_vddrdsp1_dynsel and pgn</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRDSP1STATSEL</name>
              <description>VDDRDSP1 power switch static select</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRDSP1PGN</name>
              <description>override value for pwrsw_vddrdsp1_pgn</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRDSP1DYNSEL</name>
              <description>override value for pwrsw_vddrdsp1_dynsel</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRDSP0OVERRIDE</name>
              <description>override enable for pwrsw_vddrdsp0_dynsel and pgn</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRDSP0STATSEL</name>
              <description>VDDRDSP0 power switch static select</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDC</name>
                  <description>Select VDDC rail</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDFLP</name>
                  <description>Select VDDFLP rail</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSWVDDRDSP0PGN</name>
              <description>override value for pwrsw_vddrdsp0_pgn</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSWVDDRDSP0DYNSEL</name>
              <description>override value for pwrsw_vddrdsp0_dynsel</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>USBRSTCTRL</name>
          <description>USB Reset Startup Control</description>
          <addressOffset>0x00000388</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>USBUTMIRSTRELEASE</name>
              <description>Set this bit to '1' after USB power domain is up.  This will release the reset override condition</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBPORRSTRELEASE</name>
              <description>Set this bit to '1' after USB power domain is up.  This will release the reset override condition</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBRSTENABLE</name>
              <description>This bit enables this register control. If set to '1', the reset release bits will be active.  If set to '0', this register is not controlling the USB override bits.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FLASHWPROT0</name>
          <description>These bits write-protect flash in 16KB chunks.</description>
          <addressOffset>0x000003A8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FW0BITS</name>
              <description>Write protect flash 0x00000000 - 0x0007FFFF. Each bit provides write protection for 16KB chunks of flash data space. Bits are cleared by writing a 1 to the bit. When read, 0 indicates the region is protected. Bits are sticky (can be set when PROTLOCK is 1, but only cleared by reset)</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

