AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>RESERVED07</name>
              <description>DSP0 ICACHE TAG WABLM - 00=No adjust 11=increased delay, enabled by WABL</description>
              <bitRange>[14:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED06</name>
              <description>DSP0 ICACHE TAG RAM WABL - Write Assist Enable (active high)</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED05</name>
              <description>DSP0 ICACHE TAG RAWLM</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED04</name>
              <description>DSP0 ICACHE TAG RAWL</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED03</name>
              <description>DSP0 ICACHE TAG EMAW</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED02</name>
              <description>DSP0 ICACHE TAG EMAS</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESERVED01</name>
              <description>DSP0 ICACHE TAG EMA</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBPHYUTMIRSTDIS</name>
              <description>De-assert USB PHY UTMI reset override</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBPHYPORRSTDIS</name>
              <description>De-assert USB PHY POR reset override</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AUDADCPWRCTRL</name>
          <description>Audio ADC Power Control</description>
          <addressOffset>0x0000042C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0007D73F</resetMask>

          <fields>
            <field>
              <name>AUDADCKEEPOUTEN</name>
              <description>Audio ADC reference keeper out en</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCRFBUFSLWEN</name>
              <description>Audio ADC reference buffer slew enable</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCINBUFEN</name>
              <description>Audio ADC Input Buffer Power Enable ( if the AUDADCPWRCTRLSWE bit is set )</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCINBUFSEL</name>
              <description>Audio ADC input buffer mux select</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCVBATDIVEN</name>
              <description>Audio ADC VBAT DIV Power Enable ( if the AUDADCPWRCTRLSWE bit is set )</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDDAUDADCRESETN</name>
              <description>RESETN signal for Power Switched SAR and Digital Controller (when global power switch is off and if the AUDADCPWRCTRLSWE bit is set)</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASSERT</name>
                  <description>Resetn is asserted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEASSERT</name>
                  <description>Resetn is de-asserted</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDAUDADCDIGISOLATE</name>
              <description>ISOLATE signal for audio ADC Digital Contoller ( when AUDADCAPSEN is switched off and if the AUDADCPWRCTRLSWE bit is set)</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No Isolation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Isolate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VDDAUDADCSARISOLATE</name>
              <description>ISOLATE signal for Power Switched SAR ( when AUDADCBPSEN is switched off )</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No Isolation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Isolate</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDREFKEEPPEN</name>
              <description>Reference Buffer Keeper Power Switch Enable</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Reference Buffer Keeper Power Switch disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Reference Buffer Keeper Power Switch enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDREFBUFPEN</name>
              <description>Reference Buffer Power Switch Enable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Reference Buffer Power Switch disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Reference Buffer Power Switch enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDBGTPEN</name>
              <description>Bandgap and Temperature Sensor Power Switch Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Bandgap and temperature sensor disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Bandgap and temperature sensor enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCBPSEN</name>
              <description>Enable the Analog, IO and SAR Digital logic Power Switch on when set to 1 if the AUDADCPWRCTRLSWE bit is set.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>AUDADC power switch software power disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>AUDADC power switch software power enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCAPSEN</name>
              <description>Enable the Global audio ADC Power Switch on when set to 1 if the AUDADCPWRCTRLSWE bit is set.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>AUDADC power switch software power disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>AUDADC power switch software power enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCPWRCTRLSWE</name>
              <description>Audio ADC Power Control Software Override Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERRIDE_DIS</name>
                  <description>Audio ADC temperature sensor and bandgap Software Override Disable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERRIDE_EN</name>
                  <description>Audio ADC temperature sensor and bandgap Software Override Enable.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUDIO1</name>
          <description>Audio trims 1</description>
          <addressOffset>0x00000430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FC0</resetMask>

          <fields>
            <field>
              <name>MICBIASPDNB</name>
              <description>Power down control for the block</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

