AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>PGACHA1GAIN1SEL</name>
              <description>Channel A1 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA0GAIN2SEL</name>
              <description>Channel A0 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA0GAIN2DIV2SEL</name>
              <description>Channel A0 PGA divide by two select (0: 0 dB, 1: -6dB), needed for fully differential inputs</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHA0GAIN1SEL</name>
              <description>Channel A0 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PGACTRL2</name>
          <description>PGA control 2</description>
          <addressOffset>0x00000440</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x83FFFFFF</resetMask>

          <fields>
            <field>
              <name>PGAGAINBOVRD</name>
              <description>Apply BYPASS and GAIN bits from this register (for channel B) instead of automatically via audio ADC.  Note that audio ADC FIFO meta data will not reflect dB gain as used when configuring audio ADC.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBVCMGENQCHARGEEN</name>
              <description>Channel B VCMGEN quick charge enable (pulsed during channel powerup)</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBVCMGENPDNB</name>
              <description>Channel B VCMGEN power down  (0: powered down, 1: powered up)</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBOPAMPOUTPDNB</name>
              <description>Channels B0 and B1 output stage opamp power down (0: powered down, 1: powered up)</description>
              <bitRange>[23:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBOPAMPINPDNB</name>
              <description>Channels B0 and B1 input stage opamp power down (0: powered down, 1: powered up). Must be 1 when respective PGACHBBYPASSEN = 0.</description>
              <bitRange>[21:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHBBYPASSEN</name>
              <description>Bypass enable for Channels B0 and B1 (1: bypass, when gain LT 12 dB; 0: otherwise)</description>
              <bitRange>[19:18]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB1GAIN2SEL</name>
              <description>Channel B1 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)</description>
              <bitRange>[17:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB1GAIN2DIV2SEL</name>
              <description>Channel B1 PGA divide by two select (0: 0 dB, 1: -6dB), needed for fully differential inputs</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB1GAIN1SEL</name>
              <description>Channel B1 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB0GAIN2SEL</name>
              <description>Channel B0 PGA gain (0: 0dB, ..., 23: 11.5dB in 0.5 dB steps)</description>
              <bitRange>[8:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB0GAIN2DIV2SEL</name>
              <description>Channel B0 PGA divide by two select (0: 0 dB, 1: -6dB), needed for fully differential inputs</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PGACHB0GAIN1SEL</name>
              <description>Channel B0 preamp gain (0: 12dB, ..., 7: 33dB in 3 dB steps)</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>AUDADCPWRDLY</name>
          <description>Audio ADC Power Up Delay Control</description>
          <addressOffset>0x00000444</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000200</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>AUDADCPWR1</name>
              <description>ADC Reference Keeper enable delay in 16 ADC CLK increments for ADC_CLKSEL = 0x1, 8 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>AUDADCPWR0</name>
              <description>ADC Reference Buffer Power Enable delay in 64 ADC CLK increments for ADC_CLKSEL = 0x1, 32 ADC CLOCK increments for ADC_CLKSEL = 0x2.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

