AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>INSTR</name>
          <description>Optional Instruction field to send for PIO transfers</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>INSTR</name>
              <description>Optional Instruction field to send (1st byte) - qualified by ISEND/ISIZE</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXFIFO</name>
          <description>TX Data FIFO</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TXFIFO</name>
              <description>Data to be transmitted. Data should normally be aligned to the LSB (pad the upper bits with zeros) unless BIGENDIAN is set.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RXFIFO</name>
          <description>RX Data FIFO</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>RXFIFO</name>
              <description>Receive data. Data is aligned to the LSB (padded zeros on upper bits) unless BIGENDIAN is set.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TXENTRIES</name>
          <description>Number of words in TX FIFO</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>TXENTRIES</name>
              <description>Number of 32-bit words/entries in TX FIFO</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RXENTRIES</name>
          <description>Number of words in RX FIFO</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>RXENTRIES</name>
              <description>Number of 32-bit words/entries in RX FIFO</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>THRESHOLD</name>
          <description>Threshold levels that trigger RXFull and TXEmpty interrupts</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003F3F</resetMask>

          <fields>
            <field>
              <name>RXTHRESH</name>
              <description>Number of entries in TX FIFO that cause RXE interrupt</description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXTHRESH</name>
              <description>Number of entries in TX FIFO that cause TXF interrupt</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>MSPICFG</name>
          <description>Timing configuration bits for the MSPI module. PRSTN, IPRSTN, and FIFORESET can be used to reset portions of the MSPI interface in order to clear error conditions. The remaining bits control clock frequency and TX/RX capture timings.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC00000F0</resetValue>
          <resetMask>0xE00000F1</resetMask>

          <fields>
            <field>
              <name>PRSTN</name>
              <description>Peripheral reset. Master reset to the entire MSPI module (DMA, XIP, and transfer state machines). 1=normal operation, 0=in reset.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IPRSTN</name>
              <description>IP block reset. Write to 0 to put the transfer module in reset or 1 for normal operation. This may be required after error conditions to clear the transfer on the bus.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FIFORESET</name>
              <description>Reset MSPI FIFO (active high). 1=reset FIFO, 0=normal operation. May be used to manually flush the FIFO in error handling.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IOMSEL</name>
              <description>Selects which IOM is selected for CQ handshake status.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IOM0</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM1</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM2</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM3</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM4</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM5</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM6</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IOM7</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI0</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI1</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MSPI2</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>APBCLK</name>
              <description>Enable continuous APB clock. For power-efficient operation, APBCLK should be set to 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable continuous clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable continuous clock.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PADOUTEN</name>
          <description>Enable bits for the MSPI output pads. Each active MSPI line should be set to 1 in the OUTEN field below.</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC00FFFFF</resetMask>

          <fields>
            <field>
              <name>CLKOND4</name>
              <description>Output clock on MSPI data[4]</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

