AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>XIPTURNAROUND0</name>
              <description>Number of turnaound cycles (for TX->RX transitions). Qualified by XIPENTURN bit field.</description>
              <bitRange>[19:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPENWLAT0</name>
              <description>Enable Write Latency counter for XIP write transactions</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPENDCX0</name>
              <description>Enable DCX signal on data [1] for XIP/DMA operations</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPMIXED0</name>
              <description>Provides override controls for data operations where instruction, address, and data may transfer in different rates.</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Transfers all proceed using the settings in DEVCFG register (everything in the same data rate)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D2</name>
                  <description>Data operations proceed in dual data rate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD2</name>
                  <description>Address and Data operations proceed in dual data rate</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D4</name>
                  <description>Data operations proceed in quad data rate</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD4</name>
                  <description>Address and Data operations proceed in quad data rate</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D8</name>
                  <description>Data operations proceed in octal data rate</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AD8</name>
                  <description>Address and Data operations proceed in octal data rate</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPSENDI0</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an instruction (see READINSTR field and ISIZE field in CFG)</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPSENDA0</name>
              <description>Indicates whether XIP/AUTO DMA operations should send an an address phase (see DMADEVADDR register and ASIZE field in CFG)</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPENTURN0</name>
              <description>Indicates whether XIP/AUTO DMA operations should enable TX->RX turnaround cycles</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPBIGENDIAN0</name>
              <description>Indicates whether XIP/AUTO DMA data transfers are in big or little endian format</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>XIPACK0</name>
              <description>Controls transmission of Micron XIP acknowledge cycles (Micron Flash devices only)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOACK</name>
                  <description>No acknowledege sent. Data IOs are tristated the first turnaround cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACK</name>
                  <description>Positive acknowledege sent. Data IOs are driven to 0 the first turnaround cycle to acknowledge XIP mode</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TERMINATE</name>
                  <description>Negative acknowledege sent. Data IOs are driven to 1 the first turnaround cycle to terminate XIP mode. XIPSENDI should be reenabled for the next transfer</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPEN0</name>
              <description>Enable the XIP (eXecute In Place) function which effectively enables the address decoding of the MSPI device in the flash/cache address space at address 0x04000000-0x07FFFFFF.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0INSTR</name>
          <description>When any SPI flash is configured, this register must be properly programmed before XIP or AUTO DMA operations commence.</description>
          <addressOffset>0x00000094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000B0006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>READINSTR0</name>
              <description>Read command sent to flash for DMA/XIP operations</description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>

