AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>WRITEINSTR0</name>
              <description>Write command sent for DMA operations</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0BOUNDARY</name>
          <description>Allows large transfers to be broken up into smaller ones in hardware to accommodate needs of external devices and allow XIP/XIPMM. Only applicable for memory-mapped devices (PSRAM, Flash, etc) where address can be retransmitted without side effects.</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DMABOUND0</name>
              <description>DMA Address boundary</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Disable DMA address boundary breaks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK32</name>
                  <description>Break at 32 byte boundary (0x20 increments)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK64</name>
                  <description>Break at 64 byte boundary (0x40 increments)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK128</name>
                  <description>Break at 128 byte boundary (0x80 increments)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK256</name>
                  <description>Break at 256 byte boundary (0x100 increments)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK512</name>
                  <description>Break at 512 byte boundary (0x200 increments)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK1K</name>
                  <description>Break at 1KB boundary (0x400 increments)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK2K</name>
                  <description>Break at 2KB boundary (0x800 increments)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK4K</name>
                  <description>Break at 4KB boundary (0x1000 increments)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK8K</name>
                  <description>Break at 8KB boundary (0x2000 increments)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BREAK16K</name>
                  <description>Break at 16KB boundary (0x4000 increments)</description>
                  <value>10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMATIMELIMIT0</name>
              <description>DMA time limit. Can be used to limit the transaction time on the MSPI bus. The count is in ~100 ns increments for the 96 MHz clock input. A value of 0 disables the counter.</description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0SCRAMBLING</name>
          <description>Enables data scrambling for the specified range external flash addresses. Scrambling does not impact flash access performance.</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x83FF03FF</resetMask>

          <fields>
            <field>
              <name>SCRENABLE0</name>
              <description>Enables Data Scrambling Region. When 1 reads and writes to the range will be scrambled. When 0, data will be read/written unmodified. Address range is specified in 64K granularity and the START/END ranges are included within the range.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCREND0</name>
              <description>Scrambling region end address [25:16] (64K block granularity). The END block is the LAST block included in the scrambled address range.</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SCRSTART0</name>
              <description>Scrambling region start address [25:16] (64K block granularity). The START block is the FIRST block included in the scrambled address range.</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DEV0XIPMISC</name>
          <description>Miscellaneous XIP control registers for AXI logic</description>
          <addressOffset>0x000000A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000900A</resetValue>
          <resetMask>0x0020FFFF</resetMask>

          <fields>
            <field>
              <name>APNDODD0</name>
              <description>Append dummy byte to odd number of write</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>No appending byte</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Append one dummy byte</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XIPBOUNDARY0</name>
              <description>Deprecated. No effect on RevC.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>ERROR: desc VALUE MISSING</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEON0</name>
              <description>Byte enable always on for all lanes</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Byte enable is calculated on the fly</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Byte enable of all bytes are always on</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BEPOL0</name>
              <description>byte mask polarity to MSPI xfer</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

