AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>CQENDIDX</name>
          <description>Command Queue End Index</description>
          <addressOffset>0x000002C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>CQENDIDX</name>
              <description>Can be used to indicate the end position of the command queue. A CQ hardware status bit indices when CURIDX != ENDIDX so that the CQ can be paused when it reaches the end pointer.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STATXIPDMA</name>
          <description>Debug XIP DMA State</description>
          <addressOffset>0x00000310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>FLD32</name>
              <description>XIP/DMA module debug</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XIPDMAIDLE</name>
                  <description>This bit indicates the idle status of XIPDMA.</description>
                  <value>2048</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="MSPI0">
      <name>MSPI1</name>
      <baseAddress>0x40061000</baseAddress>
      <interrupt>
        <name>MSPI1</name>
        <description>MSPI1_IRQ</description>
        <value>21</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="MSPI0">
      <name>MSPI2</name>
      <baseAddress>0x40062000</baseAddress>
      <interrupt>
        <name>MSPI2</name>
        <description>MSPI2_IRQ</description>
        <value>22</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>PDM0</name>
      <version>1.0</version>
      <description>PDM Audio</description>
      <!-- <groupName>GROUP_PDM</groupName> -->
      <baseAddress>0x40201000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000254</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PDM0</name>
        <description>PDM0_IRQ</description>
        <value>48</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>PDM Control</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000077</resetMask>

          <fields>
            <field>
              <name>EN</name>
              <description>PDM enable register</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PDM.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PDM.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCMPACK</name>
              <description>Enable PCM packing. Only 24-bit unpacked mode supported.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable PCM packing.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable PCM packing.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSTB</name>
              <description>Reset IP core. 0 puts the core in reset; 1 takes the core out of reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Put the core in reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Core not in reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKSEL</name>
              <description>PDM Master Clock select (24.576MHz).
0: HFRC2_192MHz div8 with HFAdj2
1: XTAL_HS Byapss
2: HFRC_96MHz div4</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CLKEN</name>
              <description>PDM Clock enable.
If multiple clocks are enabled, priority is HFRC2, HF XTAL, HFRC.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable serial clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable serial clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CORECFG0</name>
          <description>PDM to PCM Core Configuration</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x21080F64</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>

          <fields>
            <field>
              <name>PGAR</name>
              <description>Right Channel PGA Gain:
+1.5dB/step, -12dB ~ +34.5dB;</description>
              <bitRange>[30:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M12_0DB</name>
                  <description>Right channel PGA gain = -12.0 dB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M10_5DB</name>
                  <description>Right channel PGA gain = -10.5 dB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M9_0DB</name>
                  <description>Right channel PGA gain = -9.0 dB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_5DB</name>
                  <description>Right channel PGA gain = -7.5 dB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6_0DB</name>
                  <description>Right channel PGA gain = -6.0 dB</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_5DB</name>
                  <description>Right channel PGA gain = -4.5 dB</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_0DB</name>
                  <description>Right channel PGA gain = -3.0 dB</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_5DB</name>
                  <description>Right channel PGA gain = -1.5 dB</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>Right channel PGA gain = 0 DB</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_5DB</name>
                  <description>Right channel PGA gain = 1.5 dB</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_0DB</name>
                  <description>Right channel PGA gain = 3.0 dB</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4_5DB</name>
                  <description>Right channel PGA gain = 4.5 dB</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6_0DB</name>
                  <description>Right channel PGA gain = 6.0 DB</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7_5DB</name>
                  <description>Right channel PGA gain = 7.5 dB</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9_0DB</name>
                  <description>Right channel PGA gain = 9.0 dB</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10_5DB</name>
                  <description>Right channel PGA gain = 10.5 dB</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12_0DB</name>
                  <description>Right channel PGA gain = 12.0 DB</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P13_5DB</name>
                  <description>Right channel PGA gain = 13.5 dB</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15_0DB</name>
                  <description>Right channel PGA gain = 15.0 dB</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P16_5DB</name>
                  <description>Right channel PGA gain = 16.5 dB</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P18_0DB</name>
                  <description>Right channel PGA gain = 18.0 DB</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P19_5DB</name>
                  <description>Right channel PGA gain = 19.5 dB</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P21_0DB</name>
                  <description>Right channel PGA gain = 21.0 dB</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P22_5DB</name>
                  <description>Right channel PGA gain = 22.5 dB</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P24_0DB</name>
                  <description>Right channel PGA gain = 24.0 DB</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P25_5DB</name>
                  <description>Right channel PGA gain = 25.5 dB</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P27_0DB</name>
                  <description>Right channel PGA gain = 27.0 dB</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P28_5DB</name>
                  <description>Right channel PGA gain = 28.5 dB</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30_0DB</name>
                  <description>Right channel PGA gain = 30.0 DB</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P31_5DB</name>
                  <description>Right channel PGA gain = 31.5 dB</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P33_0DB</name>
                  <description>Right channel PGA gain = 33.0 dB</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P34_5DB</name>
                  <description>Right channel PGA gain = 34.5 dB</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PGAL</name>
              <description>Left Channel PGA Gain:
               +1.5dB/step, -12dB ~ +34.5dB;
enum
   name    =   M12_0DB
   value   =   0x0
   desc    =   Left channel PGA gain = -12.0 dB</description>
              <bitRange>[25:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M10_5DB</name>
                  <description>Left channel PGA gain = -10.5 dB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M9_0DB</name>
                  <description>Left channel PGA gain = -9.0 dB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_5DB</name>
                  <description>Left channel PGA gain = -7.5 dB</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M6_0DB</name>
                  <description>Left channel PGA gain = -6.0 dB</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_5DB</name>
                  <description>Left channel PGA gain = -4.5 dB</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M3_0DB</name>
                  <description>Left channel PGA gain = -3.0 dB</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M1_5DB</name>
                  <description>Left channel PGA gain = -1.5 dB</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0DB</name>
                  <description>Left channel PGA gain = 0 DB</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P1_5DB</name>
                  <description>Left channel PGA gain = 1.5 dB</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3_0DB</name>
                  <description>Left channel PGA gain = 3.0 dB</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4_5DB</name>
                  <description>Left channel PGA gain = 4.5 dB</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P6_0DB</name>
                  <description>Left channel PGA gain = 6.0 DB</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P7_5DB</name>
                  <description>Left channel PGA gain = 7.5 dB</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P9_0DB</name>
                  <description>Left channel PGA gain = 9.0 dB</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P10_5DB</name>
                  <description>Left channel PGA gain = 10.5 dB</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P12_0DB</name>
                  <description>Left channel PGA gain = 12.0 DB</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P13_5DB</name>
                  <description>Left channel PGA gain = 13.5 dB</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P15_0DB</name>
                  <description>Left channel PGA gain = 15.0 dB</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P16_5DB</name>
                  <description>Left channel PGA gain = 16.5 dB</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P18_0DB</name>
                  <description>Left channel PGA gain = 18.0 DB</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P19_5DB</name>
                  <description>Left channel PGA gain = 19.5 dB</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P21_0DB</name>
                  <description>Left channel PGA gain = 21.0 dB</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P22_5DB</name>
                  <description>Left channel PGA gain = 22.5 dB</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P24_0DB</name>
                  <description>Left channel PGA gain = 24.0 DB</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P25_5DB</name>
                  <description>Left channel PGA gain = 25.5 dB</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P27_0DB</name>
                  <description>Left channel PGA gain = 27.0 dB</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P28_5DB</name>
                  <description>Left channel PGA gain = 28.5 dB</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P30_0DB</name>
                  <description>Left channel PGA gain = 30.0 DB</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P31_5DB</name>
                  <description>Left channel PGA gain = 31.5 dB</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P33_0DB</name>
                  <description>Left channel PGA gain = 33.0 dB</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P34_5DB</name>
                  <description>Left channel PGA gain = 34.5 dB</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINCRATE</name>
              <description>Sinc decimation rate.
SINC_RATE = OSR /2. OSR = Fsin / Fsout.
Must be even.
16 to 64 allowed.
96 allowed for special configuration.</description>
              <bitRange>[20:14]</bitRange>
              <access>read-write</access>

