AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
          <fields>
            <field>
              <name>PWRSTDBG</name>
              <description>Power Status DBG subsystem</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTUSBPHY</name>
              <description>Power Status USB PHY</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTUSB</name>
              <description>Power Status USB controller</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTSDIO</name>
              <description>Power Status SDIO controller</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTCRYPTO</name>
              <description>Power Status CRYPTO module</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTDISPPHY</name>
              <description>Power Status DISP PHY</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTDISP</name>
              <description>Power Status DISP controller</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTGFX</name>
              <description>Power Status GFX controller</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTMSPI2</name>
              <description>Power Status MSPI Controller2</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTMSPI1</name>
              <description>Power Status MSPI Controller1</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTMSPI0</name>
              <description>Power Status MSPI Controller0</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTADC</name>
              <description>Power Status ADC Digital Controller</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTUART3</name>
              <description>Power Status UART Controller 3</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTUART2</name>
              <description>Power Status UART Controller 2</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTUART1</name>
              <description>Power Status UART Controller 1</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTUART0</name>
              <description>Power Status UART Controller 0</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM7</name>
              <description>Power Status IO Master 7</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM6</name>
              <description>Power Status IO Master 6</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM5</name>
              <description>Power Status IO Master 5</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM4</name>
              <description>Power status IO Master 4</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM3</name>
              <description>Power status IO Master 3</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM2</name>
              <description>Power status IO Master 2</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM1</name>
              <description>Power status IO Master 1</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOM0</name>
              <description>Power status IO Master 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTIOS</name>
              <description>Power status IO Slave</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUDSSPWREN</name>
          <description>This enables various power domains in audio subsystem.</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000CFF</resetMask>

