AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
          <fields>
            <field>
              <name>PWRENDSPA</name>
              <description>Enable one or more DSP subsystems</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENAUDADC</name>
              <description>Power up audio subsystem ADC domain</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up AUDADC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down AUDADC</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENI2S1</name>
              <description>Power up audio subsystem I2S1 domain</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up I2S1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down I2S1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENI2S0</name>
              <description>Power up audio subsystem I2S0 domain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up I2S0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down I2S0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENPDM3</name>
              <description>Power up audio subsystem PDM3 domain</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up PDM3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down PDM3</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENPDM2</name>
              <description>Power up audio subsystem PDM2 domain</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up PDM2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down PDM2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENPDM1</name>
              <description>Power up audio subsystem PDM1 domain</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up PDM1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down PDM1</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENPDM0</name>
              <description>Power up audio subsystem PDM0 domain</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up PDM0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down PDM0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENAUDPB</name>
              <description>Power up Audio Playback</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up AUDPB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down AUDPB</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENAUDREC</name>
              <description>Power up Audio Record</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up AUDREC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down AUDREC</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AUDSSPWRSTATUS</name>
          <description>This provides the power status for the peripheral domains controlled through AUDSSPWREN register. Value of 1 means the device is powred up and ready to be used and 0 means its not powered up.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000CFF</resetMask>

          <fields>
            <field>
              <name>PWRSTDSPA</name>
              <description>Power Status DSPA subsystem</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTAUDADC</name>
              <description>Power Status audio subsystem ADC domain</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTI2S1</name>
              <description>Power Status audio subsystem I2S1 domain</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTI2S0</name>
              <description>Power Status audio subsystem I2S0 domain</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTPDM3</name>
              <description>Power Status audio subsystem PDM3 domain</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTPDM2</name>
              <description>Power Status audio subsystem PDM2 domain</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTPDM1</name>
              <description>Power Status audio subsystem PDM1 domain</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTPDM0</name>
              <description>Power Status audio subsystem PDM0 domain</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTAUDPB</name>
              <description>Power Status Audio Playback block</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRSTAUDREC</name>
              <description>Power Status Audio Record block</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Domain powered on</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Domain powered off</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the MEMRETCFG register. If this register is not set, then power will always be disabled to the memory bank.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>PWRENCACHEB2</name>
              <description>Power up Cache Bank 2. This works in conjunction with Cache enable from flash_cache module. To power up cache bank2, cache has to be enabled and this bit has to be set.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up Cache Bank 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down Cache Bank 2</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENCACHEB0</name>
              <description>Power up Cache Bank 0. This works in conjunction with Cache enable from flash_cache module. To power up cache bank0, cache has to be enabled and this bit has to be set.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up Cache Bank 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down Cache Bank 0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENNVM0</name>
              <description>Power up NVM0</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Power up NVM0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Power down NVM0</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENDTCM</name>
              <description>Power up DTCM</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable power to any DTCMs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM8K</name>
                  <description>Power ON only lower 8k</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM128K</name>
                  <description>Power ON only lower 128k</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCM384K</name>
                  <description>Power ON 384k</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWRSTATUS</name>
          <description>It provides the power status for all the memory banks including- caches, nvm (0 and 1) and all the SRAM groups. The status here should reflect the enable provided by the MEMPWREN register. There may be a lag time between setting the bits in MEMPWREN register and MEMPWRSTATUS register, due to the need to cycle the power gate and isolation seqeunces to the memory banks.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>PWRSTCACHEB2</name>
              <description>This bit is 1 if power is supplied to Cache Bank 2</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

