AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>COREDEEPSLEEP</name>
              <description>Indicates MCU entered DEEPSLEEP state since it was last cleared. Write 1 to to clear it.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CORESLEEP</name>
              <description>Indicates MCU entered SLEEP state since it was last cleared. Write 1 to to clear it.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTDSP1H</name>
              <description>Power Domain status for DSP1H</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTDSP0H</name>
              <description>Power Domain status for DSP0H</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTMCUH</name>
              <description>Power Domain status for MCUH</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTMCUL</name>
              <description>Power Domain status for MCUL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SSRAMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the SSRAMRETCFG register. If this register is not set, then power will always be disabled to the memory bank.</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWRENSSRAM</name>
              <description>Power up SRAM groups</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not power ON any of the SRAM banks</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power ON only SRAM0 group (lower 1M)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power ON only SRAM1 group (upper 1M)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All shared SRAM banks (SSRAM0 1M + SSRAM1 1M) powered ON</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SSRAMPWRST</name>
          <description>It provides the power status for shared sram banks. The status here should reflect the enable provided by the SSRAMPWREN register.</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>SSRAMPWRST</name>
              <description>Each bit corresponds to one 1M SSRAM group.  Power Status- 1:ON, 0:OFF  See SSRAMPWREN PWRENSSRAM for bit mapping. For example, a value of 2 in this field would mean that SSRAM1 is powered up and SSRAM0 is powered down.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SSRAMRETCFG</name>
          <description>This controls the power down of the Shared SRAM banks in deep sleep mode. If this is set, then the power for that SRAM bank will be gated when the core goes into deep sleep. Upon wake, the data within the SRAMs will be erased. If this is not set, retention voltage will be applied to the SRAM bank when none of the CPU agents are in powered up and active mode. Do not set this if the SRAM bank is used as the target for DMA transfer while CPU in deepsleep.</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000003FC</resetValue>
          <resetMask>0x000003FF</resetMask>

          <fields>
            <field>
              <name>SSRAMACTDISP</name>
              <description>Keep the memory domain active based on DISP state. Each bit corresponds to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e. when DISP is powered up)</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SSRAMACTGFX</name>
              <description>Keep the memory domain active based on GFX state. Each bit corresponds to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e. when GFX is powered up)</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SSRAMACTDSP</name>
              <description>Keep the memory domain active based on DSP state. Each bit corresponds to a domain. 1: Keep SRAM active 0: Powerup on demand (i.e. when DSP is powered up)</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>

