AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>SSRAMACTMCU</name>
              <description>Keep the memory domain active based on MCU state. Each bit corresponds to a domain. 1: Keep SRAM active 0: Wakeup on demand (i.e. when MCU is powered up)</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SSRAMPWDSLP</name>
              <description>Selects which shared SRAM banks are powered down in deep sleep mode, causing the contents of the bank to be lost.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>All banks retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0</name>
                  <description>Power down only SRAM group0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1</name>
                  <description>Power down only SRAM group1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>All shared SRAM banks powered down</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DEVPWREVENTEN</name>
          <description>This register controls which feature trigger will result in an event to the CPU. It includes all the power on status for the core domains. If any bits are set, then if the domain is turned on, it will result in an event to the ARM core.</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>AUDEVEN</name>
              <description>Control AUD power-on status event</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable AUD power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable AUD power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSPIEVEN</name>
              <description>Control MSPI power-on status event</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MSPI power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MSPI power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCEVEN</name>
              <description>Control ADC power-on status event</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable ADC power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable ADC power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPCEVEN</name>
              <description>Control HCPC power-on status event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPC power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPC power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPBEVEN</name>
              <description>Control HCPB power-on status event</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPB power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPB power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HCPAEVEN</name>
              <description>Control HCPA power-on status event</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable HCPA power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable HCPA power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCUHEVEN</name>
              <description>Control MCUH power-on status event</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MCHU power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MCUH power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCULEVEN</name>
              <description>Control MCUL power-on status event</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable MCUL power-on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable MCUL power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMPWREVENTEN</name>
          <description>This register controls which power enable for the memories will result in an event to the CPU. It includes all the power on status for the memory domains. If any bits are set, then if the domain is turned on, it will result in an event to the ARM core.</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>CACHEB2EN</name>
              <description>Control CACHEB2 power-on status event</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CACHE BANK 2 status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CACHE BANK 2 status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEB0EN</name>
              <description>Control CACHE BANK 0 power-on status event</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable CACHE BANK 0 status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable CACHE BANK 0 status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVM0EN</name>
              <description>Control NVM power-on status event</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable NVM status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables NVM status event</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCMEN</name>
              <description>Enable DTCM power-on status event</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Do not enable DTCM power-on status event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM0EN</name>
                  <description>Enable GROUP0_DTCM0 power on status event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0DTCM1EN</name>
                  <description>Enable GROUP0_DTCM1 power on status event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP0EN</name>
                  <description>Enable DTCMs in group0 power on status event</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GROUP1EN</name>
                  <description>Enable DTCMs in group1 power on status event</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Enable all DTCM power on status event</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MMSOVERRIDE</name>
          <description>Power domain behavior overrides related to MMS ( Multimedia System ).</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000FFC</resetValue>
          <resetMask>0x00000FFF</resetMask>

          <fields>
            <field>
              <name>MMSOVRSSRAMRETGFX</name>
              <description>If set, retention equation doesn't consider GFX. Each bit corresponds to a domain.</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYSON</name>
                  <description>When PD_GFX is off, retention is always okay for PD_GFX domain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGSTATE</name>
                  <description>When PD_GFX is off, retention is okay based on the state of PD_GFX domain and SSRAMRETCFG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRSSRAMRETDISP</name>
              <description>If set, retention equation doesn't consider DISP. Each bit corresponds to a domain.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYSON</name>
                  <description>When PD_DISP is off, retention is always okay for PD_DISP domain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGSTATE</name>
                  <description>When PD_DISP is off, retention is okay based on the state of PD_DISP domain and SSRAMRETCFG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRDSPRAMRETGFX</name>
              <description>If set, retention equation doesn't consider GFX. Each bit corresponds to a domain.</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYSON</name>
                  <description>When PD_GFX is off, retention is always okay for PD_GFX domain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGSTATE</name>
                  <description>When PD_GFX is off, retention is okay based on the state of PD_GFX domain and DSP[1|0]MEMRETCFG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRDSPRAMRETDISP</name>
              <description>If set, retention equation doesn't consider DISP. Each bit corresponds to a domain.</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYSON</name>
                  <description>When PD_DISP is off, retention is always okay for PD_DISP domain.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PGSTATE</name>
                  <description>When PD_DISP is off, retention is okay based on the state of PD_DISP domain and DSP[1|0]MEMRETCFG.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRSSRAMGFX</name>
              <description>MMS override for SSRAM power state by PD_GFX power setting.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOGFX</name>
                  <description>SSRAM power state is not affected by PD_GFX setting.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_GFX</name>
                  <description>SSRAM power state set by SSRAMPWREN_PWRENSSRAM is overridden by PD_GFX setting.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRSSRAMDISP</name>
              <description>MMS override for SSRAM power state by PD_DISP power setting.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODISP</name>
                  <description>SSRAM power state is not affected by PD_DISP setting.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_DISP</name>
                  <description>SSRAM power state set by SSRAMPWREN_PWRENSSRAM is overridden by PD_DISP setting.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRMCULGFX</name>
              <description>MMS override for MCUL on by PD_GFX setting.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCULON</name>
                  <description>When PD_GFX is on, MCUL is on.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCULOFF</name>
                  <description>When PD_GFX is on, MCUL is still off.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MMSOVRMCULDISP</name>
              <description>MMS override for MCUL on by PD_DISP setting.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCULON</name>
                  <description>When PD_DISP is on, MCUL is on.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCULOFF</name>
                  <description>When PD_DISP is on, MCUL is still off.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP0PWRCTRL</name>
          <description>Power and RST controls for DSP0</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DSP0PCMRSTOR</name>
              <description>PCM Reset override. If this is disabled, then h/w will handle the de-assertion of pcm reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Keep DSP0 PCM in Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Remove DSP0 PCM Reset override</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP0PCMRSTDLY</name>
              <description>PCM Reset delay in number of 24MHz clocks.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

