AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DSP0PERFREQ</name>
          <description>This register provides the performance mode knobs for DSP0. S/w should write the *PERFREQ field to desired mode and wait for the *PERFACK and check for the *PERFSTATUS. Some times system may not allow certain modes but *PERFACK should always follow *PERFREQ change.</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000009</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DSP0PERFSTATUS</name>
              <description>DSP0 Performance mode request</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>DSP0 is in ULP mode (freq=48MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>DSP0 is in LP mode (freq=192MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP</name>
                  <description>DSP0 is in HP mode (freq=384MHz)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP0PERFACK</name>
              <description>Indicates the DSP0 performance status indicated in STATUS register is valid.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP0PERFREQ</name>
              <description>DSP0 Performance mode request</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>DSP0 to be run in ULP mode (freq=48MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>DSP0 to be run in LP mode (freq=192MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP</name>
                  <description>DSP0 to be run in HP mode (freq=384MHz)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP0MEMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the DSP0MEMRETCFG register when DSP0 is OFF.</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWRENDSP0ICACHE</name>
              <description>Power up DSP0 ICACHE banks</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Do not power up ICACHE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power up ICACHE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENDSP0RAM</name>
              <description>Power up DSP0 IRAM and DRAM</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Do not power ON any of the IRAM/DRAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power up all IRAM (128K) and DRAM (256K)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP0MEMPWRST</name>
          <description>It provides the power status for all the memories of DSP0 subsystem</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWRSTDSP0ICACHE</name>
              <description>Power Status- 1:ON, 0:OFF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTDSP0RAM</name>
              <description>Status- 1:ON, 0:OFF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP0MEMRETCFG</name>
          <description>This controls the power down of the DRAM/IRAM/CACHE banks when DSP0 is powered off. If this is set, then the power for that corresponding SRAM bank will be gated when the DSP0 is powered off and data is erased. If this is not set, retention voltage will be applied when DSP0 is powered off. Do not set this if the SRAM bank is used as the target for DMA transfer while DSP0 is powered off.</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DSP0RAMACTGFX</name>
              <description>Keep the memory domain active based on GFX state.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKEONDEMAND</name>
                  <description>Wakeup on demand</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Keep RAMs active irrespective of GFX state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP0RAMACTDISP</name>
              <description>Keep the memory domain active based on DISP state.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKEONDEMAND</name>
                  <description>Wakeup on demand</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Keep RAMs active irrespective of DISP state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHEPWDDSP0OFF</name>
              <description>ICACHE is powered down when DSP0 is switched off, causing the contents of the bank to be lost.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RET</name>
                  <description>ICACHE retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWD</name>
                  <description>Power down ICACHE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP0RAMACTMCU</name>
              <description>Keep the memory domain active based on MCU state.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKEONDEMAND</name>
                  <description>Wakeup on demand</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Keep RAMs active irrespective of MCU state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMPWDDSP0OFF</name>
              <description>IRAM/DRAM banks are powered down when DSP0 is switched off, causing the contents of the bank to be lost.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RET</name>
                  <description>IRAM and DRAM retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWD</name>
                  <description>Power down all IRAM and DRAM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1PWRCTRL</name>
          <description>Power and RST controls for DSP1</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000008</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DSP1PCMRSTOR</name>
              <description>PCM Reset override. If this is disabled, then h/w will handle the de-assertion of pcm reset.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Keep DSP1 PCM in Reset</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Remove DSP1 PCM Reset override</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP1PCMRSTDLY</name>
              <description>PCM Reset delay in number of 24MHz clocks.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

