AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1PERFREQ</name>
          <description>This register provides the performance mode knobs for DSP1. S/w should write the *PERFREQ field to desired mode and wait for the *PERFACK and check for the *PERFSTATUS. Some times system may not allow certain modes but *PERFACK should always follow *PERFREQ change.</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000009</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DSP1PERFSTATUS</name>
              <description>DSP1 Performance mode request</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>DSP1 is in ULP mode (freq=48MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>DSP1 is in LP mode (freq=192MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP</name>
                  <description>DSP1 is in HP mode (freq=384MHz)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP1PERFACK</name>
              <description>Indicates the DSP1 performance status indicated in STATUS register is valid.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1PERFREQ</name>
              <description>DSP1 Performance mode request</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ULP</name>
                  <description>DSP1 to be run in ULP mode (freq=48MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LP</name>
                  <description>DSP1 to be run in LP mode (freq=192MHz)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HP</name>
                  <description>DSP1 to be run in HP mode (freq=384MHz)</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1MEMPWREN</name>
          <description>This register enables the individual banks for the memories. When set, power will be enabled to the banks. This register works in conjunction with the DSP1MEMRETCFG register when DSP1 is OFF.</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWRENDSP1ICACHE</name>
              <description>Power up DSP1 ICACHE banks</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Do not power up ICACHE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power up ICACHE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRENDSP1RAM</name>
              <description>Power up DSP1 IRAM and DRAM</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Do not power ON any of the IRAM/DRAM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ON</name>
                  <description>Power up all IRAM (32K) and DRAM (64K)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1MEMPWRST</name>
          <description>It provides the power status for all the memories of DSP1 subsystem</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWRSTDSP1ICACHE</name>
              <description>Power Status- 1:ON, 0:OFF</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PWRSTDSP1RAM</name>
              <description>Status- 1:ON, 0:OFF</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1MEMRETCFG</name>
          <description>This controls the power down of the DRAM/IRAM/CACHE banks when DSP1 is powered off. If this is set, then the power for that corresponding SRAM bank will be gated when the DSP1 is powered off and data is erased. If this is not set, retention voltage will be applied when DSP1 is powered off. Do not set this if the SRAM bank is used as the target for DMA transfer while DSP1 is powered off.</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>DSP1RAMACTGFX</name>
              <description>Keep the memory domain active based on GFX state.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKEONDEMAND</name>
                  <description>Wakeup on demand</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Keep RAMs active irrespective of GFX state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP1RAMACTDISP</name>
              <description>Keep the memory domain active based on DISP state.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKEONDEMAND</name>
                  <description>Wakeup on demand</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Keep RAMs active irrespective of DISP state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICACHEPWDDSP1OFF</name>
              <description>ICACHE is powered down when DSP1 is switched off, causing the contents of the bank to be lost.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RET</name>
                  <description>ICACHE retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWD</name>
                  <description>Power down ICACHE</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSP1RAMACTMCU</name>
              <description>Keep the memory domain active based on MCU state.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WAKEONDEMAND</name>
                  <description>Wakeup on demand</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACT</name>
                  <description>Keep RAMs active irrespective of MCU state</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMPWDDSP1OFF</name>
              <description>IRAM/DRAM banks are powered down when DSP1 is switched off, causing the contents of the bank to be lost.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RET</name>
                  <description>IRAM and DRAM retained</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWD</name>
                  <description>Power down all IRAM and DRAM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRACKOVR</name>
          <description>This register contains override bit fields for various power domain power switch acknowledge notification. As a part of power up sequnce, Power controller will look for power switch ack to advance power up sequence. It is possible for power controller to be a forever wait state in case of a unforeseen HW bug. This register defines a bit fileds to work around if needed in such a situation.  The default behavior is to use HW power switch ack. Software can set it to override this feature for each power switch.</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>

