AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
          <fields>
            <field>
              <name>PWRACKOVERRIDEDSPA</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEUSBPHY</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEUSB</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDESDIO</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEMSPI</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEMCUL</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEIOS</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEHCPC</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEHCPB</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEHCPA</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEGFX</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEDISPPHY</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEDISP</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEDBG</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDECRYPTO</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEAUDADC</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEAUD</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRACKOVERRIDEADC</name>
              <description>Power switch acknowledgement override from Power switch to power control ST MC</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Hardware generates Power switch ack</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWOVRRIDE</name>
                  <description>Software override or defeaure mode. Will bypass HW generated power ack</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCNTDEFVAL</name>
          <description>This register contains programmble dealy values for various state michines.  Fields contain dev st machine default value, SIMOBUCK state machine wait delay counter etc.</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000208</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>PWRACKWAITDELSIMOSTMC</name>
              <description>Default counter max for buck ST MC</description>
              <bitRange>[15:6]</bitRange>
              <access>read-write</access>

