AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>WTULPAUDREC</name>
              <description>Weight used for ULP mode AUDREC</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPDBG</name>
              <description>Weight used for ULP mode DBG</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPDSPA</name>
              <description>Weight used for ULP mode DSPA</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTULP4</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF00FF</resetMask>

          <fields>
            <field>
              <name>WTULPPDM3</name>
              <description>Weight used for ULP mode PDM3</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPPDM2</name>
              <description>Weight used for ULP mode PDM2</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPPDM1</name>
              <description>Weight used for ULP mode PDM1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPPDM0</name>
              <description>Weight used for ULP mode PDM0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPI2S1</name>
              <description>Weight used for ULP mode I2S1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPI2S0</name>
              <description>Weight used for ULP mode I2S0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTULP5</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000154</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>WTULPUSBPHY</name>
              <description>Weight used for ULP mode USB PHY</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTULPDISPPHY</name>
              <description>Weight used for ULP mode DISP PHY</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTLP0</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000158</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTLPUART3</name>
              <description>Weight used for LP mode UART3</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPUART2</name>
              <description>Weight used for LP mode UART2</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPUART1</name>
              <description>Weight used for LP mode UART1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPUART0</name>
              <description>Weight used for LP mode UART0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOS</name>
              <description>Weight used for LP mode IOS</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPDSP1</name>
              <description>Weight used for LP mode DSP1</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPDSP0</name>
              <description>Weight used for LP mode DSP0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPMCU</name>
              <description>Weight used for LP mode MCU</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

