AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTLP1</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x0000015C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTLPIOM7</name>
              <description>Weight used for LP mode IOM7</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOM6</name>
              <description>Weight used for LP mode IOM6</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOM5</name>
              <description>Weight used for LP mode IOM5</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOM4</name>
              <description>Weight used for LP mode IOM4</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOM3</name>
              <description>Weight used for LP mode IOM3</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOM2</name>
              <description>Weight used for LP mode IOM2</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOM1</name>
              <description>Weight used for LP mode IOM1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPIOM0</name>
              <description>Weight used for LP mode IOM0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTLP2</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>WTLPUSB</name>
              <description>Weight used for LP mode USB</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPSDIO</name>
              <description>Weight used for LP mode SDIO</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPCRYPTO</name>
              <description>Weight used for LP mode CRYPTO</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPDISP</name>
              <description>Weight used for LP mode DISP</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPGFX</name>
              <description>Weight used for LP mode GFX</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPMSPI1</name>
              <description>Weight used for LP mode MSPI1</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPMSPI0</name>
              <description>Weight used for LP mode MSPI0</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPADC</name>
              <description>Weight used for LP mode ADC</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTLP3</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000164</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xF00FFFFF</resetMask>

          <fields>
            <field>
              <name>WTLPMSPI2</name>
              <description>Weight used for LP mode MSPI2</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPAUDADC</name>
              <description>Weight used for LP mode AUDADC</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTLPAUDPB</name>
              <description>Weight used for LP mode AUDPB</description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>

