AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>WTHPAUDREC</name>
              <description>Weight used for HP mode AUDREC</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPDBG</name>
              <description>Weight used for HP mode DBG</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPDSPA</name>
              <description>Weight used for HP mode DSPA</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTHP4</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF00FF</resetMask>

          <fields>
            <field>
              <name>WTHPPDM3</name>
              <description>Weight used for HP mode PDM3</description>
              <bitRange>[31:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPPDM2</name>
              <description>Weight used for HP mode PDM2</description>
              <bitRange>[27:24]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPPDM1</name>
              <description>Weight used for HP mode PDM1</description>
              <bitRange>[23:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPPDM0</name>
              <description>Weight used for HP mode PDM0</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPI2S1</name>
              <description>Weight used for HP mode I2S1</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPI2S0</name>
              <description>Weight used for HP mode I2S0</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTHP5</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>WTHPUSBPHY</name>
              <description>Weight used for HP mode USB PHY</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WTHPDISPPHY</name>
              <description>Weight used for HP mode DISP PHY</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PWRWEIGHTSLP</name>
          <description>Weights specified in this register are applied to each of the masters active requests. The aggregate of all the masters is compared against the allowed value to change the buck from active to inactive mode.</description>
          <addressOffset>0x00000188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>

          <fields>
            <field>
              <name>WTDSMCU</name>
              <description>Weight used for Deep Sleep mode MCU</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>VRDEMOTIONTHR</name>
          <description>Weights specified in PWRWEIGHT* registers are applied to each of the masters active requests. The aggregate of all the masters is compared against the this threshold value to change the buck from active to inactive mode.</description>
          <addressOffset>0x0000018C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>VRDEMOTIONTHR</name>
              <description>VR Demotion Threshold</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>This register provides additional fine-tune power management controls for the SRAMs and the SRAM controller. This includes enabling light sleep for the SRAM and TCM banks, and clock gating for reduced dynamic power.</description>
          <addressOffset>0x00000190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000FFF06</resetMask>

          <fields>
            <field>
              <name>SRAMLIGHTSLEEP</name>
              <description>Light Sleep enable for each TCM/SRAM bank. When 1, corresponding bank will be put into light sleep. For optimal power, banks should be put into light sleep while the system is active but the bank has minimal or no accesses.</description>
              <bitRange>[19:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL</name>
                  <description>Enable LIGHT SLEEP for ALL SRAMs</description>
                  <value>4095</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables LIGHT SLEEP for ALL SRAMs</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMMASTERCLKGATE</name>
              <description>This bit is 1 when the master clock gate is enabled (top-level clock gate for entire SRAM block)</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Master SRAM Clock Gate</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Master SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SRAMCLKGATE</name>
              <description>This bit is 1 if clock gating is allowed for individual system SRAMs</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Enable Individual SRAM Clock Gating</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disables Individual SRAM Clock Gating</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCSTATUS</name>
          <description>This provides the power status for various blocks within the ADC. These status comes directly from the ADC module and is captured through this interface.</description>
          <addressOffset>0x00000194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>REFBUFPWD</name>
              <description>This bit indicates that the ADC REFBUF is powered down</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

