AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>BODDIGS</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGF</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGC</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>BODDIGCLV</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC_LV</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGS</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGF</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGC</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>BODDIGCLV</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC_LV</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGS</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGF</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGC</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODH</name>
              <description>Enables an interrupt that triggers when VCC is below BODH level.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>

          <fields>
            <field>
              <name>BODDIGCLV</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDC_LV</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGS</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDS</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BODDIGF</name>
              <description>Enables an interrupt that triggers when simobuck digital detects inactivity on VDDF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

