AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>MAXIMUM1</name>
          <description>Maximum current capabilities</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>

          <fields>
            <field>
              <name>MAXCURR18V</name>
              <description>Maximum Current for 1.8V. The current value is specified as MAXCURR18V * 4mA. Some example enums follow:</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1020mA</name>
                  <description>1020mA = 255 * 4mA</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>1020mA, 255 * 4mA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXCURR30V</name>
              <description>Maximum Current for 3.0V. The current value is specified as MAXCURR18V * 4mA. Some example enums follow:</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1020mA</name>
                  <description>1020mA = 255 * 4mA</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>1020mA, 255 * 4mA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXCURR33V</name>
              <description>Maximum Current for 3.3V. The current value is specified as MAXCURR18V * 4mA. Some example enums follow:</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1020mA</name>
                  <description>1020mA = 255 * 4mA</description>
                  <value>255</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4mA</name>
                  <description>1020mA, 255 * 4mA</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FORCE</name>
          <description>Force event register for error interrupt status</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FF009F</resetMask>

          <fields>
            <field>
              <name>FORCEADMAERR</name>
              <description>Force event for ADMA error</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEACMDERR</name>
              <description>Force Event for Auto CMD Error</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCECURRLIMITERR</name>
              <description>Force Event for Current Limit Error</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEDATAENDERR</name>
              <description>Force Event for Data End Bit Error</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEDATACRCERR</name>
              <description>Force Event for Data CRC Error</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEDATATOERR</name>
              <description>Force Event for Data Timeout Error</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCECMDIDXERR</name>
              <description>Force Event for Command Index Error</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCECMDENDERR</name>
              <description>Force Event for Command End Bit Error</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCECMDCRCERR</name>
              <description>Force Event for Command CRC Error</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCECMDTOERR</name>
              <description>Force Event for Command Timeout Error</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>No interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEACMDISSUEDERR</name>
              <description>1 - Interrupt is generated</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>no interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEACMDIDXERR</name>
              <description>Desc</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>no interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEACMDENDERR</name>
              <description>Description</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>no interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEACMDCRCERR</name>
              <description>Description</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>no interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEACMDTOERR</name>
              <description>Description</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>no interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FORCEACMD12NOT</name>
              <description>Description</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INT</name>
                  <description>Interrupt is generated</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOINT</name>
                  <description>no interrupt</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMA</name>
          <description>ADMA error status</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>

          <fields>
            <field>
              <name>ADMALENMISMATCHERR</name>
              <description>This error occurs in the following 2 cases. While Block Count Enable being set, the total data length specified by the Descriptor table is different from that specified by the Block Count and Block Length. Total data length can not be divided by the block length.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>Error</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOERROR</name>
                  <description>No error</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADMAERRORSTATE</name>
              <description>This field indicates the state of ADMA when error is occurred during ADMA data transfer. This field never indicates 10 because ADMA never stops in this state. D01 - D00 : ADMA Error State when error occurred Contents of SYS_SDR register</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STDMA</name>
                  <description>ST_STOP (Stop DMA) Points to next of the error descriptor</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FETCHDESC</name>
                  <description>ST_FDS (Fetch Descriptor) Points to the error descriptor</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID</name>
                  <description>Never set this state (Not used)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XFERDATA</name>
                  <description>ST_TFR (Transfer Data) Points to the next of the error descriptor</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADMALOWD</name>
          <description>ADMA system address [31:0]</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>LOWD</name>
              <description>This register holds byte address of executing command of the Descriptor table. 32-bit Address Descriptor uses lower 32bit of this register. At the start of ADMA, the Host Driver shall set start address of the Descriptor table. The ADMA increments this register address, which points to next line, when every fetching a Descriptor line. When the ADMA Error Interrupt is generated, this register shall hold valid Descriptor address depending on the ADMA state. The Host Driver shall program Descriptor Table on 32-bit boundary and set 32-bit boundary address to this register. ADMA2 ignores lower 2-bit of this register and assumes it to be 00b. 32-bit Address ADMA Register Value 32bit System Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

