AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>ADMAHIWD</name>
          <description>ADMA system address [63:0]</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>HIWD</name>
              <description>This register holds byte address of executing command of the Descriptor table. 32-bit Address Descriptor uses lower 32bit of this register. At the start of ADMA, the Host Driver shall set start address of the Descriptor table. The ADMA increments this register address, which points to next line, when every fetching a Descriptor line. When the ADMA Error Interrupt is generated, this register shall hold valid Descriptor address depending on the ADMA state. The Host Driver shall program Descriptor Table on 32-bit boundary and set 32-bit boundary address to this register. ADMA2 ignores lower 2-bit of this register and assumes it to be 00b. 32-bit Address ADMA Register Value 32bit System Address</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>PRESET0</name>
          <description>Preset Value initialization and default speed</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xC7FFC7FF</resetMask>

          <fields>
            <field>
              <name>DEFSPDRVRSTRSEL</name>
              <description>Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling.</description>
              <bitRange>[31:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is Selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is Selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is Selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is Selected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEFSPCLKGENSEL</name>
              <description>This bit is effective when Host Controller supports programmable clock generator.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGCLK</name>
                  <description>Programmable Clock Generator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCTLR</name>
                  <description>Host Controller Ver2.00 Compatible Clock Generator</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DEFSPSDCLKFREQSEL</name>
              <description>10 bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. When Host Controller supports shared bus, a set of Preset Value registers for each device required and the registers location are duplicated to the offset 06Fh-060h. A set of Preset Value registers can be accessible by selecting Clock Pin Select in the Shared Bus Control register</description>
              <bitRange>[25:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>HISPDRVRSTRSEL</name>
              <description>Driver Strength is supported by 1.8V signaling bus speed modes. This field is meaningless for 3.3V signaling.</description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TYPED</name>
                  <description>Driver Type D is Selected</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEC</name>
                  <description>Driver Type C is Selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEA</name>
                  <description>Driver Type A is Selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TYPEB</name>
                  <description>Driver Type B is Selected</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HISPCLKGENSEL</name>
              <description>This bit is effective when Host Controller supports programmable clock generator.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PROGCLK</name>
                  <description>Programmable Clock Generator</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HOSTCTLR</name>
                  <description>Host Controller Ver2.00 Compatible Clock Generator</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HISPSDCLKFREQSEL</name>
              <description>10 bit preset value to set SDCLK Frequency Select in the Clock Control Register is described by a host system. When Host Controller supports shared bus, a set of Preset Value registers for each device required and the registers location are duplicated to the offset 06Fh-060h. A set of Preset Value registers can be accessible by selecting Clock Pin Select in the Shared Bus Control register</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>

