AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SRCADDR</name>
          <description>Source Addresss</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>ADDR</name>
              <description>Source Buffer Address. Address may be byte aligned, but the length must be a multiple of 4 bits.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LEN</name>
          <description>Length</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFC</resetMask>

          <fields>
            <field>
              <name>LEN</name>
              <description>Buffer size (bottom two bits assumed to be zero to ensure a multiple of 4 bytes)</description>
              <bitRange>[23:2]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>CRC Seed/Result</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>CRC</name>
              <description>CRC Seed/Result. Software must seed the CRC with 0xFFFFFFFF before starting a CRC operation (unless the CRC is continued from a previous operation).</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LOCKCTRL</name>
          <description>LOCK Control</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SELECT</name>
              <description>LOCK Function Select register.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK01</name>
                  <description>Enable customer OTP program.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK02</name>
                  <description>Enable customer OTP read.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK11</name>
                  <description>Enable Ambiq OTP program.</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK12</name>
                  <description>Enable Ambiq OTP read.</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK9D</name>
                  <description>Enable Bootloader Recovery.</description>
                  <value>157</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK9E</name>
                  <description>Enable Bootloader info1.</description>
                  <value>158</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset all.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LOCKSTAT</name>
          <description>LOCK Status</description>
          <addressOffset>0x0000007C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>STATUS</name>
              <description>Lock status. Bit is high to signify it is enabled. 0: LOCK01, 1: LOCK02, 4: LOCK11, 5: LOCK12, 30: LOCK9D, 31: LOCK9E</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOCK01</name>
                  <description>Enabled customer OTP program.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK02</name>
                  <description>Enabled customer OTP read.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK11</name>
                  <description>Enabled Ambiq OTP program.</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK12</name>
                  <description>Enabled Ambiq OTP read.</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK9D</name>
                  <description>Enabled Bootloader Recovery.</description>
                  <value>1073741824</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOCK9E</name>
                  <description>Enabled Bootloader info1.</description>
                  <value>2147483648</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>All Reset.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY0</name>
          <description>Key0</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>KEY0</name>
              <description>Bits [31:0] of the 128-bit key should be written to this register. To protect key values, the register always returns 0x00000000.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>

