AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>SCAPCTRL0</name>
          <description>The STIMER Capture Control Register controls each of the 4 capture registers. It selects their GPIO pin number for a trigger source, enables a capture operation and sets the input polarity for the capture. NOTE: 8-bit writes can control individual capture registers atomically.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000037F</resetMask>

          <fields>
            <field>
              <name>CAPTURE0</name>
              <description>Selects whether capture 0 is enabled for the specified capture register.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Capture function disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Capture function enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STPOL0</name>
              <description>STIMER Capture 0 Polarity.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL0</name>
              <description>STIMER Capture 0 Select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCAPCTRL1</name>
          <description>The STIMER Capture Control Register controls each of the 4 capture registers. It selects their GPIO pin number for a trigger source, enables a capture operation and sets the input polarity for the capture. NOTE: 8-bit writes can control individual capture registers atomically.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000037F</resetMask>

          <fields>
            <field>
              <name>CAPTURE1</name>
              <description>Selects whether capture 1 is enabled for the specified capture register.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Capture function disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Capture function enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STPOL1</name>
              <description>STIMER Capture 1 Polarity.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL1</name>
              <description>STIMER Capture 1 Select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SCAPCTRL2</name>
          <description>The STIMER Capture Control Register controls each of the 4 capture registers. It selects their GPIO pin number for a trigger source, enables a capture operation and sets the input polarity for the capture. NOTE: 8-bit writes can control individual capture registers atomically.</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x0000037F</resetMask>

          <fields>
            <field>
              <name>CAPTURE2</name>
              <description>Selects whether capture 2 is enabled for the specified capture register.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Capture function disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Capture function enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STPOL2</name>
              <description>STIMER Capture 2 Polarity.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPLH</name>
                  <description>Capture on low to high GPIO transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPHL</name>
                  <description>Capture on high to low GPIO transition</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STSEL2</name>
              <description>STIMER Capture 2 Select.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

