AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
          <fields>
            <field>
              <name>CAPTURED</name>
              <description>CAPTURE register D has grabbed the value in the counter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPD_INT</name>
                  <description>Capture D interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPD_DEFAULT</name>
                  <description>Capture D interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREC</name>
              <description>CAPTURE register C has grabbed the value in the counter</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPC_INT</name>
                  <description>CAPTURE C interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPC_DEFAULT</name>
                  <description>CAPTURE C interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREB</name>
              <description>CAPTURE register B has grabbed the value in the counter</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPB_INT</name>
                  <description>CAPTURE B interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPB_DEFAULT</name>
                  <description>CAPTURE B interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREA</name>
              <description>CAPTURE register A has grabbed the value in the counter</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPA_INT</name>
                  <description>CAPTURE A interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPA_DEFAULT</name>
                  <description>CAPTURE A interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERFLOW</name>
              <description>COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFLOW_INT</name>
                  <description>Overflow interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFLOW_DEFAULT</name>
                  <description>Overflow interrupt status bit default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREH</name>
              <description>COUNTER is greater than or equal to COMPARE register H.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREG</name>
              <description>COUNTER is greater than or equal to COMPARE register G.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREF</name>
              <description>COUNTER is greater than or equal to COMPARE register F.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREE</name>
              <description>COUNTER is greater than or equal to COMPARE register E.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARED</name>
              <description>COUNTER is greater than or equal to COMPARE register D.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREC</name>
              <description>COUNTER is greater than or equal to COMPARE register C.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREB</name>
              <description>COUNTER is greater than or equal to COMPARE register B.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREA</name>
              <description>COUNTER is greater than or equal to COMPARE register A.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STMINTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

          <fields>
            <field>
              <name>CAPTURED</name>
              <description>CAPTURE register D has grabbed the value in the counter</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPD_INT</name>
                  <description>Capture D interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPD_DEFAULT</name>
                  <description>Capture D interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREC</name>
              <description>CAPTURE register C has grabbed the value in the counter</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPC_INT</name>
                  <description>CAPTURE C interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPC_DEFAULT</name>
                  <description>CAPTURE C interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREB</name>
              <description>CAPTURE register B has grabbed the value in the counter</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPB_INT</name>
                  <description>CAPTURE B interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPB_DEFAULT</name>
                  <description>CAPTURE B interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAPTUREA</name>
              <description>CAPTURE register A has grabbed the value in the counter</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CAPA_INT</name>
                  <description>CAPTURE A interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPA_DEFAULT</name>
                  <description>CAPTURE A interrupt status default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERFLOW</name>
              <description>COUNTER over flowed from 0xFFFFFFFF back to 0x00000000.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFLOW_INT</name>
                  <description>Overflow interrupt status bit was set.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFLOW_DEFAULT</name>
                  <description>Overflow interrupt status bit default/not set.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREH</name>
              <description>COUNTER is greater than or equal to COMPARE register H.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREG</name>
              <description>COUNTER is greater than or equal to COMPARE register G.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREF</name>
              <description>COUNTER is greater than or equal to COMPARE register F.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREE</name>
              <description>COUNTER is greater than or equal to COMPARE register E.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPARED</name>
              <description>COUNTER is greater than or equal to COMPARE register D.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREC</name>
              <description>COUNTER is greater than or equal to COMPARE register C.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREB</name>
              <description>COUNTER is greater than or equal to COMPARE register B.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPAREA</name>
              <description>COUNTER is greater than or equal to COMPARE register A.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARED</name>
                  <description>COUNTER greater than or equal to COMPARE register.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>COUNTER less than COMPARE register.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STMINTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>

