AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
      </registers>
    </peripheral>

    <peripheral>
      <name>TIMER</name>
      <version>1.0</version>
      <description>Counter/Timer</description>
      <!-- <groupName>GROUP_TIMER</groupName> -->
      <baseAddress>0x40008000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x000003FC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIMER</name>
        <description>TIMER_IRQ</description>
        <value>14</value>
      </interrupt>      <interrupt>
        <name>TIMER0</name>
        <description>TIMER0_IRQ</description>
        <value>67</value>
      </interrupt>      <interrupt>
        <name>TIMER1</name>
        <description>TIMER1_IRQ</description>
        <value>68</value>
      </interrupt>      <interrupt>
        <name>TIMER2</name>
        <description>TIMER2_IRQ</description>
        <value>69</value>
      </interrupt>      <interrupt>
        <name>TIMER3</name>
        <description>TIMER3_IRQ</description>
        <value>70</value>
      </interrupt>      <interrupt>
        <name>TIMER4</name>
        <description>TIMER4_IRQ</description>
        <value>71</value>
      </interrupt>      <interrupt>
        <name>TIMER5</name>
        <description>TIMER5_IRQ</description>
        <value>72</value>
      </interrupt>      <interrupt>
        <name>TIMER6</name>
        <description>TIMER6_IRQ</description>
        <value>73</value>
      </interrupt>      <interrupt>
        <name>TIMER7</name>
        <description>TIMER7_IRQ</description>
        <value>74</value>
      </interrupt>      <interrupt>
        <name>TIMER8</name>
        <description>TIMER8_IRQ</description>
        <value>75</value>
      </interrupt>      <interrupt>
        <name>TIMER9</name>
        <description>TIMER9_IRQ</description>
        <value>76</value>
      </interrupt>      <interrupt>
        <name>TIMER10</name>
        <description>TIMER10_IRQ</description>
        <value>77</value>
      </interrupt>      <interrupt>
        <name>TIMER11</name>
        <description>TIMER11_IRQ</description>
        <value>78</value>
      </interrupt>      <interrupt>
        <name>TIMER12</name>
        <description>TIMER12_IRQ</description>
        <value>79</value>
      </interrupt>      <interrupt>
        <name>TIMER13</name>
        <description>TIMER13_IRQ</description>
        <value>80</value>
      </interrupt>      <interrupt>
        <name>TIMER14</name>
        <description>TIMER14_IRQ</description>
        <value>81</value>
      </interrupt>      <interrupt>
        <name>TIMER15</name>
        <description>TIMER15_IRQ</description>
        <value>82</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>General Timer Controls</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000000</resetMask>

          <fields>
            <field>
              <name>RESET</name>
              <description>Write to 1 to reset all timers (self-clearing)</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>General Timer status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00100000</resetValue>
          <resetMask>0x001FFFFF</resetMask>

          <fields>
            <field>
              <name>NTIMERS</name>
              <description>Indicates the number of timer blocks present in the design</description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>ACTIVE</name>
              <description>Indicates which timers are currnetly active (enabled)</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>GLOBEN</name>
          <description>Alternate enables for all TIMERs.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xE000FFFF</resetMask>

          <fields>
            <field>
              <name>ADCEN</name>
              <description>ADC controls enable for timer 7</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMREN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER .</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUDADCEN</name>
              <description>Audio ADC controls enable for timer 6</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMREN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER .</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLEALLINPUTS</name>
              <description>Override to enable all GPIO inputs</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Override to enable all inputs from GPIO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Normal mode where inputs from GPIO are enabled based on enabled clock and triggers.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB15</name>
              <description>Alternate enable for timer 15</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR15EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 15.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB14</name>
              <description>Alternate enable for timer 14</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR14EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 14.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB13</name>
              <description>Alternate enable for timer 13</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR13EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 13.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB12</name>
              <description>Alternate enable for timer 12</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR12EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 12.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB11</name>
              <description>Alternate enable for timer 11</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR11EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 11.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB10</name>
              <description>Alternate enable for timer 10</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR10EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 10.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB9</name>
              <description>Alternate enable for timer 9</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR9EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 9.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB8</name>
              <description>Alternate enable for timer 8</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR8EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 8.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB7</name>
              <description>Alternate enable for timer 7</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR7EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 7.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB6</name>
              <description>Alternate enable for timer 6</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR6EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 6.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB5</name>
              <description>Alternate enable for timer 5</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR5EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 5.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB4</name>
              <description>Alternate enable for timer 4</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR4EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 4.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB3</name>
              <description>Alternate enable for timer 3</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR3EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 3.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB2</name>
              <description>Alternate enable for timer 2</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR2EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 2.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB1</name>
              <description>Alternate enable for timer 1</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR1EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 1.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENB0</name>
              <description>Alternate enable for timer 0</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Timer Enabled. TMR0EN enable is used.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Disable TIMER 0.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TMR151INT</name>
              <description>Counter/Timer 15 interrupt based on CMP1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

