AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>TMR70INT</name>
              <description>Counter/Timer 7 interrupt based on CMP0.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR61INT</name>
              <description>Counter/Timer 6 interrupt based on CMP1.</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR60INT</name>
              <description>Counter/Timer 6 interrupt based on CMP0.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR51INT</name>
              <description>Counter/Timer 5 interrupt based on CMP1.</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR50INT</name>
              <description>Counter/Timer 5 interrupt based on CMP0.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR41INT</name>
              <description>Counter/Timer 4 interrupt based on CMP1.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR40INT</name>
              <description>Counter/Timer 4 interrupt based on CMP0.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR31INT</name>
              <description>Counter/Timer 3 interrupt based on CMP1.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR30INT</name>
              <description>Counter/Timer 3 interrupt based on CMP0.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR21INT</name>
              <description>Counter/Timer 2 interrupt based on CMP1.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR20INT</name>
              <description>Counter/Timer 2 interrupt based on CMP0.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR11INT</name>
              <description>Counter/Timer 1 interrupt based on CMP1.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR10INT</name>
              <description>Counter/Timer 1 interrupt based on CMP0.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR01INT</name>
              <description>Counter/Timer 0 interrupt based on CMP1.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR00INT</name>
              <description>Counter/Timer 0 interrupt based on CMP0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000068</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>TMR151INT</name>
              <description>Counter/Timer 15 interrupt based on CMP1.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR150INT</name>
              <description>Counter/Timer 15 interrupt based on CMP0.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR141INT</name>
              <description>Counter/Timer 14 interrupt based on CMP1.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR140INT</name>
              <description>Counter/Timer 14 interrupt based on CMP0.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR131INT</name>
              <description>Counter/Timer 13 interrupt based on CMP1.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR130INT</name>
              <description>Counter/Timer 13 interrupt based on CMP0.</description>
              <bitRange>[26:26]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR121INT</name>
              <description>Counter/Timer 12 interrupt based on CMP1.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TMR120INT</name>
              <description>Counter/Timer 12 interrupt based on CMP0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

