AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IBRD</name>
          <description>Integer Baud Rate Divisor</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>DIVINT</name>
              <description>This field holds the integer baud rate divisor. It is set in conjunction with the DIVFRAC field in the FBRD register and the clock rate as set in the CLKSEL field of the CR register. The field should be set to the integer part of the ratio: Clock Rate / (16 x intended baud rate).</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>FBRD</name>
          <description>Fractional Baud Rate Divisor</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>

          <fields>
            <field>
              <name>DIVFRAC</name>
              <description>This field holds the fractional baud rate divisor. It is set in conjunction with the DIVINT field in the IBRD register and the clock rate as set in the CLKSEL field of the CR register. The field should be set to the rounded value of 64 x the fractional part of the ratio: Clock Rate / (16 x intended baud rate).</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>LCRH</name>
          <description>Line Control High</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>SPS</name>
              <description>This bit holds the stick parity select. If the EPS bit is 0 then the parity bit is transmitted and checked as a 1. If the EPS bit is 1 then the parity bit is transmitted and checked as a 0. This bit has no effect when the PEN bit disables parity checking and generation.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WLEN</name>
              <description>These bits hold the write length. These bits indicate the number of data bits transmitted or received in a frame as follows: b11 = 8 bits, b10 = 7 bits, b01 = 6 bits, b00 = 5 bits.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEN</name>
              <description>This bit holds the FIFO enable. 0 = FIFOs are disabled (character mode) that is, the FIFOs become 1-byte-deep holding registers. 1 = transmit and receive FIFO buffers are enabled (FIFO mode).</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>STP2</name>
              <description>This bit holds the two stop bits select. If this bit is set to 1, two stop bits are transmitted at the end of the frame. The receive logic does not check for two stop bits being received.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EPS</name>
              <description>This bit holds the even parity select. Controls the type of parity the UART uses during transmission and reception: 0 = odd parity. The UART generates or checks for an odd number of 1s in the data and parity bits. 1 = even parity. The UART generates or checks for an even number of 1s in the data and parity bits. This bit has no effect when the PEN bit disables parity checking and generation.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEN</name>
              <description>This bit holds the parity enable. 0 = parity is disabled and no parity bit added to the data frame. 1 = parity checking and generation is enabled.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BRK</name>
              <description>This bit holds the break set. If this bit is set to 1, a low-level is continually output on the UARTTXD output, after completing transmission of the current character. For the proper execution of the break command, the software must set this bit for at least two complete frames. For normal use, this bit must be cleared to 0.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Control</description>
          <addressOffset>0x00000030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000300</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CTSEN</name>
              <description>This bit enables CTS hardware flow control. If this bit is set to 1, CTS hardware flow control is enabled. Data is only transmitted when the nUARTCTS signal is asserted.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTSEN</name>
              <description>This bit enables RTS hardware flow control. If this bit is set to 1, RTS hardware flow control is enabled. Data is only requested when there is space in the receive FIFO for it to be received.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

