AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>TXCMPMMIS</name>
              <description>This bit holds the modem TXCMP interrupt status masked.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IEC</name>
          <description>Interrupt Clear</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>

          <fields>
            <field>
              <name>OEIC</name>
              <description>This bit holds the overrun interrupt clear. Clears the UARTOEINTR interrupt.</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BEIC</name>
              <description>This bit holds the break error interrupt clear. Clears the UARTBEINTR interrupt.</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PEIC</name>
              <description>This bit holds the parity error interrupt clear. Clears the UARTPEINTR interrupt.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FEIC</name>
              <description>This bit holds the framing error interrupt clear. Clears the UARTFEINTR interrupt.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RTIC</name>
              <description>This bit holds the receive timeout interrupt clear. Clears the UARTRTINTR interrupt.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXIC</name>
              <description>This bit holds the transmit interrupt clear. Clears the UARTTXINTR interrupt.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RXIC</name>
              <description>This bit holds the receive interrupt clear. Clears the UARTRXINTR interrupt.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSRMIC</name>
              <description>This bit holds the nUARTDSR modem interrupt clear. Clears the UARTDSRINTR interrupt.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCDMIC</name>
              <description>This bit holds the nUARTDCD modem interrupt clear. Clears the UARTDCDINTR interrupt.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTSMIC</name>
              <description>This bit holds the nUARTCTS modem interrupt clear. Clears the UARTCTSINTR interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>TXCMPMIC</name>
              <description>This bit holds the modem TXCMP interrupt clear.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <baseAddress>0x4001D000</baseAddress>
      <interrupt>
        <name>UART1</name>
        <description>UART1_IRQ</description>
        <value>16</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <baseAddress>0x4001E000</baseAddress>
      <interrupt>
        <name>UART2</name>
        <description>UART2_IRQ</description>
        <value>17</value>
      </interrupt>
    </peripheral>    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <baseAddress>0x4001F000</baseAddress>
      <interrupt>
        <name>UART3</name>
        <description>UART3_IRQ</description>
        <value>18</value>
      </interrupt>
    </peripheral>

    <peripheral>
      <name>USBPHY</name>
      <version>1.0</version>
      <description>USBPHY device register descriptions.</description>
      <!-- <groupName>GROUP_USBPHY</groupName> -->
      <baseAddress>0x400B4000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000088</size>
        <usage>registers</usage>
      </addressBlock>

      <registers>
        <register>
          <name>REG00</name>
          <description>Register description here</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF75</name>
              <description>Manually set the Rx Clock phase select. These bits will tune the HS RX path sample timing between digital and analog inside PHY: 3'b000 represents the earliest phase 3'b111 represents the latest phase The delay associated with each step is 256ps</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF43</name>
              <description>BG observation enable signal. Active low. When enabled, vref 400mV can be observed through USB0PP/USB0PN</description>
              <bitRange>[4:3]</bitRange>
              <access>read-write</access>

