AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>BF33</name>
              <description>Single ended disconnect detection enable, active high. 1: enable  Single ended disconnect detection  0: disenable  Single ended disconnect detection</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF22</name>
              <description>Half bit pre-emphasis enable. Active high 1: half bit pre-emphasize mode, recommended  0: full bit pre-emphasize mode</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF11</name>
              <description>Turn off LS/FS differential receiver  in suspend mode, active low 1: keep  the LS/FS differential receiver  , pin fss_rxrcv will toggling according to the DP/DM state 0: turn off  the LS/FS differential receiver, pin fss_rxrcv will not toggling according to the DP/DM state</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF00</name>
              <description>Bypass squelch trigger point configure in chirp modes , active high, keep the default value is strongly recommended . 1: Bypass squelch trigger point configure in chirp modes ,  0: squelch trigger point set to 250mV  in chirp modes.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG14</name>
          <description>Register description here</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF77</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF66</name>
              <description>BF66 field description needed.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF55</name>
              <description>PLL feedback divider ratio option.</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF42</name>
              <description>Tx HS pre-emphasis strength 3'b111 represents the strongest , 3'b000 the weakest</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF11</name>
              <description>PLL bandwidth option 1'b0 default 1'b1 increases the PLL bandwidth</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF00</name>
              <description>Dflop output select signal delay compared with digital clock enable signal 1'b0:3 clocks 1'b1:2 clocks</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG18</name>
          <description>Register description here</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF73</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF22</name>
              <description>Clk60m, clk12m and clk48m enable. 1'b0:disables the clocks 1'b1:enables the clocks</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF10</name>
              <description>HS receiver  bias current tuning. 2'b00 represents the minimum bias current 2'b11 represents the maximum bias current</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG1C</name>
          <description>Register description here</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF77</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF66</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF55</name>
              <description>BG power down control bit, active high 1: power down band-gap 0: normal operation mode</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF44</name>
              <description>480M clock out enable. 1'b0:pll disable 1'b1: 480M  clock out enable 1'b0: 480M clock out disable</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

