AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>REG34</name>
          <description>Register description here</description>
          <addressOffset>0x00000034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>BF70 field description needed.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG38</name>
          <description>Register description here</description>
          <addressOffset>0x00000038</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG3C</name>
          <description>Register description here</description>
          <addressOffset>0x0000003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF75</name>
              <description>Host disconnect filter select. 3'b100:6 clocks(480M clock) 3'b101:8 clocks 3'b111:disconnect disable Other: invalid</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF42</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF10</name>
              <description>BF10 field description needed.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG40</name>
          <description>Register description here</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF77</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF60</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG44</name>
          <description>Register description here</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF77</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF65</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF42</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF11</name>
              <description>Disconnect squelch and comparator calibration bypass, active high</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF00</name>
              <description>1: DP/DM will be sampled in HS Tx or Rx state 0: DP/DM will be sampled only in Hs Rx state</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG48</name>
          <description>Register description here</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF71</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BF00</name>
              <description>Enable TX shutdown, active LOW. This bit is only used for debug purpose , nothing to do  with the normal operation and signal quality, keeping the default value is strongly recommended.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>REG4C</name>
          <description>Register description here</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>BF70</name>
              <description>This bitfield is reserved.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

