AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>IDX0</name>
          <description>Provides additional control and status for IN transactions through the currently-selected endpoint. (To avoid CMSIS conflicts, the address here includes an additional offset of 0x1000. Access to this register must take this into account.) The value returned when this register is read reflects the status of an endpoint specified by setting the endpoint index in the CFG3_ENDPOINT field. When the endpoint index (CFG3_ENDPOINT) = 0, this field provides status and control of Endpoint 0. Also, the MAXPAYLOAD field defines the maximum amount of data that can be transferred through the selected IN endpoint in a single operation. There is a MAXPAYLOAD for each IN endpoint (except Endpoint 0). Note that the action initiated by setting a field in one of the IDXn registers when the selected endpoint has not been configured is undefined.</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xEBFFFFFF</resetMask>

          <fields>
            <field>
              <name>AutoSet</name>
              <description>Automatically Set InPktRdy. When set, the FIFONotEmptyInPktRdy field (for IN Endpoint 0) or InPktRdyOutPktRdy field (for IN Endpoint 1-5) in this register will be automatically set when data of the maximum packet size (set in MAXPAYLOAD field) is loaded into the IN FIFO.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AUTOSET</name>
                  <description>InPktRdy field is not automatically set when MAXPAYLOAD data size is loaded into the IN FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOSET</name>
                  <description>Applicable InPktRdy field is automatically set when MAXPAYLOAD data size is loaded into the IN FIFO. If a packet of less than the maximum packet size is loaded, InPktRdy will have to be set manually. Note: Should not be set for high-bandwidth Isochronous endpoints.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISO</name>
              <description>Isochronous Transfers. The CPU sets this bit to enable the IN endpoint for Isochronous transfers (ISO mode) or for Bulk/Interrupt transfers.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BULK_INT</name>
                  <description>Clear to enable the IN endpoint for Bulk/Interrupt transfers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO</name>
                  <description>Set to enable the IN endpoint for Isochronous transfers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Mode</name>
              <description>OUT/IN Mode. The CPU sets this bit to enable the endpoint direction as IN or OUT. Note: Only valid where the endpoint FIFO is used for both IN and OUT transactions, otherwise ignored.</description>
              <bitRange>[29:29]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUT</name>
                  <description>Clear to enable the OUT direction for endpoint.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN</name>
                  <description>Set to enable the IN direction for endpoint.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FrcDataTog</name>
              <description>Force Data Toggle. The CPU sets this bit to force the endpoint's IN data toggle to switch after each data packet is sent regardless of whether an ACK was received. This can be used by Interrupt IN endpoints that are used to communicate rate feedback for Isochronous endpoints.</description>
              <bitRange>[27:27]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FORCE_TOGGLE</name>
                  <description>Keep cleared to not force data toggle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FORCE_TOGGLE</name>
                  <description>Set to force the endpoint's IN data toggle to switch after each data packet is sent.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPktBufDis</name>
              <description>Double Packet Buffer Disable. This bit is used to control the use of Double Packet Buffering. It is ignored when Dynamic FIFO sizing is enabled. Clearing this bit does NOT necessarily enable Double Packet Buffering but rather allows Double Packet Buffering to be determined by the Endpoint's IDX2_INFIFOSZ setting and MAXPAYLOAD size relationship. Default is enabled.</description>
              <bitRange>[25:25]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_DPB</name>
                  <description>Clear to allow Double Packet Buffering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIS_DPB</name>
                  <description>Set to disable Double Packet Buffering regardless of the End Point FIFO size and MAXPAYLOAD size relationship.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D0</name>
              <description>Unused, always return 0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>

