AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>IncompTxServiceSetupEnd</name>
              <description>Incomplete Transmission / Service Setup End. When CFG3_ENDPOINT = 1 to 5, this bit serves as the IncompTx field. When CFG3_ENDPOINT = 0, this bit serves as the ServiceSetupEnd field.If CFG3_ENDPOINT = 0x1-0x5, then this bit serves as the IncompTx field. If the endpoint is being used for high-bandwidth Isochronous transfers, this bit is set to indicate when a large packet has been split into 2 or 3 packets for transmission but insufficient IN tokens have been received to send all the parts. The remainder of the current packet is then flushed from the FIFO (but any second packet in the FIFO will remain). Note: In anything other than a high bandwidth Isochronous transfer, this bit will always return 0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PACKET_SPLIT</name>
                  <description>Packet has NOT been split into multiple packets for transmission.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PACKET_SPLIT</name>
                  <description>A large packet has been split into 2 or 3 packets for transmission but insufficient IN tokens have been received to send all the parts.If CFG3_ENDPOINT = 0x0, this bit serves as the ServiceSetupEnd field.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ClrDataTogServicedOutPktRdy</name>
              <description>Clear Data Toggle / Serviced OUT Packet Ready. When CFG3_ENDPOINT = 1 to 5, this bit serves as the ClrDataTog field. When CFG3_ENDPOINT = 0, this bit serves as the ServicedOutPktReady field.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the ClrDataTog field. Setting this bit resets the endpoint IN data toggle to 0.If CFG3_ENDPOINT = 0x0, this bit serves as the ServicedOutPktReady field. The CPU writes a 1 to this bit to clear the OutPktRdy bit. This bit is cleared automatically.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SentStallSendStall</name>
              <description>Sent Stall / Send Stall. When CFG3_ENDPOINT = 1 to 5, this bit serves as the SentStall field. When CFG3_ENDPOINT = 0, this bit serves as the SendStall function.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the SentStall field. It is set when a STALL handshake is transmitted. The FIFO is flushed and the InPktRdy bit is cleared. The CPU should clear this bit.If CFG3_ENDPOINT = 0x0, this bit serves as the SendStall field. The CPU sets this bit to terminate the current transaction. The STALL handshake will be transmitted and then this bit will be cleared automatically. Note: This behavior differs from that of the SendStall bits associated with additional IN/OUT endpoints, which need to be cleared by the CPU.</description>
              <bitRange>[21:21]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>SendStallSetupEnd</name>
              <description>When CFG3_ENDPOINT = 1 to 5, this bit serves as the SendStall field. When CFG3_ENDPOINT = 0, this bit serves as the SetupEnd field.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the SendStall field. Setting this bit issues a STALL handshake to an IN token. The CPU clears this bit to terminate the stall condition.Note: This bit has no effect when the endpoint is being used for Isochronous transfers.If CFG3_ENDPOINT = 0x0, this bit serves as the SetupEnd field. It is set when a control transaction ends before the DataEnd bit has been set. An interrupt will be generated and the FIFO flushed at this time. The bit is cleared by the CPU writing a 1 to the ServicedSetupEnd bit.</description>
              <bitRange>[20:20]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FlushFIFODataEnd</name>
              <description>When CFG3_ENDPOINT = 1 to 5, this bit serves as the FlushFIFO field. When CFG3_ENDPOINT = 0, this bit serves as the DataEnd bit.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the FlushFIFO field. Setting this bit flushes the next packet to be transmitted from the endpoint IN FIFO. The FIFO pointer is reset and the InPktRdy bit is cleared. May be set simultaneously with InPktRdy to abort the packet that has just been loaded into the FIFO.Note 1: FlushFIFO should only be set when InPktRdy is set (at other times, it may cause data corruption).Note 2: If the FIFO contains two packets, FlushFIFO may need to be set twice to completely clear the FIFO.If CFG3_ENDPOINT = 0x0, this bit serves as the DataEnd bit. Set this bit when (1) setting InPktRdy for the last data packet, (2) clearing OutPktRdy after unloading the last data packet, or (3) setting InPktRdy for a zero length data packet.It is cleared automatically.</description>
              <bitRange>[19:19]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>UnderRunSentStall</name>
              <description>Under Run / Sent Stall. When CFG3_ENDPOINT = 1 to 5, this bit serves as the UnderRun field. When CFG3_ENDPOINT = 0, this bit serves as the SentStall field.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the UnderRun field. In ISO mode this bit is set when a zero length data packet is sent after receiving an IN token with the InPktRdy bit not set. In Bulk/Interrupt mode, this bit is set when a NAK is returned in response to an IN token. The CPU should clear this bit.If CFG3_ENDPOINT = 0x0, this bit serves as the SentStall field. This bit is set when a STALL handshake is transmitted. The CPU should clear this bit.</description>
              <bitRange>[18:18]</bitRange>
              <access>read-write</access>

