AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>FIFONotEmptyInPktRdy</name>
              <description>FIFO Not Empty / IN Packet Ready. When CFG3_ENDPOINT = 1 to 5, this bit serves as the FIFONotEmpty field. When CFG3_ENDPOINT = 0, this bit serves as the InPktRdy bit.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the FIFONotEmpty field. It is set when there is at least 1 packet in the IN FIFO.If CFG3_ENDPOINT = 0x0, this bit serves as the InPktRdy bit. Set this bit after loading a data packet into the FIFO. It is cleared automatically when the data packet has been transmitted. An interrupt is generated when this bit is cleared (if enabled).</description>
              <bitRange>[17:17]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>InPktRdyOutPktRdy</name>
              <description>IN Packet Ready / OUT Packet Ready. When CFG3_ENDPOINT > 0, this bit serves as the InPktRdy field. When CFG3_ENDPOINT = 0, this bit serves as the OutPkyRdy bit.If CFG3_ENDPOINT = 0x1-0x5, this bit serves as the InPktRdy field. Set this bit after loading a data packet into the FIFO. It is cleared automatically when a data packet has been transmitted. If the FIFO is double-buffered, it is also automatically cleared when there is space for a second packet in the FIFO. An interrupt is generate (if enabled) when the bit is cleared.If CFG3_ENDPOINT = 0x0, this bit serves as the OutPkyRdy bit. This bit is set when a data packet has been received. An interrupt is generate when this bit is set (if enabled). The CPU clears this bit by setting the ServicedOutPktRdy bit.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PKTSPLITOPTION</name>
              <description>Packet Split Option. When IDX0_ISO = 1, this bit serves as the MAXPAYLOAD multiplier for Isochronous IN transfers. When IDX0_ISO = 0, this bit serves as the MAXPAYLOAD multiplier for Bulk IN transfers.If IDX0_ISO = 0x1, this field sets the multiplier for Isochronous transfers. For Isochronous endpoints operating in High-Speed mode and with the High-bandwidth option enabled, PKTSPLITOPTION may be either 2 or 3 (corresponding to this field's bit 0 set or bit 1 set, respectively, and bits[4:2] are ignored) and it specifies the maximum number of such transactions that can take place in a single microframe. If either bit 0 or bit 1 is non-zero, the USB Controller will automatically split any data packet written to the FIFO into up to 2 or 3 'USB' packets, each containing the specified MAXPAYLOAD (or less). The maximum payload for each transaction is 1024 bytes, so this allows up to 3072 bytes to be transmitted in each microframe. (For Isochronous transfers in full-speed mode or if High-bandwidth is not enabled, bits 0 and 1 are ignored.)If IDX0_ISO = 0x0, this field sets the multiplier for Bulk transfers. The field setting can be up to 31, and the multiplier, m, is (field setting + 1).  The multiplier defines the maximum number of 'USB' packets of the specified MAXPAYLOAD data bytes into which a single data packet placed in the FIFO should be split prior to transfer. The data packet is required to be an exact multiple of the MAXPAYLOAD, which is itself required to be either 8, 16, 32, 64 or (in the case of High Speed transfers) 512 bytes.</description>
              <bitRange>[15:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>MAXPAYLOAD</name>
              <description>Maximum Payload transmitted in a single transaction. The total amount of data represented by MAXPAYLOAD x (PKTSPLITOPTION + 1) must not exceed the FIFO size for the IN endpoint, and should not exceed half the FIFO size if double-buffering is required. Note: The value written here (multiplied by PKTSPLITOPTION + 1 in the case of high-bandwidth Isochronous transfers) must match the value given in the wMaxPacketSize field of the Standard Endpoint Descriptor for the associated endpoint (see USB Specification Revision 2.0, Chapter 9). A mismatch could cause unexpected results.</description>
              <bitRange>[10:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>IDX1</name>
          <description>Provides control and status bits for OUT transactions through the currently-selected endpoint. It is reset to 0. The value returned when this register is read reflects the status of an endpoint specified by setting the endpoint index in the CFG3_ENDPOINT field. Also, the MAXPAYLOAD field defines the maximum amount of data that can be transferred through the selected OUT endpoint in a single operation. There is a MAXPAYLOAD for each OUT endpoint (except Endpoint 0). Note that the action initiated by setting a field in one of the IDXn registers when the selected endpoint has not been configured is undefined.</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xD3FFFFFF</resetMask>

          <fields>
            <field>
              <name>AutoClear</name>
              <description>Automatically Clear OutPktRdy.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_AUTOCLR</name>
                  <description>OutPktRdy field will not be automatically cleared when a packet of MAXPAYLOAD data size is unloaded from the OUT FIFO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTOCLR</name>
                  <description>OutPktRdy field will be automatically cleared when a packet of MAXPAYLOAD data size is unloaded from the OUT FIFO. When packets of less than the maximum packet size are unloaded, OutPktRdy must be cleared manually. Note: Should not be set for high bandwidth Isochronous endpoints.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISO</name>
              <description>Isochronous Transfers. The CPU sets this bit to enable the OUT endpoint for either Isochronous transfers (ISO mode) or for Bulk/Interrupt transfers.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BULK_INT</name>
                  <description>Clear to enable the OUT endpoint for Bulk/Interrupt transfers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ISO</name>
                  <description>Set to enable the OUT endpoint for Isochronous transfers.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DisNye</name>
              <description>Disable NYET Handshakes / PID Error. For Bulk/Interrupt transactions, this bit disable the sending of NYET handshakes. For Bulk/Interrupt transactions, indicates PID errors.If IDX1_ISO = 0x1, this field is read-only and, when set, indicates a PID error in the received packet for Isochronous transfers.If IDX1_ISO = 0x0, this field disables NYET Handshakes for Bulk/Interrupt transactions. Set this bit to disable the sending of NYET handshakes. When set, all successfully received OUT packets are ACK'd including at the point at which the FIFO becomes full.Note: This bit has an effect only in High-speed mode, when it should be set for all Interrupt endpoints.</description>
              <bitRange>[28:28]</bitRange>
              <access>read-write</access>

