AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT1</name>
          <description>Holds the configurable chirp timeout value.</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00004074</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CTUCH</name>
              <description>Configurable Chirp Timeout timer; default value of 0x4074 corresponds to a delay of 1.1ms (60Mhz clock cycles * 4 * 0x4074).</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT2</name>
          <description>Holds the configurable delay from the end of High Speed resume signal to enable UTM normal operating mode.</description>
          <addressOffset>0x00000084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000032</resetValue>
          <resetMask>0x0000FFFF</resetMask>

          <fields>
            <field>
              <name>CTHRSTN</name>
              <description>Configurable delay from the end of High Speed resume signaling to enabling UTM normal operating mode. Default value of 0x32 corresponds to a delay of 3us. This programmed delay is equivalent to the number of 60MHz clock cycles * 4.</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>CLKCTRL</name>
          <description>Provides optional control for turning off the interface clocks to USB Controller and PHY as well as the reference clock to the USB PHY.</description>
          <addressOffset>0x00002000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03010101</resetMask>

          <fields>
            <field>
              <name>PHYREFCLKSEL</name>
              <description>USB PHY reference clock select.For Full_Speed Mode, set the reference CLKSEL to use HFRC-based clock.  For High-Speed Mode, set the reference CLKSEL to use HFRC2-based clock.  The HFRC2-based clock is higher power, but meets the low-jitter requirement for High-Speed Mode.</description>
              <bitRange>[25:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFRC48</name>
                  <description>48 MHz HFRC-based reference clock for Full-Speed Mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC248</name>
                  <description>48 MHz HFRC2-based reference clock for High-Speed Mode</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFRC24</name>
                  <description>24 MHz HFRC-based reference clock for Full-Speed Mode</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYAPBLCLKDIS</name>
              <description>Setting this bit turns off PHY control logic clock.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CTRLAPBCLKDIS</name>
              <description>Setting this bit turns off the Controller logic clock.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>PHYREFCLKDIS</name>
              <description>Setting this bit turns off the PHY reference clock.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>SRAMCTRL</name>
          <description>Provides optional SRAM tuning control.</description>
          <addressOffset>0x00002004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000007F</resetValue>
          <resetMask>0x00007FFF</resetMask>

          <fields>
            <field>
              <name>STOV</name>
              <description>SRAM self-timed override</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WABL</name>
              <description>SRAM write assist enable</description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>WABLM</name>
              <description>SRAM No margin adjustment</description>
              <bitRange>[12:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RAWL</name>
              <description>SRAM Read assist enable</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RAWLM</name>
              <description>SRAM Adjustment for margin for this read assist scheme</description>
              <bitRange>[8:7]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INCDLY</name>
                  <description>Increased margin adjustment, increased delay for enabling write assist.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MBINCDLY</name>
                  <description>Minimum boost level with increased delay for enabling write assist.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMNB</name>
                  <description>Increased margin adjustment with more negative boost.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MMNB</name>
                  <description>Minimum margin adjustment with lowest negative boost level.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EMAW</name>
              <description>Extra margin adjustment for write operations</description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>

