AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>EMAS</name>
              <description>Extra margin adjustment sense amplifier pulse</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>EMA</name>
              <description>Extra margin adjustment</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RET1N</name>
              <description>Retention mode 1 enable, active-LOW</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>UTMISTICKYSTATUS</name>
          <description>This read only register provides the results from the PHY OBS port controlled by reg 0x20[5:4]. IF any bits are set, the bits are sticky. Clear this register using the OBSCLRSTAT register.</description>
          <addressOffset>0x00002014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>obsportstciky</name>
              <description>These bits are read only status bits from the PHY OBS port</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OBS3</name>
                  <description>bit 1:HS BIST results, bit 0:FS BIST results</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBS2</name>
                  <description>bit 1: ODT calibration state, bit 0: Current calibration state</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBS1</name>
                  <description>bit 1: Rx squelch signal, bit 0: Rx datap</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OBS0</name>
                  <description>bit 1: PLL lock signal, bit 0: Host Disconnect</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OBSCLRSTAT</name>
          <description>Clears all bits in the sticky obs status register.</description>
          <addressOffset>0x00002018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>

          <fields>
            <field>
              <name>CLRSTAT</name>
              <description>Writing a 1 to this bit clears all bits in the UTMISTICKYSTATUS register.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DPDMPULLDOWN</name>
          <description>Enables a pulldown resistor(15K) on D+ or D-</description>
          <addressOffset>0x0000201C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DPPULLDOWN</name>
              <description>Enables a pulldown resistor(15K) on D+</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DMPULLDOWN</name>
              <description>Enables a pulldown resistor(15K) on D-</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BCDETSTATUS</name>
          <description>USB Battery Charge Detenction Registers</description>
          <addressOffset>0x00002020</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000037</resetMask>

          <fields>
            <field>
              <name>DMCOMPOUT</name>
              <description>DM comparator output</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPCOMPOUT</name>
              <description>DP comparator output</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DCPDETECTED</name>
              <description>Dedicated charging port detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CPDETECTED</name>
              <description>Charging port detected</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DPATTACHED</name>
              <description>Data pin attachment detected</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BCDETCRTL1</name>
          <description>Battery Charging detection main control register</description>
          <addressOffset>0x00002024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x80000BFF</resetMask>

          <fields>
            <field>
              <name>USBSWRESET</name>
              <description>Holds a USB controller and PHY in the reset for BC detection</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>

