AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>USBDCOMPEN</name>
              <description>Enables DP/DM vendor-specific detection comparator</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>USBDCOMPREF</name>
              <description>Sets DP/DM vendor-specific comparator ref voltage</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1P25V</name>
                  <description>1.25V</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P35</name>
                  <description>2.35V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3P10V</name>
                  <description>3.10V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P65</name>
                  <description>1.65V (VCCIO/2)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IDPSINKEN</name>
              <description>Enables DP current sink</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDMSRCEN</name>
              <description>Enables DM voltage source</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RDMPDWNEN</name>
              <description>Enables DM BC 1.2 pull-down resistor</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>VDPSRCEN</name>
              <description>Enables DP voltage source</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IDPSRCEN</name>
              <description>Enables DP current source</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>IDMSINKEN</name>
              <description>Enables DM current sink</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BCWEAKPULLDOWNEN</name>
              <description>Enables weak sink current on DP and DM</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BCWEAKPULLUPEN</name>
              <description>Enables weak source current to DP and DM</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>BCDETCRTL2</name>
          <description>Battery Charging auxillary detection control register</description>
          <addressOffset>0x00002028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000500</resetValue>
          <resetMask>0x00000F0F</resetMask>

          <fields>
            <field>
              <name>BCWEAKPULLDOWNTUNE</name>
              <description>Weak sink resistor to both DP and DM tuning. Trimmable.</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>BCWEAKPULLUPTUNE</name>
              <description>Weak source resistor to both DP and DM tuning. Trimmable.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEDCPDET</name>
              <description>Force output dedicated charging port detected</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCECPDET</name>
              <description>Force output charging port detected</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>FORCEDPATTACHED</name>
              <description>Force output dp_attached</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>CHARGEDETBYP</name>
              <description>BC detection bypass</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>VCOMP</name>
      <version>1.0</version>
      <description>Voltage Comparator</description>
      <!-- <groupName>GROUP_VCOMP</groupName> -->
      <baseAddress>0x4000C000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000210</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>VCOMP</name>
        <description>VCOMP_IRQ</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>The Voltage Comparator Configuration Register contains the software control for selecting beween the 4 options for the positive input as well as the multiple options for the reference input.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0303</resetMask>

          <fields>
            <field>
              <name>LVLSEL</name>
              <description>When the reference input NSEL is set to NSEL_DAC, this bitfield selects the voltage level for the negative input to the comparator.</description>
              <bitRange>[19:16]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0P58V</name>
                  <description>Set Reference input to 0.58 Volts.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P77V</name>
                  <description>Set Reference input to 0.77 Volts.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0P97V</name>
                  <description>Set Reference input to 0.97 Volts.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P16V</name>
                  <description>Set Reference input to 1.16 Volts.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P35V</name>
                  <description>Set Reference input to 1.35 Volts.</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P55V</name>
                  <description>Set Reference input to 1.55 Volts.</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P74V</name>
                  <description>Set Reference input to 1.74 Volts.</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1P93V</name>
                  <description>Set Reference input to 1.93 Volts.</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2P13V</name>
                  <description>Set Reference input to 2.13 Volts.</description>
                  <value>8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NSEL</name>
              <description>This bitfield selects the negative input to the comparator.</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREFEXT1</name>
                  <description>Use external reference 1 for reference input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFEXT2</name>
                  <description>Use external reference 2 for reference input.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VREFEXT3</name>
                  <description>Use external reference 3 for reference input.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC</name>
                  <description>Use DAC output selected by LVLSEL for reference input.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSEL</name>
              <description>This bitfield selects the positive input to the comparator.</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VDDADJ</name>
                  <description>Use VDDADJ for the positive input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VTEMP</name>
                  <description>Use the temperature sensor output for the positive input. Note: If this channel is selected for PSEL, the bandap circuit required for temperature comparisons will automatically turn on. The bandgap circuit requires 11us to stabalize.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VEXT1</name>
                  <description>Use external voltage 0 for positive input.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VEXT2</name>
                  <description>Use external voltage 1 for positive input.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Status</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>PWDSTAT</name>
              <description>This bit indicates the power down state of the voltage comparator.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>POWERED_DOWN</name>
                  <description>The voltage comparator is powered down.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POWERED_UP</name>
                  <description>The voltage comparator is powered up.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMPOUT</name>
              <description>This bit is 1 if the positive input of the comparator is greater than the negative input.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VOUT_LOW</name>
                  <description>The negative input of the comparator is greater than the positive input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VOUT_HIGH</name>
                  <description>The positive input of the comparator is greater than the negative input.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PWDKEY</name>
          <description>Write a value of 0x37 to unlock, write any other value to lock. This register also indicates lock status when read. When in the unlccked state (i.e. 0x37 has been written), it reads as 1. When in the locked state, it reads as 0.</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>

          <fields>
            <field>
              <name>PWDKEY</name>
              <description>Key register value.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Key</name>
                  <description>Key value to unlock the register.</description>
                  <value>55</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTEN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

