AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSTAT</name>
          <description>Read bits from this register to discover the cause of a recent interrupt.</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTCLR</name>
          <description>Write a 1 to a bit in this register to clear the interrupt status associated with that bit.</description>
          <addressOffset>0x00000208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>INTSET</name>
          <description>Write a 1 to a bit in this register to instantly generate an interrupt from this module. (Generally used for testing purposes).</description>
          <addressOffset>0x0000020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>OUTHI</name>
              <description>This bit is the vcompout high interrupt.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>OUTLOW</name>
              <description>This bit is the vcompout low interrupt.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
      </registers>
    </peripheral>

    <peripheral>
      <name>WDT</name>
      <version>1.0</version>
      <description>Watchdog Timer</description>
      <!-- <groupName>GROUP_WDT</groupName> -->
      <baseAddress>0x40024000</baseAddress>
      <size>32</size>
      <access>read-write</access>

      <addressBlock>
        <offset>0</offset>
        <size>0x00000230</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>WDT</name>
        <description>WDT_IRQ</description>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>CFG</name>
          <description>This is the configuration register for the watch dog timer. It controls the enable, interrupt set, clocks for the timer, the compare values for the counters to trigger a reset or interrupt. This register can only be written to if the watch dog timer is unlocked (WDTLOCK is not set).</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00FFFF00</resetValue>
          <resetMask>0x07FFFF0F</resetMask>

          <fields>
            <field>
              <name>CLKSEL</name>
              <description>Select the frequency for the WDT. All values not enumerated below are undefined.</description>
              <bitRange>[26:24]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Low Power Mode. This setting disables the watch dog timer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128HZ</name>
                  <description>128 Hz LFRC clock.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16HZ</name>
                  <description>16 Hz LFRC clock.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1HZ</name>
                  <description>1 Hz LFRC clock.</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1_16HZ</name>
                  <description>1/16th Hz LFRC clock.</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog interrupt.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>RESVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog reset. This will cause a software reset.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

