AmbiqAI/edgeimpulse-examples/fomo/apollo5-new/pack/svd/board.svd
            </field>
            <field>
              <name>DSP1INTVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog interrupt.</description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1RESVAL</name>
              <description>This bitfield is the compare value for counter bits 7:0 to generate a watchdog reset for the DSP logic. This will cause a software reset to the DSP core if the RESEN bit is set and optionally interrupt the CPU.</description>
              <bitRange>[15:8]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1PMRESEN</name>
              <description>This bitfield enables the DSP1 Power Controller (PM) reset. This needs to be set together with the DSP1WDTEN bit to allow the reset to trigger.</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1RESEN</name>
              <description>This bitfield enables the DSP1 reset.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1INTEN</name>
              <description>This bitfield enables the DSP1 WDT interrupt. Note : This bit must be set before the interrupt status bit will reflect a watchdog timer expiration. The IER interrupt register must also be enabled for a WDT interrupt to be sent to the NVIC.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

            </field>
            <field>
              <name>DSP1WDTEN</name>
              <description>This bitfield enables the WDT. Setting the lock implicitly sets the WTDEN bit as well.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>DSP1RSTRT</name>
          <description>This register will restart the watchdog timer. Writing a special key value into this register will result in the watch dog timer being reset, so that the count will start again. It is expected that the software will periodically write to this register to indicate that the system is functional. The watch dog timer can continue running when the system is in deep sleep, and the interrupt will trigger the wake. After the wake, the core can reset the watch dog timer.</description>
          <addressOffset>0x00000024</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DSP1RSTART</name>
              <description>Writing 0xd2 to DSP1RSTRT restarts the watchdog timer. This is a write only register. Reading this register will return 0.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>This is the key value to write to WDTRSTRT to restart the WDT. This is a write only register.</description>
                  <value>210</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Reset value</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1TLOCK</name>
          <description>This register locks the watch dog timer. Once it is locked, the configuration register (DSP1CFG) for watch dog timer cannot be written to and the timer is automatically enabled (WDTEN is set).</description>
          <addressOffset>0x00000028</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DSP1LOCK</name>
              <description>Writing 0x4e locks the watchdog timer. Once locked, the WDTCFG reg cannot be written and WDTEN is set.</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEYVALUE</name>
                  <description>This is the key value to write to WDTLOCK to lock the WDT.</description>
                  <value>78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Reset Value.</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSP1COUNT</name>
          <description>This register holds the current count for the watch dog timer. This is a read only register. SW cannot set the value in the counter, but can reset it.</description>
          <addressOffset>0x0000002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>

          <fields>
            <field>
              <name>DSP1COUNT</name>
              <description>Read-Only current value of the WDT counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>

            </field>
          </fields>
        </register>
        <register>
          <name>WDTIEREN</name>
          <description>Set bits in this register to allow this module to generate the corresponding interrupt.</description>
          <addressOffset>0x00000200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>

          <fields>
            <field>
              <name>DSPRESETINT</name>
              <description>Indicates that one of the DSP timers has issued a reset or pmreset to the DSP core. This is used to interrupt the main CPU.</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>

